NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* STOPPED @Bit 1 : Enable or disable interrupt for event STOPPED */
  #define AUXPLL_INTEN_STOPPED_Pos (1UL)             /*!< Position of STOPPED field.                                           */
  #define AUXPLL_INTEN_STOPPED_Msk (0x1UL << AUXPLL_INTEN_STOPPED_Pos) /*!< Bit mask of STOPPED field.                         */
  #define AUXPLL_INTEN_STOPPED_Min (0x0UL)           /*!< Min enumerator value of STOPPED field.                               */
  #define AUXPLL_INTEN_STOPPED_Max (0x1UL)           /*!< Max enumerator value of STOPPED field.                               */
  #define AUXPLL_INTEN_STOPPED_Disabled (0x0UL)      /*!< Disable                                                              */
  #define AUXPLL_INTEN_STOPPED_Enabled (0x1UL)       /*!< Enable                                                               */

/* LOCKED @Bit 2 : Enable or disable interrupt for event LOCKED */
  #define AUXPLL_INTEN_LOCKED_Pos (2UL)              /*!< Position of LOCKED field.                                            */
  #define AUXPLL_INTEN_LOCKED_Msk (0x1UL << AUXPLL_INTEN_LOCKED_Pos) /*!< Bit mask of LOCKED field.                            */
  #define AUXPLL_INTEN_LOCKED_Min (0x0UL)            /*!< Min enumerator value of LOCKED field.                                */
  #define AUXPLL_INTEN_LOCKED_Max (0x1UL)            /*!< Max enumerator value of LOCKED field.                                */
  #define AUXPLL_INTEN_LOCKED_Disabled (0x0UL)       /*!< Disable                                                              */
  #define AUXPLL_INTEN_LOCKED_Enabled (0x1UL)        /*!< Enable                                                               */


/* AUXPLL_INTENSET: Enable interrupt */
  #define AUXPLL_INTENSET_ResetValue (0x00000000UL)  /*!< Reset value of INTENSET register.                                    */

/* STARTED @Bit 0 : Write '1' to enable interrupt for event STARTED */
  #define AUXPLL_INTENSET_STARTED_Pos (0UL)          /*!< Position of STARTED field.                                           */
  #define AUXPLL_INTENSET_STARTED_Msk (0x1UL << AUXPLL_INTENSET_STARTED_Pos) /*!< Bit mask of STARTED field.                   */
  #define AUXPLL_INTENSET_STARTED_Min (0x0UL)        /*!< Min enumerator value of STARTED field.                               */
  #define AUXPLL_INTENSET_STARTED_Max (0x1UL)        /*!< Max enumerator value of STARTED field.                               */
  #define AUXPLL_INTENSET_STARTED_Set (0x1UL)        /*!< Enable                                                               */
  #define AUXPLL_INTENSET_STARTED_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define AUXPLL_INTENSET_STARTED_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* STOPPED @Bit 1 : Write '1' to enable interrupt for event STOPPED */
  #define AUXPLL_INTENSET_STOPPED_Pos (1UL)          /*!< Position of STOPPED field.                                           */
  #define AUXPLL_INTENSET_STOPPED_Msk (0x1UL << AUXPLL_INTENSET_STOPPED_Pos) /*!< Bit mask of STOPPED field.                   */
  #define AUXPLL_INTENSET_STOPPED_Min (0x0UL)        /*!< Min enumerator value of STOPPED field.                               */
  #define AUXPLL_INTENSET_STOPPED_Max (0x1UL)        /*!< Max enumerator value of STOPPED field.                               */
  #define AUXPLL_INTENSET_STOPPED_Set (0x1UL)        /*!< Enable                                                               */
  #define AUXPLL_INTENSET_STOPPED_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define AUXPLL_INTENSET_STOPPED_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* LOCKED @Bit 2 : Write '1' to enable interrupt for event LOCKED */
  #define AUXPLL_INTENSET_LOCKED_Pos (2UL)           /*!< Position of LOCKED field.                                            */
  #define AUXPLL_INTENSET_LOCKED_Msk (0x1UL << AUXPLL_INTENSET_LOCKED_Pos) /*!< Bit mask of LOCKED field.                      */
  #define AUXPLL_INTENSET_LOCKED_Min (0x0UL)         /*!< Min enumerator value of LOCKED field.                                */
  #define AUXPLL_INTENSET_LOCKED_Max (0x1UL)         /*!< Max enumerator value of LOCKED field.                                */
  #define AUXPLL_INTENSET_LOCKED_Set (0x1UL)         /*!< Enable                                                               */
  #define AUXPLL_INTENSET_LOCKED_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define AUXPLL_INTENSET_LOCKED_Enabled (0x1UL)     /*!< Read: Enabled                                                        */


/* AUXPLL_INTENCLR: Disable interrupt */
  #define AUXPLL_INTENCLR_ResetValue (0x00000000UL)  /*!< Reset value of INTENCLR register.                                    */

/* STARTED @Bit 0 : Write '1' to disable interrupt for event STARTED */
  #define AUXPLL_INTENCLR_STARTED_Pos (0UL)          /*!< Position of STARTED field.                                           */
  #define AUXPLL_INTENCLR_STARTED_Msk (0x1UL << AUXPLL_INTENCLR_STARTED_Pos) /*!< Bit mask of STARTED field.                   */
  #define AUXPLL_INTENCLR_STARTED_Min (0x0UL)        /*!< Min enumerator value of STARTED field.                               */
  #define AUXPLL_INTENCLR_STARTED_Max (0x1UL)        /*!< Max enumerator value of STARTED field.                               */
  #define AUXPLL_INTENCLR_STARTED_Clear (0x1UL)      /*!< Disable                                                              */
  #define AUXPLL_INTENCLR_STARTED_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define AUXPLL_INTENCLR_STARTED_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* STOPPED @Bit 1 : Write '1' to disable interrupt for event STOPPED */
  #define AUXPLL_INTENCLR_STOPPED_Pos (1UL)          /*!< Position of STOPPED field.                                           */
  #define AUXPLL_INTENCLR_STOPPED_Msk (0x1UL << AUXPLL_INTENCLR_STOPPED_Pos) /*!< Bit mask of STOPPED field.                   */
  #define AUXPLL_INTENCLR_STOPPED_Min (0x0UL)        /*!< Min enumerator value of STOPPED field.                               */
  #define AUXPLL_INTENCLR_STOPPED_Max (0x1UL)        /*!< Max enumerator value of STOPPED field.                               */
  #define AUXPLL_INTENCLR_STOPPED_Clear (0x1UL)      /*!< Disable                                                              */
  #define AUXPLL_INTENCLR_STOPPED_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define AUXPLL_INTENCLR_STOPPED_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* LOCKED @Bit 2 : Write '1' to disable interrupt for event LOCKED */
  #define AUXPLL_INTENCLR_LOCKED_Pos (2UL)           /*!< Position of LOCKED field.                                            */
  #define AUXPLL_INTENCLR_LOCKED_Msk (0x1UL << AUXPLL_INTENCLR_LOCKED_Pos) /*!< Bit mask of LOCKED field.                      */
  #define AUXPLL_INTENCLR_LOCKED_Min (0x0UL)         /*!< Min enumerator value of LOCKED field.                                */
  #define AUXPLL_INTENCLR_LOCKED_Max (0x1UL)         /*!< Max enumerator value of LOCKED field.                                */
  #define AUXPLL_INTENCLR_LOCKED_Clear (0x1UL)       /*!< Disable                                                              */
  #define AUXPLL_INTENCLR_LOCKED_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define AUXPLL_INTENCLR_LOCKED_Enabled (0x1UL)     /*!< Read: Enabled                                                        */


/* AUXPLL_INTPEND: Pending interrupts */
  #define AUXPLL_INTPEND_ResetValue (0x00000000UL)   /*!< Reset value of INTPEND register.                                     */

