NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* BELLBOARD_INTENCLR1: Disable interrupt */
  #define BELLBOARD_INTENCLR1_ResetValue (0x00000000UL) /*!< Reset value of INTENCLR1 register.                                */

/* TRIGGERED0 @Bit 0 : Write '1' to disable interrupt for event TRIGGERED[0] */
  #define BELLBOARD_INTENCLR1_TRIGGERED0_Pos (0UL)   /*!< Position of TRIGGERED0 field.                                        */
  #define BELLBOARD_INTENCLR1_TRIGGERED0_Msk (0x1UL << BELLBOARD_INTENCLR1_TRIGGERED0_Pos) /*!< Bit mask of TRIGGERED0 field.  */
  #define BELLBOARD_INTENCLR1_TRIGGERED0_Min (0x0UL) /*!< Min enumerator value of TRIGGERED0 field.                            */
  #define BELLBOARD_INTENCLR1_TRIGGERED0_Max (0x1UL) /*!< Max enumerator value of TRIGGERED0 field.                            */
  #define BELLBOARD_INTENCLR1_TRIGGERED0_Clear (0x1UL) /*!< Disable                                                            */
  #define BELLBOARD_INTENCLR1_TRIGGERED0_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define BELLBOARD_INTENCLR1_TRIGGERED0_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* TRIGGERED1 @Bit 1 : Write '1' to disable interrupt for event TRIGGERED[1] */
  #define BELLBOARD_INTENCLR1_TRIGGERED1_Pos (1UL)   /*!< Position of TRIGGERED1 field.                                        */
  #define BELLBOARD_INTENCLR1_TRIGGERED1_Msk (0x1UL << BELLBOARD_INTENCLR1_TRIGGERED1_Pos) /*!< Bit mask of TRIGGERED1 field.  */
  #define BELLBOARD_INTENCLR1_TRIGGERED1_Min (0x0UL) /*!< Min enumerator value of TRIGGERED1 field.                            */
  #define BELLBOARD_INTENCLR1_TRIGGERED1_Max (0x1UL) /*!< Max enumerator value of TRIGGERED1 field.                            */
  #define BELLBOARD_INTENCLR1_TRIGGERED1_Clear (0x1UL) /*!< Disable                                                            */
  #define BELLBOARD_INTENCLR1_TRIGGERED1_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define BELLBOARD_INTENCLR1_TRIGGERED1_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* TRIGGERED2 @Bit 2 : Write '1' to disable interrupt for event TRIGGERED[2] */
  #define BELLBOARD_INTENCLR1_TRIGGERED2_Pos (2UL)   /*!< Position of TRIGGERED2 field.                                        */
  #define BELLBOARD_INTENCLR1_TRIGGERED2_Msk (0x1UL << BELLBOARD_INTENCLR1_TRIGGERED2_Pos) /*!< Bit mask of TRIGGERED2 field.  */
  #define BELLBOARD_INTENCLR1_TRIGGERED2_Min (0x0UL) /*!< Min enumerator value of TRIGGERED2 field.                            */
  #define BELLBOARD_INTENCLR1_TRIGGERED2_Max (0x1UL) /*!< Max enumerator value of TRIGGERED2 field.                            */
  #define BELLBOARD_INTENCLR1_TRIGGERED2_Clear (0x1UL) /*!< Disable                                                            */
  #define BELLBOARD_INTENCLR1_TRIGGERED2_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define BELLBOARD_INTENCLR1_TRIGGERED2_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* TRIGGERED3 @Bit 3 : Write '1' to disable interrupt for event TRIGGERED[3] */
  #define BELLBOARD_INTENCLR1_TRIGGERED3_Pos (3UL)   /*!< Position of TRIGGERED3 field.                                        */
  #define BELLBOARD_INTENCLR1_TRIGGERED3_Msk (0x1UL << BELLBOARD_INTENCLR1_TRIGGERED3_Pos) /*!< Bit mask of TRIGGERED3 field.  */
  #define BELLBOARD_INTENCLR1_TRIGGERED3_Min (0x0UL) /*!< Min enumerator value of TRIGGERED3 field.                            */
  #define BELLBOARD_INTENCLR1_TRIGGERED3_Max (0x1UL) /*!< Max enumerator value of TRIGGERED3 field.                            */
  #define BELLBOARD_INTENCLR1_TRIGGERED3_Clear (0x1UL) /*!< Disable                                                            */
  #define BELLBOARD_INTENCLR1_TRIGGERED3_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define BELLBOARD_INTENCLR1_TRIGGERED3_Enabled (0x1UL) /*!< Read: Enabled                                                    */


/* BELLBOARD_INTPEND1: Pending interrupts */
  #define BELLBOARD_INTPEND1_ResetValue (0x00000000UL) /*!< Reset value of INTPEND1 register.                                  */

/* TRIGGERED0 @Bit 0 : Read pending status of interrupt for event TRIGGERED[0] */
  #define BELLBOARD_INTPEND1_TRIGGERED0_Pos (0UL)    /*!< Position of TRIGGERED0 field.                                        */
  #define BELLBOARD_INTPEND1_TRIGGERED0_Msk (0x1UL << BELLBOARD_INTPEND1_TRIGGERED0_Pos) /*!< Bit mask of TRIGGERED0 field.    */
  #define BELLBOARD_INTPEND1_TRIGGERED0_Min (0x0UL)  /*!< Min enumerator value of TRIGGERED0 field.                            */
  #define BELLBOARD_INTPEND1_TRIGGERED0_Max (0x1UL)  /*!< Max enumerator value of TRIGGERED0 field.                            */
  #define BELLBOARD_INTPEND1_TRIGGERED0_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define BELLBOARD_INTPEND1_TRIGGERED0_Pending (0x1UL) /*!< Read: Pending                                                     */

/* TRIGGERED1 @Bit 1 : Read pending status of interrupt for event TRIGGERED[1] */
  #define BELLBOARD_INTPEND1_TRIGGERED1_Pos (1UL)    /*!< Position of TRIGGERED1 field.                                        */
  #define BELLBOARD_INTPEND1_TRIGGERED1_Msk (0x1UL << BELLBOARD_INTPEND1_TRIGGERED1_Pos) /*!< Bit mask of TRIGGERED1 field.    */
  #define BELLBOARD_INTPEND1_TRIGGERED1_Min (0x0UL)  /*!< Min enumerator value of TRIGGERED1 field.                            */
  #define BELLBOARD_INTPEND1_TRIGGERED1_Max (0x1UL)  /*!< Max enumerator value of TRIGGERED1 field.                            */
  #define BELLBOARD_INTPEND1_TRIGGERED1_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define BELLBOARD_INTPEND1_TRIGGERED1_Pending (0x1UL) /*!< Read: Pending                                                     */

/* TRIGGERED2 @Bit 2 : Read pending status of interrupt for event TRIGGERED[2] */
  #define BELLBOARD_INTPEND1_TRIGGERED2_Pos (2UL)    /*!< Position of TRIGGERED2 field.                                        */
  #define BELLBOARD_INTPEND1_TRIGGERED2_Msk (0x1UL << BELLBOARD_INTPEND1_TRIGGERED2_Pos) /*!< Bit mask of TRIGGERED2 field.    */
  #define BELLBOARD_INTPEND1_TRIGGERED2_Min (0x0UL)  /*!< Min enumerator value of TRIGGERED2 field.                            */
  #define BELLBOARD_INTPEND1_TRIGGERED2_Max (0x1UL)  /*!< Max enumerator value of TRIGGERED2 field.                            */
  #define BELLBOARD_INTPEND1_TRIGGERED2_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define BELLBOARD_INTPEND1_TRIGGERED2_Pending (0x1UL) /*!< Read: Pending                                                     */

/* TRIGGERED3 @Bit 3 : Read pending status of interrupt for event TRIGGERED[3] */
  #define BELLBOARD_INTPEND1_TRIGGERED3_Pos (3UL)    /*!< Position of TRIGGERED3 field.                                        */
  #define BELLBOARD_INTPEND1_TRIGGERED3_Msk (0x1UL << BELLBOARD_INTPEND1_TRIGGERED3_Pos) /*!< Bit mask of TRIGGERED3 field.    */
  #define BELLBOARD_INTPEND1_TRIGGERED3_Min (0x0UL)  /*!< Min enumerator value of TRIGGERED3 field.                            */
  #define BELLBOARD_INTPEND1_TRIGGERED3_Max (0x1UL)  /*!< Max enumerator value of TRIGGERED3 field.                            */
  #define BELLBOARD_INTPEND1_TRIGGERED3_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define BELLBOARD_INTPEND1_TRIGGERED3_Pending (0x1UL) /*!< Read: Pending                                                     */


