NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* CLOCK_LFCLK_RUN: Indicates that LFCLKSTART task was triggered */
  #define CLOCK_LFCLK_RUN_ResetValue (0x00000000UL)  /*!< Reset value of RUN register.                                         */

/* STATUS @Bit 0 : LFCLKSTART task triggered or not */
  #define CLOCK_LFCLK_RUN_STATUS_Pos (0UL)           /*!< Position of STATUS field.                                            */
  #define CLOCK_LFCLK_RUN_STATUS_Msk (0x1UL << CLOCK_LFCLK_RUN_STATUS_Pos) /*!< Bit mask of STATUS field.                      */
  #define CLOCK_LFCLK_RUN_STATUS_Min (0x0UL)         /*!< Min enumerator value of STATUS field.                                */
  #define CLOCK_LFCLK_RUN_STATUS_Max (0x1UL)         /*!< Max enumerator value of STATUS field.                                */
  #define CLOCK_LFCLK_RUN_STATUS_NotTriggered (0x0UL) /*!< Task not triggered                                                  */
  #define CLOCK_LFCLK_RUN_STATUS_Triggered (0x1UL)   /*!< Task triggered                                                       */


/* CLOCK_LFCLK_STAT: Copy of LFCLK.SRCCOPY register, set when LFCLKSTARTED event is triggered. */
  #define CLOCK_LFCLK_STAT_ResetValue (0x00000000UL) /*!< Reset value of STAT register.                                        */

/* SRC @Bits 0..1 : Value of LFCLK.SRCCOPY register when LFCLKSTARTED event was triggered */
  #define CLOCK_LFCLK_STAT_SRC_Pos (0UL)             /*!< Position of SRC field.                                               */
  #define CLOCK_LFCLK_STAT_SRC_Msk (0x3UL << CLOCK_LFCLK_STAT_SRC_Pos) /*!< Bit mask of SRC field.                             */
  #define CLOCK_LFCLK_STAT_SRC_Min (0x0UL)           /*!< Min enumerator value of SRC field.                                   */
  #define CLOCK_LFCLK_STAT_SRC_Max (0x2UL)           /*!< Max enumerator value of SRC field.                                   */
  #define CLOCK_LFCLK_STAT_SRC_LFRC (0x0UL)          /*!< 32.768 kHz RC oscillator                                             */
  #define CLOCK_LFCLK_STAT_SRC_LFXO (0x1UL)          /*!< 32.768 kHz crystal oscillator                                        */
  #define CLOCK_LFCLK_STAT_SRC_LFSYNT (0x2UL)        /*!< 32.768 kHz synthesized from HFCLK                                    */

/* STATE @Bit 16 : LFCLK state (Running between START task and STOPPED event) */
  #define CLOCK_LFCLK_STAT_STATE_Pos (16UL)          /*!< Position of STATE field.                                             */
  #define CLOCK_LFCLK_STAT_STATE_Msk (0x1UL << CLOCK_LFCLK_STAT_STATE_Pos) /*!< Bit mask of STATE field.                       */
  #define CLOCK_LFCLK_STAT_STATE_Min (0x0UL)         /*!< Min enumerator value of STATE field.                                 */
  #define CLOCK_LFCLK_STAT_STATE_Max (0x1UL)         /*!< Max enumerator value of STATE field.                                 */
  #define CLOCK_LFCLK_STAT_STATE_NotRunning (0x0UL)  /*!< LFCLK not running                                                    */
  #define CLOCK_LFCLK_STAT_STATE_Running (0x1UL)     /*!< LFCLK running                                                        */


/* CLOCK_LFCLK_SRCCOPY: Copy of LFCLK.SRC register, set when LFCLKSTART task is triggered */
  #define CLOCK_LFCLK_SRCCOPY_ResetValue (0x00000000UL) /*!< Reset value of SRCCOPY register.                                  */

/* SRC @Bits 0..1 : Value of LFCLK.SRC register when LFCLKSTART task was triggered */
  #define CLOCK_LFCLK_SRCCOPY_SRC_Pos (0UL)          /*!< Position of SRC field.                                               */
  #define CLOCK_LFCLK_SRCCOPY_SRC_Msk (0x3UL << CLOCK_LFCLK_SRCCOPY_SRC_Pos) /*!< Bit mask of SRC field.                       */
  #define CLOCK_LFCLK_SRCCOPY_SRC_Min (0x0UL)        /*!< Min enumerator value of SRC field.                                   */
  #define CLOCK_LFCLK_SRCCOPY_SRC_Max (0x2UL)        /*!< Max enumerator value of SRC field.                                   */
  #define CLOCK_LFCLK_SRCCOPY_SRC_LFRC (0x0UL)       /*!< 32.768 kHz RC oscillator                                             */
  #define CLOCK_LFCLK_SRCCOPY_SRC_LFXO (0x1UL)       /*!< 32.768 kHz crystal oscillator                                        */
  #define CLOCK_LFCLK_SRCCOPY_SRC_LFSYNT (0x2UL)     /*!< 32.768 kHz synthesized from HFCLK                                    */



/* =================================================== Struct CLOCK_PLL24M =================================================== */
/**
  * @brief PLL24M [CLOCK_PLL24M] (unspecified)
  */
typedef struct {
  __IM  uint32_t  RESERVED[2];
  __IM  uint32_t  RUN;                               /*!< (@ 0x00000008) Indicates that XO24MSTART task was triggered          */
  __IM  uint32_t  STAT;                              /*!< (@ 0x0000000C) Which PLL settings were selected when triggering START
                                                                         task*/
} NRF_CLOCK_PLL24M_Type;                             /*!< Size = 16 (0x010)                                                    */

/* CLOCK_PLL24M_RUN: Indicates that XO24MSTART task was triggered */
  #define CLOCK_PLL24M_RUN_ResetValue (0x00000000UL) /*!< Reset value of RUN register.                                         */

/* STATUS @Bit 0 : XO24MSTART task triggered or not */
  #define CLOCK_PLL24M_RUN_STATUS_Pos (0UL)          /*!< Position of STATUS field.                                            */
  #define CLOCK_PLL24M_RUN_STATUS_Msk (0x1UL << CLOCK_PLL24M_RUN_STATUS_Pos) /*!< Bit mask of STATUS field.                    */
  #define CLOCK_PLL24M_RUN_STATUS_Min (0x0UL)        /*!< Min enumerator value of STATUS field.                                */
  #define CLOCK_PLL24M_RUN_STATUS_Max (0x1UL)        /*!< Max enumerator value of STATUS field.                                */
  #define CLOCK_PLL24M_RUN_STATUS_NotTriggered (0x0UL) /*!< Task not triggered                                                 */
  #define CLOCK_PLL24M_RUN_STATUS_Triggered (0x1UL)  /*!< Task triggered                                                       */


/* CLOCK_PLL24M_STAT: Which PLL settings were selected when triggering START task */
  #define CLOCK_PLL24M_STAT_ResetValue (0x00000000UL) /*!< Reset value of STAT register.                                       */

