NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* CLOCK_SUBSCRIBE_AUXPLLSTOP: Subscribe configuration for task AUXPLLSTOP */
  #define CLOCK_SUBSCRIBE_AUXPLLSTOP_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_AUXPLLSTOP register.              */

/* CHIDX @Bits 0..7 : DPPI channel that task AUXPLLSTOP will subscribe to */
  #define CLOCK_SUBSCRIBE_AUXPLLSTOP_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                             */
  #define CLOCK_SUBSCRIBE_AUXPLLSTOP_CHIDX_Msk (0xFFUL << CLOCK_SUBSCRIBE_AUXPLLSTOP_CHIDX_Pos) /*!< Bit mask of CHIDX field.  */
  #define CLOCK_SUBSCRIBE_AUXPLLSTOP_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                         */
  #define CLOCK_SUBSCRIBE_AUXPLLSTOP_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                          */

/* EN @Bit 31 : (unspecified) */
  #define CLOCK_SUBSCRIBE_AUXPLLSTOP_EN_Pos (31UL)   /*!< Position of EN field.                                                */
  #define CLOCK_SUBSCRIBE_AUXPLLSTOP_EN_Msk (0x1UL << CLOCK_SUBSCRIBE_AUXPLLSTOP_EN_Pos) /*!< Bit mask of EN field.            */
  #define CLOCK_SUBSCRIBE_AUXPLLSTOP_EN_Min (0x0UL)  /*!< Min enumerator value of EN field.                                    */
  #define CLOCK_SUBSCRIBE_AUXPLLSTOP_EN_Max (0x1UL)  /*!< Max enumerator value of EN field.                                    */
  #define CLOCK_SUBSCRIBE_AUXPLLSTOP_EN_Disabled (0x0UL) /*!< Disable subscription                                             */
  #define CLOCK_SUBSCRIBE_AUXPLLSTOP_EN_Enabled (0x1UL) /*!< Enable subscription                                               */


/* CLOCK_EVENTS_XOSTARTED: Crystal oscillator has started */
  #define CLOCK_EVENTS_XOSTARTED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_XOSTARTED register.                      */

/* EVENTS_XOSTARTED @Bit 0 : Crystal oscillator has started */
  #define CLOCK_EVENTS_XOSTARTED_EVENTS_XOSTARTED_Pos (0UL) /*!< Position of EVENTS_XOSTARTED field.                           */
  #define CLOCK_EVENTS_XOSTARTED_EVENTS_XOSTARTED_Msk (0x1UL << CLOCK_EVENTS_XOSTARTED_EVENTS_XOSTARTED_Pos) /*!< Bit mask of
                                                                            EVENTS_XOSTARTED field.*/
  #define CLOCK_EVENTS_XOSTARTED_EVENTS_XOSTARTED_Min (0x0UL) /*!< Min enumerator value of EVENTS_XOSTARTED field.             */
  #define CLOCK_EVENTS_XOSTARTED_EVENTS_XOSTARTED_Max (0x1UL) /*!< Max enumerator value of EVENTS_XOSTARTED field.             */
  #define CLOCK_EVENTS_XOSTARTED_EVENTS_XOSTARTED_NotGenerated (0x0UL) /*!< Event not generated                                */
  #define CLOCK_EVENTS_XOSTARTED_EVENTS_XOSTARTED_Generated (0x1UL) /*!< Event generated                                       */


/* CLOCK_EVENTS_PLLSTARTED: PLL started */
  #define CLOCK_EVENTS_PLLSTARTED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_PLLSTARTED register.                    */

/* EVENTS_PLLSTARTED @Bit 0 : PLL started */
  #define CLOCK_EVENTS_PLLSTARTED_EVENTS_PLLSTARTED_Pos (0UL) /*!< Position of EVENTS_PLLSTARTED field.                        */
  #define CLOCK_EVENTS_PLLSTARTED_EVENTS_PLLSTARTED_Msk (0x1UL << CLOCK_EVENTS_PLLSTARTED_EVENTS_PLLSTARTED_Pos) /*!< Bit mask
                                                                            of EVENTS_PLLSTARTED field.*/
  #define CLOCK_EVENTS_PLLSTARTED_EVENTS_PLLSTARTED_Min (0x0UL) /*!< Min enumerator value of EVENTS_PLLSTARTED field.          */
  #define CLOCK_EVENTS_PLLSTARTED_EVENTS_PLLSTARTED_Max (0x1UL) /*!< Max enumerator value of EVENTS_PLLSTARTED field.          */
  #define CLOCK_EVENTS_PLLSTARTED_EVENTS_PLLSTARTED_NotGenerated (0x0UL) /*!< Event not generated                              */
  #define CLOCK_EVENTS_PLLSTARTED_EVENTS_PLLSTARTED_Generated (0x1UL) /*!< Event generated                                     */


/* CLOCK_EVENTS_LFCLKSTARTED: LFCLK source started */
  #define CLOCK_EVENTS_LFCLKSTARTED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_LFCLKSTARTED register.                */

/* EVENTS_LFCLKSTARTED @Bit 0 : LFCLK source started */
  #define CLOCK_EVENTS_LFCLKSTARTED_EVENTS_LFCLKSTARTED_Pos (0UL) /*!< Position of EVENTS_LFCLKSTARTED field.                  */
  #define CLOCK_EVENTS_LFCLKSTARTED_EVENTS_LFCLKSTARTED_Msk (0x1UL << CLOCK_EVENTS_LFCLKSTARTED_EVENTS_LFCLKSTARTED_Pos) /*!<
                                                                            Bit mask of EVENTS_LFCLKSTARTED field.*/
  #define CLOCK_EVENTS_LFCLKSTARTED_EVENTS_LFCLKSTARTED_Min (0x0UL) /*!< Min enumerator value of EVENTS_LFCLKSTARTED field.    */
  #define CLOCK_EVENTS_LFCLKSTARTED_EVENTS_LFCLKSTARTED_Max (0x1UL) /*!< Max enumerator value of EVENTS_LFCLKSTARTED field.    */
  #define CLOCK_EVENTS_LFCLKSTARTED_EVENTS_LFCLKSTARTED_NotGenerated (0x0UL) /*!< Event not generated                          */
  #define CLOCK_EVENTS_LFCLKSTARTED_EVENTS_LFCLKSTARTED_Generated (0x1UL) /*!< Event generated                                 */


/* CLOCK_EVENTS_XO24MSTARTED: XO24M started */
  #define CLOCK_EVENTS_XO24MSTARTED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_XO24MSTARTED register.                */

/* EVENTS_XO24MSTARTED @Bit 0 : XO24M started */
  #define CLOCK_EVENTS_XO24MSTARTED_EVENTS_XO24MSTARTED_Pos (0UL) /*!< Position of EVENTS_XO24MSTARTED field.                  */
  #define CLOCK_EVENTS_XO24MSTARTED_EVENTS_XO24MSTARTED_Msk (0x1UL << CLOCK_EVENTS_XO24MSTARTED_EVENTS_XO24MSTARTED_Pos) /*!<
                                                                            Bit mask of EVENTS_XO24MSTARTED field.*/
  #define CLOCK_EVENTS_XO24MSTARTED_EVENTS_XO24MSTARTED_Min (0x0UL) /*!< Min enumerator value of EVENTS_XO24MSTARTED field.    */
  #define CLOCK_EVENTS_XO24MSTARTED_EVENTS_XO24MSTARTED_Max (0x1UL) /*!< Max enumerator value of EVENTS_XO24MSTARTED field.    */
  #define CLOCK_EVENTS_XO24MSTARTED_EVENTS_XO24MSTARTED_NotGenerated (0x0UL) /*!< Event not generated                          */
  #define CLOCK_EVENTS_XO24MSTARTED_EVENTS_XO24MSTARTED_Generated (0x1UL) /*!< Event generated                                 */


/* CLOCK_EVENTS_AUXPLLSTARTED: AUXPLL source started */
  #define CLOCK_EVENTS_AUXPLLSTARTED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_AUXPLLSTARTED register.              */

