NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* EVENTS_AUXPLLSTARTED @Bit 0 : AUXPLL source started */
  #define CLOCK_EVENTS_AUXPLLSTARTED_EVENTS_AUXPLLSTARTED_Pos (0UL) /*!< Position of EVENTS_AUXPLLSTARTED field.               */
  #define CLOCK_EVENTS_AUXPLLSTARTED_EVENTS_AUXPLLSTARTED_Msk (0x1UL << CLOCK_EVENTS_AUXPLLSTARTED_EVENTS_AUXPLLSTARTED_Pos)
                                                                            /*!< Bit mask of EVENTS_AUXPLLSTARTED field.*/
  #define CLOCK_EVENTS_AUXPLLSTARTED_EVENTS_AUXPLLSTARTED_Min (0x0UL) /*!< Min enumerator value of EVENTS_AUXPLLSTARTED field. */
  #define CLOCK_EVENTS_AUXPLLSTARTED_EVENTS_AUXPLLSTARTED_Max (0x1UL) /*!< Max enumerator value of EVENTS_AUXPLLSTARTED field. */
  #define CLOCK_EVENTS_AUXPLLSTARTED_EVENTS_AUXPLLSTARTED_NotGenerated (0x0UL) /*!< Event not generated                        */
  #define CLOCK_EVENTS_AUXPLLSTARTED_EVENTS_AUXPLLSTARTED_Generated (0x1UL) /*!< Event generated                               */


/* CLOCK_PUBLISH_XOSTARTED: Publish configuration for event XOSTARTED */
  #define CLOCK_PUBLISH_XOSTARTED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_XOSTARTED register.                    */

/* CHIDX @Bits 0..7 : DPPI channel that event XOSTARTED will publish to */
  #define CLOCK_PUBLISH_XOSTARTED_CHIDX_Pos (0UL)    /*!< Position of CHIDX field.                                             */
  #define CLOCK_PUBLISH_XOSTARTED_CHIDX_Msk (0xFFUL << CLOCK_PUBLISH_XOSTARTED_CHIDX_Pos) /*!< Bit mask of CHIDX field.        */
  #define CLOCK_PUBLISH_XOSTARTED_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                            */
  #define CLOCK_PUBLISH_XOSTARTED_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define CLOCK_PUBLISH_XOSTARTED_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define CLOCK_PUBLISH_XOSTARTED_EN_Msk (0x1UL << CLOCK_PUBLISH_XOSTARTED_EN_Pos) /*!< Bit mask of EN field.                  */
  #define CLOCK_PUBLISH_XOSTARTED_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define CLOCK_PUBLISH_XOSTARTED_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define CLOCK_PUBLISH_XOSTARTED_EN_Disabled (0x0UL) /*!< Disable publishing                                                  */
  #define CLOCK_PUBLISH_XOSTARTED_EN_Enabled (0x1UL) /*!< Enable publishing                                                    */


/* CLOCK_PUBLISH_PLLSTARTED: Publish configuration for event PLLSTARTED */
  #define CLOCK_PUBLISH_PLLSTARTED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_PLLSTARTED register.                  */

/* CHIDX @Bits 0..7 : DPPI channel that event PLLSTARTED will publish to */
  #define CLOCK_PUBLISH_PLLSTARTED_CHIDX_Pos (0UL)   /*!< Position of CHIDX field.                                             */
  #define CLOCK_PUBLISH_PLLSTARTED_CHIDX_Msk (0xFFUL << CLOCK_PUBLISH_PLLSTARTED_CHIDX_Pos) /*!< Bit mask of CHIDX field.      */
  #define CLOCK_PUBLISH_PLLSTARTED_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                           */
  #define CLOCK_PUBLISH_PLLSTARTED_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                            */

/* EN @Bit 31 : (unspecified) */
  #define CLOCK_PUBLISH_PLLSTARTED_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define CLOCK_PUBLISH_PLLSTARTED_EN_Msk (0x1UL << CLOCK_PUBLISH_PLLSTARTED_EN_Pos) /*!< Bit mask of EN field.                */
  #define CLOCK_PUBLISH_PLLSTARTED_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define CLOCK_PUBLISH_PLLSTARTED_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define CLOCK_PUBLISH_PLLSTARTED_EN_Disabled (0x0UL) /*!< Disable publishing                                                 */
  #define CLOCK_PUBLISH_PLLSTARTED_EN_Enabled (0x1UL) /*!< Enable publishing                                                   */


/* CLOCK_PUBLISH_LFCLKSTARTED: Publish configuration for event LFCLKSTARTED */
  #define CLOCK_PUBLISH_LFCLKSTARTED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_LFCLKSTARTED register.              */

/* CHIDX @Bits 0..7 : DPPI channel that event LFCLKSTARTED will publish to */
  #define CLOCK_PUBLISH_LFCLKSTARTED_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                             */
  #define CLOCK_PUBLISH_LFCLKSTARTED_CHIDX_Msk (0xFFUL << CLOCK_PUBLISH_LFCLKSTARTED_CHIDX_Pos) /*!< Bit mask of CHIDX field.  */
  #define CLOCK_PUBLISH_LFCLKSTARTED_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                         */
  #define CLOCK_PUBLISH_LFCLKSTARTED_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                          */

/* EN @Bit 31 : (unspecified) */
  #define CLOCK_PUBLISH_LFCLKSTARTED_EN_Pos (31UL)   /*!< Position of EN field.                                                */
  #define CLOCK_PUBLISH_LFCLKSTARTED_EN_Msk (0x1UL << CLOCK_PUBLISH_LFCLKSTARTED_EN_Pos) /*!< Bit mask of EN field.            */
  #define CLOCK_PUBLISH_LFCLKSTARTED_EN_Min (0x0UL)  /*!< Min enumerator value of EN field.                                    */
  #define CLOCK_PUBLISH_LFCLKSTARTED_EN_Max (0x1UL)  /*!< Max enumerator value of EN field.                                    */
  #define CLOCK_PUBLISH_LFCLKSTARTED_EN_Disabled (0x0UL) /*!< Disable publishing                                               */
  #define CLOCK_PUBLISH_LFCLKSTARTED_EN_Enabled (0x1UL) /*!< Enable publishing                                                 */


/* CLOCK_PUBLISH_XO24MSTARTED: Publish configuration for event XO24MSTARTED */
  #define CLOCK_PUBLISH_XO24MSTARTED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_XO24MSTARTED register.              */

/* CHIDX @Bits 0..7 : DPPI channel that event XO24MSTARTED will publish to */
  #define CLOCK_PUBLISH_XO24MSTARTED_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                             */
  #define CLOCK_PUBLISH_XO24MSTARTED_CHIDX_Msk (0xFFUL << CLOCK_PUBLISH_XO24MSTARTED_CHIDX_Pos) /*!< Bit mask of CHIDX field.  */
  #define CLOCK_PUBLISH_XO24MSTARTED_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                         */
  #define CLOCK_PUBLISH_XO24MSTARTED_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                          */

/* EN @Bit 31 : (unspecified) */
  #define CLOCK_PUBLISH_XO24MSTARTED_EN_Pos (31UL)   /*!< Position of EN field.                                                */
  #define CLOCK_PUBLISH_XO24MSTARTED_EN_Msk (0x1UL << CLOCK_PUBLISH_XO24MSTARTED_EN_Pos) /*!< Bit mask of EN field.            */
  #define CLOCK_PUBLISH_XO24MSTARTED_EN_Min (0x0UL)  /*!< Min enumerator value of EN field.                                    */
  #define CLOCK_PUBLISH_XO24MSTARTED_EN_Max (0x1UL)  /*!< Max enumerator value of EN field.                                    */
  #define CLOCK_PUBLISH_XO24MSTARTED_EN_Disabled (0x0UL) /*!< Disable publishing                                               */
  #define CLOCK_PUBLISH_XO24MSTARTED_EN_Enabled (0x1UL) /*!< Enable publishing                                                 */


/* CLOCK_PUBLISH_AUXPLLSTARTED: Publish configuration for event AUXPLLSTARTED */
  #define CLOCK_PUBLISH_AUXPLLSTARTED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_AUXPLLSTARTED register.            */

/* CHIDX @Bits 0..7 : DPPI channel that event AUXPLLSTARTED will publish to */
  #define CLOCK_PUBLISH_AUXPLLSTARTED_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                            */
  #define CLOCK_PUBLISH_AUXPLLSTARTED_CHIDX_Msk (0xFFUL << CLOCK_PUBLISH_AUXPLLSTARTED_CHIDX_Pos) /*!< Bit mask of CHIDX field.*/
  #define CLOCK_PUBLISH_AUXPLLSTARTED_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                        */
  #define CLOCK_PUBLISH_AUXPLLSTARTED_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                         */

/* EN @Bit 31 : (unspecified) */
  #define CLOCK_PUBLISH_AUXPLLSTARTED_EN_Pos (31UL)  /*!< Position of EN field.                                                */
  #define CLOCK_PUBLISH_AUXPLLSTARTED_EN_Msk (0x1UL << CLOCK_PUBLISH_AUXPLLSTARTED_EN_Pos) /*!< Bit mask of EN field.          */
  #define CLOCK_PUBLISH_AUXPLLSTARTED_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                    */
  #define CLOCK_PUBLISH_AUXPLLSTARTED_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                    */
  #define CLOCK_PUBLISH_AUXPLLSTARTED_EN_Disabled (0x0UL) /*!< Disable publishing                                              */
  #define CLOCK_PUBLISH_AUXPLLSTARTED_EN_Enabled (0x1UL) /*!< Enable publishing                                                */


/* CLOCK_INTEN: Enable or disable interrupt */
  #define CLOCK_INTEN_ResetValue (0x00000000UL)      /*!< Reset value of INTEN register.                                       */

