NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* CLOCK_INTPEND: Pending interrupts */
  #define CLOCK_INTPEND_ResetValue (0x00000000UL)    /*!< Reset value of INTPEND register.                                     */

/* XOSTARTED @Bit 0 : Read pending status of interrupt for event XOSTARTED */
  #define CLOCK_INTPEND_XOSTARTED_Pos (0UL)          /*!< Position of XOSTARTED field.                                         */
  #define CLOCK_INTPEND_XOSTARTED_Msk (0x1UL << CLOCK_INTPEND_XOSTARTED_Pos) /*!< Bit mask of XOSTARTED field.                 */
  #define CLOCK_INTPEND_XOSTARTED_Min (0x0UL)        /*!< Min enumerator value of XOSTARTED field.                             */
  #define CLOCK_INTPEND_XOSTARTED_Max (0x1UL)        /*!< Max enumerator value of XOSTARTED field.                             */
  #define CLOCK_INTPEND_XOSTARTED_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define CLOCK_INTPEND_XOSTARTED_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* PLLSTARTED @Bit 1 : Read pending status of interrupt for event PLLSTARTED */
  #define CLOCK_INTPEND_PLLSTARTED_Pos (1UL)         /*!< Position of PLLSTARTED field.                                        */
  #define CLOCK_INTPEND_PLLSTARTED_Msk (0x1UL << CLOCK_INTPEND_PLLSTARTED_Pos) /*!< Bit mask of PLLSTARTED field.              */
  #define CLOCK_INTPEND_PLLSTARTED_Min (0x0UL)       /*!< Min enumerator value of PLLSTARTED field.                            */
  #define CLOCK_INTPEND_PLLSTARTED_Max (0x1UL)       /*!< Max enumerator value of PLLSTARTED field.                            */
  #define CLOCK_INTPEND_PLLSTARTED_NotPending (0x0UL) /*!< Read: Not pending                                                   */
  #define CLOCK_INTPEND_PLLSTARTED_Pending (0x1UL)   /*!< Read: Pending                                                        */

/* LFCLKSTARTED @Bit 2 : Read pending status of interrupt for event LFCLKSTARTED */
  #define CLOCK_INTPEND_LFCLKSTARTED_Pos (2UL)       /*!< Position of LFCLKSTARTED field.                                      */
  #define CLOCK_INTPEND_LFCLKSTARTED_Msk (0x1UL << CLOCK_INTPEND_LFCLKSTARTED_Pos) /*!< Bit mask of LFCLKSTARTED field.        */
  #define CLOCK_INTPEND_LFCLKSTARTED_Min (0x0UL)     /*!< Min enumerator value of LFCLKSTARTED field.                          */
  #define CLOCK_INTPEND_LFCLKSTARTED_Max (0x1UL)     /*!< Max enumerator value of LFCLKSTARTED field.                          */
  #define CLOCK_INTPEND_LFCLKSTARTED_NotPending (0x0UL) /*!< Read: Not pending                                                 */
  #define CLOCK_INTPEND_LFCLKSTARTED_Pending (0x1UL) /*!< Read: Pending                                                        */

/* XO24MSTARTED @Bit 7 : Read pending status of interrupt for event XO24MSTARTED */
  #define CLOCK_INTPEND_XO24MSTARTED_Pos (7UL)       /*!< Position of XO24MSTARTED field.                                      */
  #define CLOCK_INTPEND_XO24MSTARTED_Msk (0x1UL << CLOCK_INTPEND_XO24MSTARTED_Pos) /*!< Bit mask of XO24MSTARTED field.        */
  #define CLOCK_INTPEND_XO24MSTARTED_Min (0x0UL)     /*!< Min enumerator value of XO24MSTARTED field.                          */
  #define CLOCK_INTPEND_XO24MSTARTED_Max (0x1UL)     /*!< Max enumerator value of XO24MSTARTED field.                          */
  #define CLOCK_INTPEND_XO24MSTARTED_NotPending (0x0UL) /*!< Read: Not pending                                                 */
  #define CLOCK_INTPEND_XO24MSTARTED_Pending (0x1UL) /*!< Read: Pending                                                        */

/* AUXPLLSTARTED @Bit 8 : Read pending status of interrupt for event AUXPLLSTARTED */
  #define CLOCK_INTPEND_AUXPLLSTARTED_Pos (8UL)      /*!< Position of AUXPLLSTARTED field.                                     */
  #define CLOCK_INTPEND_AUXPLLSTARTED_Msk (0x1UL << CLOCK_INTPEND_AUXPLLSTARTED_Pos) /*!< Bit mask of AUXPLLSTARTED field.     */
  #define CLOCK_INTPEND_AUXPLLSTARTED_Min (0x0UL)    /*!< Min enumerator value of AUXPLLSTARTED field.                         */
  #define CLOCK_INTPEND_AUXPLLSTARTED_Max (0x1UL)    /*!< Max enumerator value of AUXPLLSTARTED field.                         */
  #define CLOCK_INTPEND_AUXPLLSTARTED_NotPending (0x0UL) /*!< Read: Not pending                                                */
  #define CLOCK_INTPEND_AUXPLLSTARTED_Pending (0x1UL) /*!< Read: Pending                                                       */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           COEXC                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================== Struct COEXC_CCMALLOW ================================================== */
/**
  * @brief CCMALLOW [COEXC_CCMALLOW] (unspecified)
  */
typedef struct {
  __IOM uint32_t  MODE[8];                           /*!< (@ 0x00000000) Coexistence client mode allow configuration for mode
                                                                         [o] in client [n]*/
} NRF_COEXC_CCMALLOW_Type;                           /*!< Size = 32 (0x020)                                                    */
  #define COEXC_CCMALLOW_MaxCount (8UL)              /*!< Size of CCMALLOW[8] array.                                           */
  #define COEXC_CCMALLOW_MaxIndex (7UL)              /*!< Max index of CCMALLOW[8] array.                                      */
  #define COEXC_CCMALLOW_MinIndex (0UL)              /*!< Min index of CCMALLOW[8] array.                                      */

/* COEXC_CCMALLOW_MODE: Coexistence client mode allow configuration for mode [o] in client [n] */
  #define COEXC_CCMALLOW_MODE_MaxCount (8UL)         /*!< Max size of MODE[8] array.                                           */
  #define COEXC_CCMALLOW_MODE_MaxIndex (7UL)         /*!< Max index of MODE[8] array.                                          */
  #define COEXC_CCMALLOW_MODE_MinIndex (0UL)         /*!< Min index of MODE[8] array.                                          */
  #define COEXC_CCMALLOW_MODE_ResetValue (0x00000000UL) /*!< Reset value of MODE[8] register.                                  */

/* Field group CLIENT0 : (unspecified) */
/* MODE0 @Bit 0 : Coexistence allowed configuration for mode [0] in client [0] */
    #define COEXC_CCMALLOW_MODE_CLIENT0_MODE0_Pos (0UL) /*!< Position of MODE0 field.                                          */
    #define COEXC_CCMALLOW_MODE_CLIENT0_MODE0_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT0_MODE0_Pos) /*!< Bit mask of MODE0
                                                                            field.*/
    #define COEXC_CCMALLOW_MODE_CLIENT0_MODE0_Min (0x0UL) /*!< Min enumerator value of MODE0 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT0_MODE0_Max (0x1UL) /*!< Max enumerator value of MODE0 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT0_MODE0_NotAllowed (0x0UL) /*!< Coexistence not allowed                                  */
    #define COEXC_CCMALLOW_MODE_CLIENT0_MODE0_Allow (0x1UL) /*!< Coexistence allowed                                           */

/* MODE1 @Bit 1 : Coexistence allowed configuration for mode [1] in client [0] */
    #define COEXC_CCMALLOW_MODE_CLIENT0_MODE1_Pos (1UL) /*!< Position of MODE1 field.                                          */
    #define COEXC_CCMALLOW_MODE_CLIENT0_MODE1_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT0_MODE1_Pos) /*!< Bit mask of MODE1
                                                                            field.*/
    #define COEXC_CCMALLOW_MODE_CLIENT0_MODE1_Min (0x0UL) /*!< Min enumerator value of MODE1 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT0_MODE1_Max (0x1UL) /*!< Max enumerator value of MODE1 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT0_MODE1_NotAllowed (0x0UL) /*!< Coexistence not allowed                                  */
    #define COEXC_CCMALLOW_MODE_CLIENT0_MODE1_Allow (0x1UL) /*!< Coexistence allowed                                           */

/* MODE2 @Bit 2 : Coexistence allowed configuration for mode [2] in client [0] */
    #define COEXC_CCMALLOW_MODE_CLIENT0_MODE2_Pos (2UL) /*!< Position of MODE2 field.                                          */
    #define COEXC_CCMALLOW_MODE_CLIENT0_MODE2_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT0_MODE2_Pos) /*!< Bit mask of MODE2
                                                                            field.*/
    #define COEXC_CCMALLOW_MODE_CLIENT0_MODE2_Min (0x0UL) /*!< Min enumerator value of MODE2 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT0_MODE2_Max (0x1UL) /*!< Max enumerator value of MODE2 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT0_MODE2_NotAllowed (0x0UL) /*!< Coexistence not allowed                                  */
    #define COEXC_CCMALLOW_MODE_CLIENT0_MODE2_Allow (0x1UL) /*!< Coexistence allowed                                           */

