NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* CLIENT6 @Bit 6 : Granted status of coexistence clients */
  #define COEXC_GRANTED_CLIENT6_Pos (6UL)            /*!< Position of CLIENT6 field.                                           */
  #define COEXC_GRANTED_CLIENT6_Msk (0x1UL << COEXC_GRANTED_CLIENT6_Pos) /*!< Bit mask of CLIENT6 field.                       */
  #define COEXC_GRANTED_CLIENT6_Min (0x0UL)          /*!< Min enumerator value of CLIENT6 field.                               */
  #define COEXC_GRANTED_CLIENT6_Max (0x1UL)          /*!< Max enumerator value of CLIENT6 field.                               */
  #define COEXC_GRANTED_CLIENT6_NotGranted (0x0UL)   /*!< Shared resource is not granted for coexistence client [6]            */
  #define COEXC_GRANTED_CLIENT6_Granted (0x1UL)      /*!< Shared resource is granted for coexistence client [6]                */

/* CLIENT7 @Bit 7 : Granted status of coexistence clients */
  #define COEXC_GRANTED_CLIENT7_Pos (7UL)            /*!< Position of CLIENT7 field.                                           */
  #define COEXC_GRANTED_CLIENT7_Msk (0x1UL << COEXC_GRANTED_CLIENT7_Pos) /*!< Bit mask of CLIENT7 field.                       */
  #define COEXC_GRANTED_CLIENT7_Min (0x0UL)          /*!< Min enumerator value of CLIENT7 field.                               */
  #define COEXC_GRANTED_CLIENT7_Max (0x1UL)          /*!< Max enumerator value of CLIENT7 field.                               */
  #define COEXC_GRANTED_CLIENT7_NotGranted (0x0UL)   /*!< Shared resource is not granted for coexistence client [7]            */
  #define COEXC_GRANTED_CLIENT7_Granted (0x1UL)      /*!< Shared resource is granted for coexistence client [7]                */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           COMP                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct COMP ======================================================= */
/**
  * @brief Comparator
  */
  typedef struct {                                   /*!< COMP Structure                                                       */
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000000) Start comparator                                      */
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x00000004) Stop comparator                                       */
    __OM uint32_t TASKS_SAMPLE;                      /*!< (@ 0x00000008) Sample comparator value. This task requires that COMP
                                                                         has been started by the START Task.*/
    __IM uint32_t RESERVED[29];
    __IOM uint32_t SUBSCRIBE_START;                  /*!< (@ 0x00000080) Subscribe configuration for task START                */
    __IOM uint32_t SUBSCRIBE_STOP;                   /*!< (@ 0x00000084) Subscribe configuration for task STOP                 */
    __IOM uint32_t SUBSCRIBE_SAMPLE;                 /*!< (@ 0x00000088) Subscribe configuration for task SAMPLE               */
    __IM uint32_t RESERVED1[29];
    __IOM uint32_t EVENTS_READY;                     /*!< (@ 0x00000100) COMP is ready and output is valid                     */
    __IOM uint32_t EVENTS_DOWN;                      /*!< (@ 0x00000104) Downward crossing                                     */
    __IOM uint32_t EVENTS_UP;                        /*!< (@ 0x00000108) Upward crossing                                       */
    __IOM uint32_t EVENTS_CROSS;                     /*!< (@ 0x0000010C) Downward or upward crossing                           */
    __IM uint32_t RESERVED2[28];
    __IOM uint32_t PUBLISH_READY;                    /*!< (@ 0x00000180) Publish configuration for event READY                 */
    __IOM uint32_t PUBLISH_DOWN;                     /*!< (@ 0x00000184) Publish configuration for event DOWN                  */
    __IOM uint32_t PUBLISH_UP;                       /*!< (@ 0x00000188) Publish configuration for event UP                    */
    __IOM uint32_t PUBLISH_CROSS;                    /*!< (@ 0x0000018C) Publish configuration for event CROSS                 */
    __IM uint32_t RESERVED3[28];
    __IOM uint32_t SHORTS;                           /*!< (@ 0x00000200) Shortcuts between local events and tasks              */
    __IM uint32_t RESERVED4[63];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED5[60];
    __IM uint32_t RESULT;                            /*!< (@ 0x00000400) Compare result                                        */
    __IM uint32_t RESERVED6[63];
    __IOM uint32_t ENABLE;                           /*!< (@ 0x00000500) COMP enable                                           */
    __IOM uint32_t PSEL;                             /*!< (@ 0x00000504) Pin select                                            */
    __IOM uint32_t REFSEL;                           /*!< (@ 0x00000508) Reference source select for single-ended mode         */
    __IOM uint32_t EXTREFSEL;                        /*!< (@ 0x0000050C) External reference select                             */
    __IM uint32_t RESERVED7[8];
    __IOM uint32_t TH;                               /*!< (@ 0x00000530) Threshold configuration for hysteresis unit           */
    __IOM uint32_t MODE;                             /*!< (@ 0x00000534) Mode configuration                                    */
    __IOM uint32_t HYST;                             /*!< (@ 0x00000538) Comparator hysteresis enable                          */
    __IOM uint32_t ISOURCE;                          /*!< (@ 0x0000053C) Current source select on analog input                 */
  } NRF_COMP_Type;                                   /*!< Size = 1344 (0x540)                                                  */

/* COMP_TASKS_START: Start comparator */
  #define COMP_TASKS_START_ResetValue (0x00000000UL) /*!< Reset value of TASKS_START register.                                 */

