NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* EVENTS_PKEIKG @Bit 0 : Event indicating that interrupt triggered at PKE or IKG */
  #define CRACEN_EVENTS_PKEIKG_EVENTS_PKEIKG_Pos (0UL) /*!< Position of EVENTS_PKEIKG field.                                   */
  #define CRACEN_EVENTS_PKEIKG_EVENTS_PKEIKG_Msk (0x1UL << CRACEN_EVENTS_PKEIKG_EVENTS_PKEIKG_Pos) /*!< Bit mask of
                                                                            EVENTS_PKEIKG field.*/
  #define CRACEN_EVENTS_PKEIKG_EVENTS_PKEIKG_Min (0x0UL) /*!< Min enumerator value of EVENTS_PKEIKG field.                     */
  #define CRACEN_EVENTS_PKEIKG_EVENTS_PKEIKG_Max (0x1UL) /*!< Max enumerator value of EVENTS_PKEIKG field.                     */
  #define CRACEN_EVENTS_PKEIKG_EVENTS_PKEIKG_NotGenerated (0x0UL) /*!< Event not generated                                     */
  #define CRACEN_EVENTS_PKEIKG_EVENTS_PKEIKG_Generated (0x1UL) /*!< Event generated                                            */


/* CRACEN_INTEN: Enable or disable interrupt */
  #define CRACEN_INTEN_ResetValue (0x00000000UL)     /*!< Reset value of INTEN register.                                       */

/* CRYPTOMASTER @Bit 0 : Enable or disable interrupt for event CRYPTOMASTER */
  #define CRACEN_INTEN_CRYPTOMASTER_Pos (0UL)        /*!< Position of CRYPTOMASTER field.                                      */
  #define CRACEN_INTEN_CRYPTOMASTER_Msk (0x1UL << CRACEN_INTEN_CRYPTOMASTER_Pos) /*!< Bit mask of CRYPTOMASTER field.          */
  #define CRACEN_INTEN_CRYPTOMASTER_Min (0x0UL)      /*!< Min enumerator value of CRYPTOMASTER field.                          */
  #define CRACEN_INTEN_CRYPTOMASTER_Max (0x1UL)      /*!< Max enumerator value of CRYPTOMASTER field.                          */
  #define CRACEN_INTEN_CRYPTOMASTER_Disabled (0x0UL) /*!< Disable                                                              */
  #define CRACEN_INTEN_CRYPTOMASTER_Enabled (0x1UL)  /*!< Enable                                                               */

/* RNG @Bit 1 : Enable or disable interrupt for event RNG */
  #define CRACEN_INTEN_RNG_Pos (1UL)                 /*!< Position of RNG field.                                               */
  #define CRACEN_INTEN_RNG_Msk (0x1UL << CRACEN_INTEN_RNG_Pos) /*!< Bit mask of RNG field.                                     */
  #define CRACEN_INTEN_RNG_Min (0x0UL)               /*!< Min enumerator value of RNG field.                                   */
  #define CRACEN_INTEN_RNG_Max (0x1UL)               /*!< Max enumerator value of RNG field.                                   */
  #define CRACEN_INTEN_RNG_Disabled (0x0UL)          /*!< Disable                                                              */
  #define CRACEN_INTEN_RNG_Enabled (0x1UL)           /*!< Enable                                                               */

/* PKEIKG @Bit 2 : Enable or disable interrupt for event PKEIKG */
  #define CRACEN_INTEN_PKEIKG_Pos (2UL)              /*!< Position of PKEIKG field.                                            */
  #define CRACEN_INTEN_PKEIKG_Msk (0x1UL << CRACEN_INTEN_PKEIKG_Pos) /*!< Bit mask of PKEIKG field.                            */
  #define CRACEN_INTEN_PKEIKG_Min (0x0UL)            /*!< Min enumerator value of PKEIKG field.                                */
  #define CRACEN_INTEN_PKEIKG_Max (0x1UL)            /*!< Max enumerator value of PKEIKG field.                                */
  #define CRACEN_INTEN_PKEIKG_Disabled (0x0UL)       /*!< Disable                                                              */
  #define CRACEN_INTEN_PKEIKG_Enabled (0x1UL)        /*!< Enable                                                               */


/* CRACEN_INTENSET: Enable interrupt */
  #define CRACEN_INTENSET_ResetValue (0x00000000UL)  /*!< Reset value of INTENSET register.                                    */

/* CRYPTOMASTER @Bit 0 : Write '1' to enable interrupt for event CRYPTOMASTER */
  #define CRACEN_INTENSET_CRYPTOMASTER_Pos (0UL)     /*!< Position of CRYPTOMASTER field.                                      */
  #define CRACEN_INTENSET_CRYPTOMASTER_Msk (0x1UL << CRACEN_INTENSET_CRYPTOMASTER_Pos) /*!< Bit mask of CRYPTOMASTER field.    */
  #define CRACEN_INTENSET_CRYPTOMASTER_Min (0x0UL)   /*!< Min enumerator value of CRYPTOMASTER field.                          */
  #define CRACEN_INTENSET_CRYPTOMASTER_Max (0x1UL)   /*!< Max enumerator value of CRYPTOMASTER field.                          */
  #define CRACEN_INTENSET_CRYPTOMASTER_Set (0x1UL)   /*!< Enable                                                               */
  #define CRACEN_INTENSET_CRYPTOMASTER_Disabled (0x0UL) /*!< Read: Disabled                                                    */
  #define CRACEN_INTENSET_CRYPTOMASTER_Enabled (0x1UL) /*!< Read: Enabled                                                      */

/* RNG @Bit 1 : Write '1' to enable interrupt for event RNG */
  #define CRACEN_INTENSET_RNG_Pos (1UL)              /*!< Position of RNG field.                                               */
  #define CRACEN_INTENSET_RNG_Msk (0x1UL << CRACEN_INTENSET_RNG_Pos) /*!< Bit mask of RNG field.                               */
  #define CRACEN_INTENSET_RNG_Min (0x0UL)            /*!< Min enumerator value of RNG field.                                   */
  #define CRACEN_INTENSET_RNG_Max (0x1UL)            /*!< Max enumerator value of RNG field.                                   */
  #define CRACEN_INTENSET_RNG_Set (0x1UL)            /*!< Enable                                                               */
  #define CRACEN_INTENSET_RNG_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define CRACEN_INTENSET_RNG_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* PKEIKG @Bit 2 : Write '1' to enable interrupt for event PKEIKG */
  #define CRACEN_INTENSET_PKEIKG_Pos (2UL)           /*!< Position of PKEIKG field.                                            */
  #define CRACEN_INTENSET_PKEIKG_Msk (0x1UL << CRACEN_INTENSET_PKEIKG_Pos) /*!< Bit mask of PKEIKG field.                      */
  #define CRACEN_INTENSET_PKEIKG_Min (0x0UL)         /*!< Min enumerator value of PKEIKG field.                                */
  #define CRACEN_INTENSET_PKEIKG_Max (0x1UL)         /*!< Max enumerator value of PKEIKG field.                                */
  #define CRACEN_INTENSET_PKEIKG_Set (0x1UL)         /*!< Enable                                                               */
  #define CRACEN_INTENSET_PKEIKG_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define CRACEN_INTENSET_PKEIKG_Enabled (0x1UL)     /*!< Read: Enabled                                                        */


/* CRACEN_INTENCLR: Disable interrupt */
  #define CRACEN_INTENCLR_ResetValue (0x00000000UL)  /*!< Reset value of INTENCLR register.                                    */

