NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* CH20 @Bit 20 : Channel 20 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH20_Pos (20UL)              /*!< Position of CH20 field.                                              */
  #define DPPIC_CHENSET_CH20_Msk (0x1UL << DPPIC_CHENSET_CH20_Pos) /*!< Bit mask of CH20 field.                                */
  #define DPPIC_CHENSET_CH20_Min (0x0UL)             /*!< Min enumerator value of CH20 field.                                  */
  #define DPPIC_CHENSET_CH20_Max (0x1UL)             /*!< Max enumerator value of CH20 field.                                  */
  #define DPPIC_CHENSET_CH20_Disabled (0x0UL)        /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENSET_CH20_Enabled (0x1UL)         /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENSET_CH20_Set (0x1UL)             /*!< Write: Enable channel                                                */

/* CH21 @Bit 21 : Channel 21 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH21_Pos (21UL)              /*!< Position of CH21 field.                                              */
  #define DPPIC_CHENSET_CH21_Msk (0x1UL << DPPIC_CHENSET_CH21_Pos) /*!< Bit mask of CH21 field.                                */
  #define DPPIC_CHENSET_CH21_Min (0x0UL)             /*!< Min enumerator value of CH21 field.                                  */
  #define DPPIC_CHENSET_CH21_Max (0x1UL)             /*!< Max enumerator value of CH21 field.                                  */
  #define DPPIC_CHENSET_CH21_Disabled (0x0UL)        /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENSET_CH21_Enabled (0x1UL)         /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENSET_CH21_Set (0x1UL)             /*!< Write: Enable channel                                                */

/* CH22 @Bit 22 : Channel 22 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH22_Pos (22UL)              /*!< Position of CH22 field.                                              */
  #define DPPIC_CHENSET_CH22_Msk (0x1UL << DPPIC_CHENSET_CH22_Pos) /*!< Bit mask of CH22 field.                                */
  #define DPPIC_CHENSET_CH22_Min (0x0UL)             /*!< Min enumerator value of CH22 field.                                  */
  #define DPPIC_CHENSET_CH22_Max (0x1UL)             /*!< Max enumerator value of CH22 field.                                  */
  #define DPPIC_CHENSET_CH22_Disabled (0x0UL)        /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENSET_CH22_Enabled (0x1UL)         /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENSET_CH22_Set (0x1UL)             /*!< Write: Enable channel                                                */

/* CH23 @Bit 23 : Channel 23 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH23_Pos (23UL)              /*!< Position of CH23 field.                                              */
  #define DPPIC_CHENSET_CH23_Msk (0x1UL << DPPIC_CHENSET_CH23_Pos) /*!< Bit mask of CH23 field.                                */
  #define DPPIC_CHENSET_CH23_Min (0x0UL)             /*!< Min enumerator value of CH23 field.                                  */
  #define DPPIC_CHENSET_CH23_Max (0x1UL)             /*!< Max enumerator value of CH23 field.                                  */
  #define DPPIC_CHENSET_CH23_Disabled (0x0UL)        /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENSET_CH23_Enabled (0x1UL)         /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENSET_CH23_Set (0x1UL)             /*!< Write: Enable channel                                                */


/* DPPIC_CHENCLR: Channel enable clear register */
  #define DPPIC_CHENCLR_ResetValue (0x00000000UL)    /*!< Reset value of CHENCLR register.                                     */

/* CH0 @Bit 0 : Channel 0 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH0_Pos (0UL)                /*!< Position of CH0 field.                                               */
  #define DPPIC_CHENCLR_CH0_Msk (0x1UL << DPPIC_CHENCLR_CH0_Pos) /*!< Bit mask of CH0 field.                                   */
  #define DPPIC_CHENCLR_CH0_Min (0x0UL)              /*!< Min enumerator value of CH0 field.                                   */
  #define DPPIC_CHENCLR_CH0_Max (0x1UL)              /*!< Max enumerator value of CH0 field.                                   */
  #define DPPIC_CHENCLR_CH0_Disabled (0x0UL)         /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENCLR_CH0_Enabled (0x1UL)          /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENCLR_CH0_Clear (0x1UL)            /*!< Write: Disable channel                                               */

/* CH1 @Bit 1 : Channel 1 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH1_Pos (1UL)                /*!< Position of CH1 field.                                               */
  #define DPPIC_CHENCLR_CH1_Msk (0x1UL << DPPIC_CHENCLR_CH1_Pos) /*!< Bit mask of CH1 field.                                   */
  #define DPPIC_CHENCLR_CH1_Min (0x0UL)              /*!< Min enumerator value of CH1 field.                                   */
  #define DPPIC_CHENCLR_CH1_Max (0x1UL)              /*!< Max enumerator value of CH1 field.                                   */
  #define DPPIC_CHENCLR_CH1_Disabled (0x0UL)         /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENCLR_CH1_Enabled (0x1UL)          /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENCLR_CH1_Clear (0x1UL)            /*!< Write: Disable channel                                               */

/* CH2 @Bit 2 : Channel 2 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH2_Pos (2UL)                /*!< Position of CH2 field.                                               */
  #define DPPIC_CHENCLR_CH2_Msk (0x1UL << DPPIC_CHENCLR_CH2_Pos) /*!< Bit mask of CH2 field.                                   */
  #define DPPIC_CHENCLR_CH2_Min (0x0UL)              /*!< Min enumerator value of CH2 field.                                   */
  #define DPPIC_CHENCLR_CH2_Max (0x1UL)              /*!< Max enumerator value of CH2 field.                                   */
  #define DPPIC_CHENCLR_CH2_Disabled (0x0UL)         /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENCLR_CH2_Enabled (0x1UL)          /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENCLR_CH2_Clear (0x1UL)            /*!< Write: Disable channel                                               */

/* CH3 @Bit 3 : Channel 3 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH3_Pos (3UL)                /*!< Position of CH3 field.                                               */
  #define DPPIC_CHENCLR_CH3_Msk (0x1UL << DPPIC_CHENCLR_CH3_Pos) /*!< Bit mask of CH3 field.                                   */
  #define DPPIC_CHENCLR_CH3_Min (0x0UL)              /*!< Min enumerator value of CH3 field.                                   */
  #define DPPIC_CHENCLR_CH3_Max (0x1UL)              /*!< Max enumerator value of CH3 field.                                   */
  #define DPPIC_CHENCLR_CH3_Disabled (0x0UL)         /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENCLR_CH3_Enabled (0x1UL)          /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENCLR_CH3_Clear (0x1UL)            /*!< Write: Disable channel                                               */

/* CH4 @Bit 4 : Channel 4 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH4_Pos (4UL)                /*!< Position of CH4 field.                                               */
  #define DPPIC_CHENCLR_CH4_Msk (0x1UL << DPPIC_CHENCLR_CH4_Pos) /*!< Bit mask of CH4 field.                                   */
  #define DPPIC_CHENCLR_CH4_Min (0x0UL)              /*!< Min enumerator value of CH4 field.                                   */
  #define DPPIC_CHENCLR_CH4_Max (0x1UL)              /*!< Max enumerator value of CH4 field.                                   */
  #define DPPIC_CHENCLR_CH4_Disabled (0x0UL)         /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENCLR_CH4_Enabled (0x1UL)          /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENCLR_CH4_Clear (0x1UL)            /*!< Write: Disable channel                                               */

/* CH5 @Bit 5 : Channel 5 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH5_Pos (5UL)                /*!< Position of CH5 field.                                               */
  #define DPPIC_CHENCLR_CH5_Msk (0x1UL << DPPIC_CHENCLR_CH5_Pos) /*!< Bit mask of CH5 field.                                   */
  #define DPPIC_CHENCLR_CH5_Min (0x0UL)              /*!< Min enumerator value of CH5 field.                                   */
  #define DPPIC_CHENCLR_CH5_Max (0x1UL)              /*!< Max enumerator value of CH5 field.                                   */
  #define DPPIC_CHENCLR_CH5_Disabled (0x0UL)         /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENCLR_CH5_Enabled (0x1UL)          /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENCLR_CH5_Clear (0x1UL)            /*!< Write: Disable channel                                               */

/* CH6 @Bit 6 : Channel 6 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH6_Pos (6UL)                /*!< Position of CH6 field.                                               */
  #define DPPIC_CHENCLR_CH6_Msk (0x1UL << DPPIC_CHENCLR_CH6_Pos) /*!< Bit mask of CH6 field.                                   */
  #define DPPIC_CHENCLR_CH6_Min (0x0UL)              /*!< Min enumerator value of CH6 field.                                   */
  #define DPPIC_CHENCLR_CH6_Max (0x1UL)              /*!< Max enumerator value of CH6 field.                                   */
  #define DPPIC_CHENCLR_CH6_Disabled (0x0UL)         /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENCLR_CH6_Enabled (0x1UL)          /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENCLR_CH6_Clear (0x1UL)            /*!< Write: Disable channel                                               */

/* CH7 @Bit 7 : Channel 7 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH7_Pos (7UL)                /*!< Position of CH7 field.                                               */
  #define DPPIC_CHENCLR_CH7_Msk (0x1UL << DPPIC_CHENCLR_CH7_Pos) /*!< Bit mask of CH7 field.                                   */
  #define DPPIC_CHENCLR_CH7_Min (0x0UL)              /*!< Min enumerator value of CH7 field.                                   */
  #define DPPIC_CHENCLR_CH7_Max (0x1UL)              /*!< Max enumerator value of CH7 field.                                   */
  #define DPPIC_CHENCLR_CH7_Disabled (0x0UL)         /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENCLR_CH7_Enabled (0x1UL)          /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENCLR_CH7_Clear (0x1UL)            /*!< Write: Disable channel                                               */

/* CH8 @Bit 8 : Channel 8 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH8_Pos (8UL)                /*!< Position of CH8 field.                                               */
  #define DPPIC_CHENCLR_CH8_Msk (0x1UL << DPPIC_CHENCLR_CH8_Pos) /*!< Bit mask of CH8 field.                                   */
  #define DPPIC_CHENCLR_CH8_Min (0x0UL)              /*!< Min enumerator value of CH8 field.                                   */
  #define DPPIC_CHENCLR_CH8_Max (0x1UL)              /*!< Max enumerator value of CH8 field.                                   */
  #define DPPIC_CHENCLR_CH8_Disabled (0x0UL)         /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENCLR_CH8_Enabled (0x1UL)          /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENCLR_CH8_Clear (0x1UL)            /*!< Write: Disable channel                                               */

/* CH9 @Bit 9 : Channel 9 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH9_Pos (9UL)                /*!< Position of CH9 field.                                               */
  #define DPPIC_CHENCLR_CH9_Msk (0x1UL << DPPIC_CHENCLR_CH9_Pos) /*!< Bit mask of CH9 field.                                   */
  #define DPPIC_CHENCLR_CH9_Min (0x0UL)              /*!< Min enumerator value of CH9 field.                                   */
  #define DPPIC_CHENCLR_CH9_Max (0x1UL)              /*!< Max enumerator value of CH9 field.                                   */
  #define DPPIC_CHENCLR_CH9_Disabled (0x0UL)         /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENCLR_CH9_Enabled (0x1UL)          /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENCLR_CH9_Clear (0x1UL)            /*!< Write: Disable channel                                               */

