NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
  #define ETM_TRCCONFIGR_VMIDOPT_Pos (15UL)          /*!< Position of VMIDOPT field.                                           */
  #define ETM_TRCCONFIGR_VMIDOPT_Msk (0x1UL << ETM_TRCCONFIGR_VMIDOPT_Pos) /*!< Bit mask of VMIDOPT field.                     */
  #define ETM_TRCCONFIGR_VMIDOPT_Min (0x0UL)         /*!< Min enumerator value of VMIDOPT field.                               */
  #define ETM_TRCCONFIGR_VMIDOPT_Max (0x1UL)         /*!< Max enumerator value of VMIDOPT field.                               */
  #define ETM_TRCCONFIGR_VMIDOPT_VTTBR_EL2 (0x0UL)   /*!< VTTBR_EL2.VMID is used. If the trace unit supports a Virtual context
                                                          identifier larger than the VTTBR_EL2.VMID, the upper unused bits are
                                                          always zero. If the trace unit supports a Virtual context identifier
                                                          larger than 8 bits and if the VTCR_EL2.VS bit forces use of an 8-bit
                                                          Virtual context identifier, bits [15:8] of the trace unit Virtual
                                                          context identifier are always zero.*/
  #define ETM_TRCCONFIGR_VMIDOPT_CONTEXTIDR_EL2 (0x1UL) /*!< CONTEXTIDR_EL2 is used.                                           */

/* DA @Bit 16 : Data address tracing bit. */
  #define ETM_TRCCONFIGR_DA_Pos (16UL)               /*!< Position of DA field.                                                */
  #define ETM_TRCCONFIGR_DA_Msk (0x1UL << ETM_TRCCONFIGR_DA_Pos) /*!< Bit mask of DA field.                                    */
  #define ETM_TRCCONFIGR_DA_Min (0x0UL)              /*!< Min enumerator value of DA field.                                    */
  #define ETM_TRCCONFIGR_DA_Max (0x1UL)              /*!< Max enumerator value of DA field.                                    */
  #define ETM_TRCCONFIGR_DA_Disabled (0x0UL)         /*!< Data address tracing is disabled.                                    */
  #define ETM_TRCCONFIGR_DA_Enabled (0x1UL)          /*!< Data address tracing is enabled.                                     */

/* DV @Bit 17 : Data value tracing bit. */
  #define ETM_TRCCONFIGR_DV_Pos (17UL)               /*!< Position of DV field.                                                */
  #define ETM_TRCCONFIGR_DV_Msk (0x1UL << ETM_TRCCONFIGR_DV_Pos) /*!< Bit mask of DV field.                                    */
  #define ETM_TRCCONFIGR_DV_Min (0x0UL)              /*!< Min enumerator value of DV field.                                    */
  #define ETM_TRCCONFIGR_DV_Max (0x1UL)              /*!< Max enumerator value of DV field.                                    */
  #define ETM_TRCCONFIGR_DV_Disabled (0x0UL)         /*!< Data value tracing is disabled.                                      */
  #define ETM_TRCCONFIGR_DV_Enabled (0x1UL)          /*!< Data value tracing is enabled.                                       */


/* ETM_TRCEVENTCTL0R: Controls the tracing of arbitrary events. If the selected event occurs a trace element is generated in the
                       trace stream according to the settings in TRCEVENTCTL1R.DATAEN and TRCEVENTCTL1R.INSTEN. */

  #define ETM_TRCEVENTCTL0R_ResetValue (0x00000000UL) /*!< Reset value of TRCEVENTCTL0R register.                              */

/* EVENT @Bits 0..7 : Select which event should generate trace elements. */
  #define ETM_TRCEVENTCTL0R_EVENT_Pos (0UL)          /*!< Position of EVENT field.                                             */
  #define ETM_TRCEVENTCTL0R_EVENT_Msk (0xFFUL << ETM_TRCEVENTCTL0R_EVENT_Pos) /*!< Bit mask of EVENT field.                    */
  #define ETM_TRCEVENTCTL0R_EVENT_Min (0x00UL)       /*!< Min value of EVENT field.                                            */
  #define ETM_TRCEVENTCTL0R_EVENT_Max (0xFFUL)       /*!< Max size of EVENT field.                                             */


/* ETM_TRCEVENTCTL1R: Controls the behavior of the events that TRCEVENTCTL0R selects. This register must always be programmed as
                       part of trace unit initialization. Might ignore writes when the trace unit is enabled or not idle. */

  #define ETM_TRCEVENTCTL1R_ResetValue (0x00000000UL) /*!< Reset value of TRCEVENTCTL1R register.                              */

/* INSTEN0 @Bit 0 : Instruction event enable field. */
  #define ETM_TRCEVENTCTL1R_INSTEN0_Pos (0UL)        /*!< Position of INSTEN0 field.                                           */
  #define ETM_TRCEVENTCTL1R_INSTEN0_Msk (0x1UL << ETM_TRCEVENTCTL1R_INSTEN0_Pos) /*!< Bit mask of INSTEN0 field.               */
  #define ETM_TRCEVENTCTL1R_INSTEN0_Min (0x0UL)      /*!< Min enumerator value of INSTEN0 field.                               */
  #define ETM_TRCEVENTCTL1R_INSTEN0_Max (0x1UL)      /*!< Max enumerator value of INSTEN0 field.                               */
  #define ETM_TRCEVENTCTL1R_INSTEN0_Disabled (0x0UL) /*!< The trace unit does not generate an Event element.                   */
  #define ETM_TRCEVENTCTL1R_INSTEN0_Enabled (0x1UL)  /*!< The trace unit generates an Event element for event 0, in the
                                                          instruction trace stream.*/

/* INSTEN1 @Bit 1 : Instruction event enable field. */
  #define ETM_TRCEVENTCTL1R_INSTEN1_Pos (1UL)        /*!< Position of INSTEN1 field.                                           */
  #define ETM_TRCEVENTCTL1R_INSTEN1_Msk (0x1UL << ETM_TRCEVENTCTL1R_INSTEN1_Pos) /*!< Bit mask of INSTEN1 field.               */
  #define ETM_TRCEVENTCTL1R_INSTEN1_Min (0x0UL)      /*!< Min enumerator value of INSTEN1 field.                               */
  #define ETM_TRCEVENTCTL1R_INSTEN1_Max (0x1UL)      /*!< Max enumerator value of INSTEN1 field.                               */
  #define ETM_TRCEVENTCTL1R_INSTEN1_Disabled (0x0UL) /*!< The trace unit does not generate an Event element.                   */
  #define ETM_TRCEVENTCTL1R_INSTEN1_Enabled (0x1UL)  /*!< The trace unit generates an Event element for event 1, in the
                                                          instruction trace stream.*/

