NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* FICR_INFO_UUID: 128-bit Universally Unique IDentifier (UUID). */
  #define FICR_INFO_UUID_MaxCount (4UL)              /*!< Max size of UUID[4] array.                                           */
  #define FICR_INFO_UUID_MaxIndex (3UL)              /*!< Max index of UUID[4] array.                                          */
  #define FICR_INFO_UUID_MinIndex (0UL)              /*!< Min index of UUID[4] array.                                          */
  #define FICR_INFO_UUID_ResetValue (0xFFFFFFFFUL)   /*!< Reset value of UUID[4] register.                                     */

/* UUID @Bits 0..31 : Device UUID [n]. */
  #define FICR_INFO_UUID_UUID_Pos (0UL)              /*!< Position of UUID field.                                              */
  #define FICR_INFO_UUID_UUID_Msk (0xFFFFFFFFUL << FICR_INFO_UUID_UUID_Pos) /*!< Bit mask of UUID field.                       */


/* FICR_INFO_PART: Part code */
  #define FICR_INFO_PART_ResetValue (0xFFFFFFFFUL)   /*!< Reset value of PART register.                                        */

/* PART @Bits 0..31 : Part code */
  #define FICR_INFO_PART_PART_Pos (0UL)              /*!< Position of PART field.                                              */
  #define FICR_INFO_PART_PART_Msk (0xFFFFFFFFUL << FICR_INFO_PART_PART_Pos) /*!< Bit mask of PART field.                       */
  #define FICR_INFO_PART_PART_Min (0x00071200UL)     /*!< Min enumerator value of PART field.                                  */
  #define FICR_INFO_PART_PART_Max (0xFFFFFFFFUL)     /*!< Max enumerator value of PART field.                                  */
  #define FICR_INFO_PART_PART_N7120 (0x00071200UL)   /*!< nRF7120                                                              */
  #define FICR_INFO_PART_PART_N7120E (0x0007120EUL)  /*!< nRF7120E                                                             */
  #define FICR_INFO_PART_PART_Unspecified (0xFFFFFFFFUL) /*!< Unspecified                                                      */


/* FICR_INFO_VARIANT: Function variant code, Hardware version code, and Production configuration code encoded as ASCII. */
  #define FICR_INFO_VARIANT_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VARIANT register.                                    */

/* VARIANT @Bits 0..31 : Function variant code, Hardware version code, and Production configuration code encoded as ASCII */
  #define FICR_INFO_VARIANT_VARIANT_Pos (0UL)        /*!< Position of VARIANT field.                                           */
  #define FICR_INFO_VARIANT_VARIANT_Msk (0xFFFFFFFFUL << FICR_INFO_VARIANT_VARIANT_Pos) /*!< Bit mask of VARIANT field.        */
  #define FICR_INFO_VARIANT_VARIANT_Min (0x41414230UL) /*!< Min enumerator value of VARIANT field.                             */
  #define FICR_INFO_VARIANT_VARIANT_Max (0xFFFFFFFFUL) /*!< Max enumerator value of VARIANT field.                             */
  #define FICR_INFO_VARIANT_VARIANT_AAB0 (0x41414230UL) /*!< Example encoding for AAB0 - Function variant code AA, Hardware
                                                             version code B, Production configuration code 0*/
  #define FICR_INFO_VARIANT_VARIANT_Unspecified (0xFFFFFFFFUL) /*!< Unspecified                                                */


/* FICR_INFO_PACKAGE: Package option */
  #define FICR_INFO_PACKAGE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PACKAGE register.                                    */

/* PACKAGE @Bits 0..31 : Package option */
  #define FICR_INFO_PACKAGE_PACKAGE_Pos (0UL)        /*!< Position of PACKAGE field.                                           */
  #define FICR_INFO_PACKAGE_PACKAGE_Msk (0xFFFFFFFFUL << FICR_INFO_PACKAGE_PACKAGE_Pos) /*!< Bit mask of PACKAGE field.        */
  #define FICR_INFO_PACKAGE_PACKAGE_Min (0xFFFFFFFFUL) /*!< Min enumerator value of PACKAGE field.                             */
  #define FICR_INFO_PACKAGE_PACKAGE_Max (0xFFFFFFFFUL) /*!< Max enumerator value of PACKAGE field.                             */
  #define FICR_INFO_PACKAGE_PACKAGE_Unspecified (0xFFFFFFFFUL) /*!< Unspecified                                                */


/* FICR_INFO_RAM: RAM size (KB) */
  #define FICR_INFO_RAM_ResetValue (0xFFFFFFFFUL)    /*!< Reset value of RAM register.                                         */

/* RAM @Bits 0..31 : RAM size (KB) */
  #define FICR_INFO_RAM_RAM_Pos (0UL)                /*!< Position of RAM field.                                               */
  #define FICR_INFO_RAM_RAM_Msk (0xFFFFFFFFUL << FICR_INFO_RAM_RAM_Pos) /*!< Bit mask of RAM field.                            */
  #define FICR_INFO_RAM_RAM_Min (0x000003F8UL)       /*!< Min enumerator value of RAM field.                                   */
  #define FICR_INFO_RAM_RAM_Max (0xFFFFFFFFUL)       /*!< Max enumerator value of RAM field.                                   */
  #define FICR_INFO_RAM_RAM_K1016 (0x000003F8UL)     /*!< 1016 kByte RAM                                                       */
  #define FICR_INFO_RAM_RAM_Unspecified (0xFFFFFFFFUL) /*!< Unspecified                                                        */


/* FICR_INFO_MRAM: MRAM size (KB) */
  #define FICR_INFO_MRAM_ResetValue (0xFFFFFFFFUL)   /*!< Reset value of MRAM register.                                        */

/* MRAM @Bits 0..31 : MRAM size (KB) */
  #define FICR_INFO_MRAM_MRAM_Pos (0UL)              /*!< Position of MRAM field.                                              */
  #define FICR_INFO_MRAM_MRAM_Msk (0xFFFFFFFFUL << FICR_INFO_MRAM_MRAM_Pos) /*!< Bit mask of MRAM field.                       */
  #define FICR_INFO_MRAM_MRAM_Min (0x00000FECUL)     /*!< Min enumerator value of MRAM field.                                  */
  #define FICR_INFO_MRAM_MRAM_Max (0xFFFFFFFFUL)     /*!< Max enumerator value of MRAM field.                                  */
  #define FICR_INFO_MRAM_MRAM_K4076 (0x00000FECUL)   /*!< 4076 KByte MRAM                                                      */
  #define FICR_INFO_MRAM_MRAM_Unspecified (0xFFFFFFFFUL) /*!< Unspecified                                                      */



/* =================================================== Struct FICR_TRIMCNF =================================================== */
/**
  * @brief TRIMCNF [FICR_TRIMCNF] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ADDR;                              /*!< (@ 0x00000000) Address of the register which will be written         */
  __IOM uint32_t  DATA;                              /*!< (@ 0x00000004) Data to be written into the register                  */
} NRF_FICR_TRIMCNF_Type;                             /*!< Size = 8 (0x008)                                                     */
  #define FICR_TRIMCNF_MaxCount (128UL)              /*!< Size of TRIMCNF[128] array.                                          */
  #define FICR_TRIMCNF_MaxIndex (127UL)              /*!< Max index of TRIMCNF[128] array.                                     */
  #define FICR_TRIMCNF_MinIndex (0UL)                /*!< Min index of TRIMCNF[128] array.                                     */

/* FICR_TRIMCNF_ADDR: Address of the register which will be written */
  #define FICR_TRIMCNF_ADDR_ResetValue (0xFFFFFFFFUL) /*!< Reset value of ADDR register.                                       */

/* Address @Bits 0..31 : Address */
  #define FICR_TRIMCNF_ADDR_Address_Pos (0UL)        /*!< Position of Address field.                                           */
  #define FICR_TRIMCNF_ADDR_Address_Msk (0xFFFFFFFFUL << FICR_TRIMCNF_ADDR_Address_Pos) /*!< Bit mask of Address field.        */


/* FICR_TRIMCNF_DATA: Data to be written into the register */
  #define FICR_TRIMCNF_DATA_ResetValue (0xFFFFFFFFUL) /*!< Reset value of DATA register.                                       */

/* Data @Bits 0..31 : Data */
  #define FICR_TRIMCNF_DATA_Data_Pos (0UL)           /*!< Position of Data field.                                              */
  #define FICR_TRIMCNF_DATA_Data_Msk (0xFFFFFFFFUL << FICR_TRIMCNF_DATA_Data_Pos) /*!< Bit mask of Data field.                 */



/* ===================================================== Struct FICR_NFC ===================================================== */
/**
  * @brief NFC [FICR_NFC] (unspecified)
  */
typedef struct {
  __IOM uint32_t  TAGHEADER0;                        /*!< (@ 0x00000000) Default header for NFC Tag. Software can read these
                                                                         values to populate NFCID1_3RD_LAST, NFCID1_2ND_LAST and
                                                                         NFCID1_LAST.*/
  __IOM uint32_t  TAGHEADER1;                        /*!< (@ 0x00000004) Default header for NFC Tag. Software can read these
                                                                         values to populate NFCID1_3RD_LAST, NFCID1_2ND_LAST and
                                                                         NFCID1_LAST.*/
  __IOM uint32_t  TAGHEADER2;                        /*!< (@ 0x00000008) Default header for NFC Tag. Software can read these
                                                                         values to populate NFCID1_3RD_LAST, NFCID1_2ND_LAST and
                                                                         NFCID1_LAST.*/
  __IOM uint32_t  TAGHEADER3;                        /*!< (@ 0x0000000C) Default header for NFC Tag. Software can read these
                                                                         values to populate NFCID1_3RD_LAST, NFCID1_2ND_LAST and
                                                                         NFCID1_LAST.*/
} NRF_FICR_NFC_Type;                                 /*!< Size = 16 (0x010)                                                    */

/* FICR_NFC_TAGHEADER0: Default header for NFC Tag. Software can read these values to populate NFCID1_3RD_LAST, NFCID1_2ND_LAST
                         and NFCID1_LAST. */

  #define FICR_NFC_TAGHEADER0_ResetValue (0xFFFFFF5FUL) /*!< Reset value of TAGHEADER0 register.                               */

/* MFGID @Bits 0..7 : Default Manufacturer ID: Nordic Semiconductor ASA has ICM 0x5F */
  #define FICR_NFC_TAGHEADER0_MFGID_Pos (0UL)        /*!< Position of MFGID field.                                             */
  #define FICR_NFC_TAGHEADER0_MFGID_Msk (0xFFUL << FICR_NFC_TAGHEADER0_MFGID_Pos) /*!< Bit mask of MFGID field.                */

/* UD1 @Bits 8..15 : Unique identifier byte 1 */
  #define FICR_NFC_TAGHEADER0_UD1_Pos (8UL)          /*!< Position of UD1 field.                                               */
  #define FICR_NFC_TAGHEADER0_UD1_Msk (0xFFUL << FICR_NFC_TAGHEADER0_UD1_Pos) /*!< Bit mask of UD1 field.                      */

/* UD2 @Bits 16..23 : Unique identifier byte 2 */
  #define FICR_NFC_TAGHEADER0_UD2_Pos (16UL)         /*!< Position of UD2 field.                                               */
  #define FICR_NFC_TAGHEADER0_UD2_Msk (0xFFUL << FICR_NFC_TAGHEADER0_UD2_Pos) /*!< Bit mask of UD2 field.                      */

/* UD3 @Bits 24..31 : Unique identifier byte 3 */
  #define FICR_NFC_TAGHEADER0_UD3_Pos (24UL)         /*!< Position of UD3 field.                                               */
  #define FICR_NFC_TAGHEADER0_UD3_Msk (0xFFUL << FICR_NFC_TAGHEADER0_UD3_Pos) /*!< Bit mask of UD3 field.                      */


/* FICR_NFC_TAGHEADER1: Default header for NFC Tag. Software can read these values to populate NFCID1_3RD_LAST, NFCID1_2ND_LAST
                         and NFCID1_LAST. */

  #define FICR_NFC_TAGHEADER1_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TAGHEADER1 register.                               */

/* UD4 @Bits 0..7 : Unique identifier byte 4 */
  #define FICR_NFC_TAGHEADER1_UD4_Pos (0UL)          /*!< Position of UD4 field.                                               */
  #define FICR_NFC_TAGHEADER1_UD4_Msk (0xFFUL << FICR_NFC_TAGHEADER1_UD4_Pos) /*!< Bit mask of UD4 field.                      */

