NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* UD5 @Bits 8..15 : Unique identifier byte 5 */
  #define FICR_NFC_TAGHEADER1_UD5_Pos (8UL)          /*!< Position of UD5 field.                                               */
  #define FICR_NFC_TAGHEADER1_UD5_Msk (0xFFUL << FICR_NFC_TAGHEADER1_UD5_Pos) /*!< Bit mask of UD5 field.                      */

/* UD6 @Bits 16..23 : Unique identifier byte 6 */
  #define FICR_NFC_TAGHEADER1_UD6_Pos (16UL)         /*!< Position of UD6 field.                                               */
  #define FICR_NFC_TAGHEADER1_UD6_Msk (0xFFUL << FICR_NFC_TAGHEADER1_UD6_Pos) /*!< Bit mask of UD6 field.                      */

/* UD7 @Bits 24..31 : Unique identifier byte 7 */
  #define FICR_NFC_TAGHEADER1_UD7_Pos (24UL)         /*!< Position of UD7 field.                                               */
  #define FICR_NFC_TAGHEADER1_UD7_Msk (0xFFUL << FICR_NFC_TAGHEADER1_UD7_Pos) /*!< Bit mask of UD7 field.                      */


/* FICR_NFC_TAGHEADER2: Default header for NFC Tag. Software can read these values to populate NFCID1_3RD_LAST, NFCID1_2ND_LAST
                         and NFCID1_LAST. */

  #define FICR_NFC_TAGHEADER2_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TAGHEADER2 register.                               */

/* UD8 @Bits 0..7 : Unique identifier byte 8 */
  #define FICR_NFC_TAGHEADER2_UD8_Pos (0UL)          /*!< Position of UD8 field.                                               */
  #define FICR_NFC_TAGHEADER2_UD8_Msk (0xFFUL << FICR_NFC_TAGHEADER2_UD8_Pos) /*!< Bit mask of UD8 field.                      */

/* UD9 @Bits 8..15 : Unique identifier byte 9 */
  #define FICR_NFC_TAGHEADER2_UD9_Pos (8UL)          /*!< Position of UD9 field.                                               */
  #define FICR_NFC_TAGHEADER2_UD9_Msk (0xFFUL << FICR_NFC_TAGHEADER2_UD9_Pos) /*!< Bit mask of UD9 field.                      */

/* UD10 @Bits 16..23 : Unique identifier byte 10 */
  #define FICR_NFC_TAGHEADER2_UD10_Pos (16UL)        /*!< Position of UD10 field.                                              */
  #define FICR_NFC_TAGHEADER2_UD10_Msk (0xFFUL << FICR_NFC_TAGHEADER2_UD10_Pos) /*!< Bit mask of UD10 field.                   */

/* UD11 @Bits 24..31 : Unique identifier byte 11 */
  #define FICR_NFC_TAGHEADER2_UD11_Pos (24UL)        /*!< Position of UD11 field.                                              */
  #define FICR_NFC_TAGHEADER2_UD11_Msk (0xFFUL << FICR_NFC_TAGHEADER2_UD11_Pos) /*!< Bit mask of UD11 field.                   */


/* FICR_NFC_TAGHEADER3: Default header for NFC Tag. Software can read these values to populate NFCID1_3RD_LAST, NFCID1_2ND_LAST
                         and NFCID1_LAST. */

  #define FICR_NFC_TAGHEADER3_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TAGHEADER3 register.                               */

/* UD12 @Bits 0..7 : Unique identifier byte 12 */
  #define FICR_NFC_TAGHEADER3_UD12_Pos (0UL)         /*!< Position of UD12 field.                                              */
  #define FICR_NFC_TAGHEADER3_UD12_Msk (0xFFUL << FICR_NFC_TAGHEADER3_UD12_Pos) /*!< Bit mask of UD12 field.                   */

/* UD13 @Bits 8..15 : Unique identifier byte 13 */
  #define FICR_NFC_TAGHEADER3_UD13_Pos (8UL)         /*!< Position of UD13 field.                                              */
  #define FICR_NFC_TAGHEADER3_UD13_Msk (0xFFUL << FICR_NFC_TAGHEADER3_UD13_Pos) /*!< Bit mask of UD13 field.                   */

/* UD14 @Bits 16..23 : Unique identifier byte 14 */
  #define FICR_NFC_TAGHEADER3_UD14_Pos (16UL)        /*!< Position of UD14 field.                                              */
  #define FICR_NFC_TAGHEADER3_UD14_Msk (0xFFUL << FICR_NFC_TAGHEADER3_UD14_Pos) /*!< Bit mask of UD14 field.                   */

/* UD15 @Bits 24..31 : Unique identifier byte 15 */
  #define FICR_NFC_TAGHEADER3_UD15_Pos (24UL)        /*!< Position of UD15 field.                                              */
  #define FICR_NFC_TAGHEADER3_UD15_Msk (0xFFUL << FICR_NFC_TAGHEADER3_UD15_Pos) /*!< Bit mask of UD15 field.                   */



/* =================================================== Struct FICR_MACADDR =================================================== */
/**
  * @brief MACADDR [FICR_MACADDR] 48-bit MAC address n
  */
typedef struct {
  __IOM uint32_t  LOW;                               /*!< (@ 0x00000000) Lower 24 bits of MAC address n                        */
  __IOM uint32_t  HIGH;                              /*!< (@ 0x00000004) Upper 24 bits of MAC address n                        */
} NRF_FICR_MACADDR_Type;                             /*!< Size = 8 (0x008)                                                     */
  #define FICR_MACADDR_MaxCount (2UL)                /*!< Size of MACADDR[2] array.                                            */
  #define FICR_MACADDR_MaxIndex (1UL)                /*!< Max index of MACADDR[2] array.                                       */
  #define FICR_MACADDR_MinIndex (0UL)                /*!< Min index of MACADDR[2] array.                                       */

/* FICR_MACADDR_LOW: Lower 24 bits of MAC address n */
  #define FICR_MACADDR_LOW_ResetValue (0xFFFFFFFFUL) /*!< Reset value of LOW register.                                         */

/* ADDR @Bits 0..23 : MAC address bits [23:0] */
  #define FICR_MACADDR_LOW_ADDR_Pos (0UL)            /*!< Position of ADDR field.                                              */
  #define FICR_MACADDR_LOW_ADDR_Msk (0xFFFFFFUL << FICR_MACADDR_LOW_ADDR_Pos) /*!< Bit mask of ADDR field.                     */


/* FICR_MACADDR_HIGH: Upper 24 bits of MAC address n */
  #define FICR_MACADDR_HIGH_ResetValue (0xFFFFFFFFUL) /*!< Reset value of HIGH register.                                       */

/* ADDR @Bits 0..23 : MAC address bits [47:24] */
  #define FICR_MACADDR_HIGH_ADDR_Pos (0UL)           /*!< Position of ADDR field.                                              */
  #define FICR_MACADDR_HIGH_ADDR_Msk (0xFFFFFFUL << FICR_MACADDR_HIGH_ADDR_Pos) /*!< Bit mask of ADDR field.                   */



/* ================================================== Struct FICR_XTALCOMP =================================================== */
/**
  * @brief XTALCOMP [FICR_XTALCOMP] Crystal oscillator (XTAL) temperature compensation data
  */
typedef struct {
  __IOM uint32_t  OFFSET;                            /*!< (@ 0x00000000) Measured XTAL frequency error at room temperature     */
  __IOM uint32_t  LOWTEMPTHRESHOLD;                  /*!< (@ 0x00000004) Low temperature threshold for frequency skew
                                                                         compensation*/
  __IOM uint32_t  LOWTEMPADJUST;                     /*!< (@ 0x00000008) Frequency adjustment applied below the low temperature
                                                                         threshold*/
  __IM  uint32_t  RESERVED[5];
} NRF_FICR_XTALCOMP_Type;                            /*!< Size = 32 (0x020)                                                    */

