NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* FICR_XTALCOMP_OFFSET: Measured XTAL frequency error at room temperature */
  #define FICR_XTALCOMP_OFFSET_ResetValue (0xFFFFFFFFUL) /*!< Reset value of OFFSET register.                                  */

/* OFFSET @Bits 0..31 : Frequency error in ppm */
  #define FICR_XTALCOMP_OFFSET_OFFSET_Pos (0UL)      /*!< Position of OFFSET field.                                            */
  #define FICR_XTALCOMP_OFFSET_OFFSET_Msk (0xFFFFFFFFUL << FICR_XTALCOMP_OFFSET_OFFSET_Pos) /*!< Bit mask of OFFSET field.     */


/* FICR_XTALCOMP_LOWTEMPTHRESHOLD: Low temperature threshold for frequency skew compensation */
  #define FICR_XTALCOMP_LOWTEMPTHRESHOLD_ResetValue (0xFFFFFFFFUL) /*!< Reset value of LOWTEMPTHRESHOLD register.              */

/* THRESHOLD @Bits 0..31 : Low temperature threshold */
  #define FICR_XTALCOMP_LOWTEMPTHRESHOLD_THRESHOLD_Pos (0UL) /*!< Position of THRESHOLD field.                                 */
  #define FICR_XTALCOMP_LOWTEMPTHRESHOLD_THRESHOLD_Msk (0xFFFFFFFFUL << FICR_XTALCOMP_LOWTEMPTHRESHOLD_THRESHOLD_Pos) /*!< Bit
                                                                            mask of THRESHOLD field.*/


/* FICR_XTALCOMP_LOWTEMPADJUST: Frequency adjustment applied below the low temperature threshold */
  #define FICR_XTALCOMP_LOWTEMPADJUST_ResetValue (0xFFFFFFFFUL) /*!< Reset value of LOWTEMPADJUST register.                    */

/* ADJUST @Bits 0..31 : Frequency adjustment in ppm */
  #define FICR_XTALCOMP_LOWTEMPADJUST_ADJUST_Pos (0UL) /*!< Position of ADJUST field.                                          */
  #define FICR_XTALCOMP_LOWTEMPADJUST_ADJUST_Msk (0xFFFFFFFFUL << FICR_XTALCOMP_LOWTEMPADJUST_ADJUST_Pos) /*!< Bit mask of
                                                                            ADJUST field.*/


/* ======================================================= Struct FICR ======================================================= */
/**
  * @brief Factory Information Configuration Registers
  */
  typedef struct {                                   /*!< FICR Structure                                                       */
    __IM uint32_t RESERVED[192];
    __IOM NRF_FICR_INFO_Type INFO;                   /*!< (@ 0x00000300) Device info                                           */
    __IM uint32_t RESERVED1[19];
    __IOM uint32_t ER[4];                            /*!< (@ 0x00000380) Common encryption root key, word n                    */
    __IOM uint32_t IR[4];                            /*!< (@ 0x00000390) Common identity root key, word n                      */
    __IOM uint32_t DEVICEADDRTYPE;                   /*!< (@ 0x000003A0) Device address type                                   */
    __IOM uint32_t DEVICEADDR[2];                    /*!< (@ 0x000003A4) Device address n                                      */
    __IM uint32_t RESERVED2[21];
    __IOM NRF_FICR_TRIMCNF_Type TRIMCNF[128];        /*!< (@ 0x00000400) (unspecified)                                         */
    __IM uint32_t RESERVED3[64];
    __IOM NRF_FICR_NFC_Type NFC;                     /*!< (@ 0x00000900) (unspecified)                                         */
    __IM uint32_t RESERVED4[188];
    __IOM NRF_FICR_MACADDR_Type MACADDR[2];          /*!< (@ 0x00000C00) 48-bit MAC address n                                  */
    __IM uint32_t RESERVED5[4];
    __IOM NRF_FICR_XTALCOMP_Type XTALCOMP;           /*!< (@ 0x00000C20) Crystal oscillator (XTAL) temperature compensation
                                                                         data*/
  } NRF_FICR_Type;                                   /*!< Size = 3136 (0xC40)                                                  */

/* FICR_ER: Common encryption root key, word n */
  #define FICR_ER_MaxCount (4UL)                     /*!< Max size of ER[4] array.                                             */
  #define FICR_ER_MaxIndex (3UL)                     /*!< Max index of ER[4] array.                                            */
  #define FICR_ER_MinIndex (0UL)                     /*!< Min index of ER[4] array.                                            */
  #define FICR_ER_ResetValue (0xFFFFFFFFUL)          /*!< Reset value of ER[4] register.                                       */

/* ER @Bits 0..31 : Encryption Root, word n */
  #define FICR_ER_ER_Pos (0UL)                       /*!< Position of ER field.                                                */
  #define FICR_ER_ER_Msk (0xFFFFFFFFUL << FICR_ER_ER_Pos) /*!< Bit mask of ER field.                                           */


/* FICR_IR: Common identity root key, word n */
  #define FICR_IR_MaxCount (4UL)                     /*!< Max size of IR[4] array.                                             */
  #define FICR_IR_MaxIndex (3UL)                     /*!< Max index of IR[4] array.                                            */
  #define FICR_IR_MinIndex (0UL)                     /*!< Min index of IR[4] array.                                            */
  #define FICR_IR_ResetValue (0xFFFFFFFFUL)          /*!< Reset value of IR[4] register.                                       */

/* IR @Bits 0..31 : Identity Root, word n */
  #define FICR_IR_IR_Pos (0UL)                       /*!< Position of IR field.                                                */
  #define FICR_IR_IR_Msk (0xFFFFFFFFUL << FICR_IR_IR_Pos) /*!< Bit mask of IR field.                                           */


/* FICR_DEVICEADDRTYPE: Device address type */
  #define FICR_DEVICEADDRTYPE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of DEVICEADDRTYPE register.                           */

/* DEVICEADDRTYPE @Bit 0 : Device address type */
  #define FICR_DEVICEADDRTYPE_DEVICEADDRTYPE_Pos (0UL) /*!< Position of DEVICEADDRTYPE field.                                  */
  #define FICR_DEVICEADDRTYPE_DEVICEADDRTYPE_Msk (0x1UL << FICR_DEVICEADDRTYPE_DEVICEADDRTYPE_Pos) /*!< Bit mask of
                                                                            DEVICEADDRTYPE field.*/
  #define FICR_DEVICEADDRTYPE_DEVICEADDRTYPE_Min (0x0UL) /*!< Min enumerator value of DEVICEADDRTYPE field.                    */
  #define FICR_DEVICEADDRTYPE_DEVICEADDRTYPE_Max (0x1UL) /*!< Max enumerator value of DEVICEADDRTYPE field.                    */
  #define FICR_DEVICEADDRTYPE_DEVICEADDRTYPE_Public (0x0UL) /*!< Public address                                                */
  #define FICR_DEVICEADDRTYPE_DEVICEADDRTYPE_Random (0x1UL) /*!< Random address                                                */


/* FICR_DEVICEADDR: Device address n */
  #define FICR_DEVICEADDR_MaxCount (2UL)             /*!< Max size of DEVICEADDR[2] array.                                     */
  #define FICR_DEVICEADDR_MaxIndex (1UL)             /*!< Max index of DEVICEADDR[2] array.                                    */
  #define FICR_DEVICEADDR_MinIndex (0UL)             /*!< Min index of DEVICEADDR[2] array.                                    */
  #define FICR_DEVICEADDR_ResetValue (0xFFFFFFFFUL)  /*!< Reset value of DEVICEADDR[2] register.                               */

