NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* PIN31 @Bit 31 : Status on whether PIN31 has met criteria set in PIN_CNF[31].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN31_Pos (31UL)                /*!< Position of PIN31 field.                                             */
  #define GPIO_LATCH_PIN31_Msk (0x1UL << GPIO_LATCH_PIN31_Pos) /*!< Bit mask of PIN31 field.                                   */
  #define GPIO_LATCH_PIN31_Min (0x0UL)               /*!< Min enumerator value of PIN31 field.                                 */
  #define GPIO_LATCH_PIN31_Max (0x1UL)               /*!< Max enumerator value of PIN31 field.                                 */
  #define GPIO_LATCH_PIN31_NotLatched (0x0UL)        /*!< Criteria has not been met                                            */
  #define GPIO_LATCH_PIN31_Latched (0x1UL)           /*!< Criteria has been met                                                */


/* GPIO_DETECTMODE: Select between default DETECT signal behavior and LDETECT mode */
  #define GPIO_DETECTMODE_ResetValue (0x00000000UL)  /*!< Reset value of DETECTMODE register.                                  */

/* DETECTMODE @Bit 0 : Select between default DETECT signal behavior and LDETECT mode */
  #define GPIO_DETECTMODE_DETECTMODE_Pos (0UL)       /*!< Position of DETECTMODE field.                                        */
  #define GPIO_DETECTMODE_DETECTMODE_Msk (0x1UL << GPIO_DETECTMODE_DETECTMODE_Pos) /*!< Bit mask of DETECTMODE field.          */
  #define GPIO_DETECTMODE_DETECTMODE_Min (0x0UL)     /*!< Min enumerator value of DETECTMODE field.                            */
  #define GPIO_DETECTMODE_DETECTMODE_Max (0x1UL)     /*!< Max enumerator value of DETECTMODE field.                            */
  #define GPIO_DETECTMODE_DETECTMODE_Default (0x0UL) /*!< DETECT directly connected to PIN DETECT signals                      */
  #define GPIO_DETECTMODE_DETECTMODE_LDETECT (0x1UL) /*!< Use the latched LDETECT behavior                                     */


/* GPIO_PIN_CNF: Pin n configuration of GPIO pin */
  #define GPIO_PIN_CNF_MaxCount (32UL)               /*!< Max size of PIN_CNF[32] array.                                       */
  #define GPIO_PIN_CNF_MaxIndex (31UL)               /*!< Max index of PIN_CNF[32] array.                                      */
  #define GPIO_PIN_CNF_MinIndex (0UL)                /*!< Min index of PIN_CNF[32] array.                                      */
  #define GPIO_PIN_CNF_ResetValue (0x00000002UL)     /*!< Reset value of PIN_CNF[32] register.                                 */

/* DIR @Bit 0 : Pin direction. Same physical register as DIR register */
  #define GPIO_PIN_CNF_DIR_Pos (0UL)                 /*!< Position of DIR field.                                               */
  #define GPIO_PIN_CNF_DIR_Msk (0x1UL << GPIO_PIN_CNF_DIR_Pos) /*!< Bit mask of DIR field.                                     */
  #define GPIO_PIN_CNF_DIR_Min (0x0UL)               /*!< Min enumerator value of DIR field.                                   */
  #define GPIO_PIN_CNF_DIR_Max (0x1UL)               /*!< Max enumerator value of DIR field.                                   */
  #define GPIO_PIN_CNF_DIR_Input (0x0UL)             /*!< Configure pin as an input pin                                        */
  #define GPIO_PIN_CNF_DIR_Output (0x1UL)            /*!< Configure pin as an output pin                                       */

/* INPUT @Bit 1 : Connect or disconnect input buffer */
  #define GPIO_PIN_CNF_INPUT_Pos (1UL)               /*!< Position of INPUT field.                                             */
  #define GPIO_PIN_CNF_INPUT_Msk (0x1UL << GPIO_PIN_CNF_INPUT_Pos) /*!< Bit mask of INPUT field.                               */
  #define GPIO_PIN_CNF_INPUT_Min (0x0UL)             /*!< Min enumerator value of INPUT field.                                 */
  #define GPIO_PIN_CNF_INPUT_Max (0x1UL)             /*!< Max enumerator value of INPUT field.                                 */
  #define GPIO_PIN_CNF_INPUT_Connect (0x0UL)         /*!< Connect input buffer                                                 */
  #define GPIO_PIN_CNF_INPUT_Disconnect (0x1UL)      /*!< Disconnect input buffer                                              */

/* PULL @Bits 2..3 : Pull configuration */
  #define GPIO_PIN_CNF_PULL_Pos (2UL)                /*!< Position of PULL field.                                              */
  #define GPIO_PIN_CNF_PULL_Msk (0x3UL << GPIO_PIN_CNF_PULL_Pos) /*!< Bit mask of PULL field.                                  */
  #define GPIO_PIN_CNF_PULL_Min (0x0UL)              /*!< Min enumerator value of PULL field.                                  */
  #define GPIO_PIN_CNF_PULL_Max (0x3UL)              /*!< Max enumerator value of PULL field.                                  */
  #define GPIO_PIN_CNF_PULL_Disabled (0x0UL)         /*!< No pull                                                              */
  #define GPIO_PIN_CNF_PULL_Pulldown (0x1UL)         /*!< Pull-down on pin                                                     */
  #define GPIO_PIN_CNF_PULL_Pullup (0x3UL)           /*!< Pull-up on pin                                                       */

/* DRIVE0 @Bits 8..9 : Drive configuration for '0' */
  #define GPIO_PIN_CNF_DRIVE0_Pos (8UL)              /*!< Position of DRIVE0 field.                                            */
  #define GPIO_PIN_CNF_DRIVE0_Msk (0x3UL << GPIO_PIN_CNF_DRIVE0_Pos) /*!< Bit mask of DRIVE0 field.                            */
  #define GPIO_PIN_CNF_DRIVE0_Min (0x0UL)            /*!< Min enumerator value of DRIVE0 field.                                */
  #define GPIO_PIN_CNF_DRIVE0_Max (0x3UL)            /*!< Max enumerator value of DRIVE0 field.                                */
  #define GPIO_PIN_CNF_DRIVE0_S0 (0x0UL)             /*!< Standard '0'                                                         */
  #define GPIO_PIN_CNF_DRIVE0_H0 (0x1UL)             /*!< High drive '0'                                                       */
  #define GPIO_PIN_CNF_DRIVE0_D0 (0x2UL)             /*!< Disconnect '0'(normally used for wired-or connections)               */
  #define GPIO_PIN_CNF_DRIVE0_E0 (0x3UL)             /*!< Extra high drive '0'                                                 */

/* DRIVE1 @Bits 10..11 : Drive configuration for '1' */
  #define GPIO_PIN_CNF_DRIVE1_Pos (10UL)             /*!< Position of DRIVE1 field.                                            */
  #define GPIO_PIN_CNF_DRIVE1_Msk (0x3UL << GPIO_PIN_CNF_DRIVE1_Pos) /*!< Bit mask of DRIVE1 field.                            */
  #define GPIO_PIN_CNF_DRIVE1_Min (0x0UL)            /*!< Min enumerator value of DRIVE1 field.                                */
  #define GPIO_PIN_CNF_DRIVE1_Max (0x3UL)            /*!< Max enumerator value of DRIVE1 field.                                */
  #define GPIO_PIN_CNF_DRIVE1_S1 (0x0UL)             /*!< Standard '1'                                                         */
  #define GPIO_PIN_CNF_DRIVE1_H1 (0x1UL)             /*!< High drive '1'                                                       */
  #define GPIO_PIN_CNF_DRIVE1_D1 (0x2UL)             /*!< Disconnect '1'(normally used for wired-or connections)               */
  #define GPIO_PIN_CNF_DRIVE1_E1 (0x3UL)             /*!< Extra high drive '1'                                                 */

/* SENSE @Bits 16..17 : Pin sensing mechanism */
  #define GPIO_PIN_CNF_SENSE_Pos (16UL)              /*!< Position of SENSE field.                                             */
  #define GPIO_PIN_CNF_SENSE_Msk (0x3UL << GPIO_PIN_CNF_SENSE_Pos) /*!< Bit mask of SENSE field.                               */
  #define GPIO_PIN_CNF_SENSE_Min (0x0UL)             /*!< Min enumerator value of SENSE field.                                 */
  #define GPIO_PIN_CNF_SENSE_Max (0x3UL)             /*!< Max enumerator value of SENSE field.                                 */
  #define GPIO_PIN_CNF_SENSE_Disabled (0x0UL)        /*!< Disabled                                                             */
  #define GPIO_PIN_CNF_SENSE_High (0x2UL)            /*!< Sense for high level                                                 */
  #define GPIO_PIN_CNF_SENSE_Low (0x3UL)             /*!< Sense for low level                                                  */

/* CTRLSEL @Bits 28..30 : Select which module has direct control over this pin */
  #define GPIO_PIN_CNF_CTRLSEL_Pos (28UL)            /*!< Position of CTRLSEL field.                                           */
  #define GPIO_PIN_CNF_CTRLSEL_Msk (0x7UL << GPIO_PIN_CNF_CTRLSEL_Pos) /*!< Bit mask of CTRLSEL field.                         */
  #define GPIO_PIN_CNF_CTRLSEL_Min (0x0UL)           /*!< Min enumerator value of CTRLSEL field.                               */
  #define GPIO_PIN_CNF_CTRLSEL_Max (0x5UL)           /*!< Max enumerator value of CTRLSEL field.                               */
  #define GPIO_PIN_CNF_CTRLSEL_GPIO (0x0UL)          /*!< GPIO or peripherals with PSEL registers                              */
  #define GPIO_PIN_CNF_CTRLSEL_VPR (0x1UL)           /*!< VPR processor                                                        */
  #define GPIO_PIN_CNF_CTRLSEL_MSPI (0x2UL)          /*!< MSPI peripheral                                                      */
  #define GPIO_PIN_CNF_CTRLSEL_GRTC (0x4UL)          /*!< GRTC peripheral                                                      */
  #define GPIO_PIN_CNF_CTRLSEL_ANTSWC (0x5UL)        /*!< ANTSWC peripheral                                                    */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                       GPIOHSPADCTRL                                       ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ================================================== Struct GPIOHSPADCTRL =================================================== */
/**
  * @brief GPIO high-speed pad control
  */
  typedef struct {                                   /*!< GPIOHSPADCTRL Structure                                              */
    __IM uint32_t RESERVED[12];
    __IOM uint32_t BIAS;                             /*!< (@ 0x00000030) Bias control                                          */
    __IOM uint32_t OVERRIDE;                         /*!< (@ 0x00000034) Override control                                      */
    __IOM uint32_t CTRL[2];                          /*!< (@ 0x00000038) Input sampling and buffering control (used by the
                                                                         MSPI0n peripheral)*/
  } NRF_GPIOHSPADCTRL_Type;                          /*!< Size = 64 (0x040)                                                    */

