NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* DATAENABLE @Bits 6..9 : Enable delayed sampling */
  #define GPIOHSPADCTRL_CTRL_DATAENABLE_Pos (6UL)    /*!< Position of DATAENABLE field.                                        */
  #define GPIOHSPADCTRL_CTRL_DATAENABLE_Msk (0xFUL << GPIOHSPADCTRL_CTRL_DATAENABLE_Pos) /*!< Bit mask of DATAENABLE field.    */
  #define GPIOHSPADCTRL_CTRL_DATAENABLE_Min (0x0UL)  /*!< Min enumerator value of DATAENABLE field.                            */
  #define GPIOHSPADCTRL_CTRL_DATAENABLE_Max (0xFUL)  /*!< Max enumerator value of DATAENABLE field.                            */
  #define GPIOHSPADCTRL_CTRL_DATAENABLE_Disabled (0x0UL) /*!< Delayed sampling is disabled                                     */
  #define GPIOHSPADCTRL_CTRL_DATAENABLE_Enabled (0xFUL) /*!< Delayed sampling is enabled                                       */

/* REPLICACLKLOAD @Bits 12..13 : Load capacitor used by replica clock pad */
  #define GPIOHSPADCTRL_CTRL_REPLICACLKLOAD_Pos (12UL) /*!< Position of REPLICACLKLOAD field.                                  */
  #define GPIOHSPADCTRL_CTRL_REPLICACLKLOAD_Msk (0x3UL << GPIOHSPADCTRL_CTRL_REPLICACLKLOAD_Pos) /*!< Bit mask of REPLICACLKLOAD
                                                                            field.*/
  #define GPIOHSPADCTRL_CTRL_REPLICACLKLOAD_Min (0x0UL) /*!< Min enumerator value of REPLICACLKLOAD field.                     */
  #define GPIOHSPADCTRL_CTRL_REPLICACLKLOAD_Max (0x3UL) /*!< Max enumerator value of REPLICACLKLOAD field.                     */
  #define GPIOHSPADCTRL_CTRL_REPLICACLKLOAD_Cap0p75 (0x0UL) /*!< Load capacitance of 0.75 pF                                   */
  #define GPIOHSPADCTRL_CTRL_REPLICACLKLOAD_Cap1p50 (0x1UL) /*!< Load capacitance of 1.5 pF                                    */
  #define GPIOHSPADCTRL_CTRL_REPLICACLKLOAD_Cap2p25 (0x2UL) /*!< Load capacitance of 2.25 pF                                   */
  #define GPIOHSPADCTRL_CTRL_REPLICACLKLOAD_Cap3p00 (0x3UL) /*!< Load capacitance of 3.0 pF                                    */

/* OUTPUTCPOL @Bit 14 : Serial clock (SCK) polarity for output data delay */
  #define GPIOHSPADCTRL_CTRL_OUTPUTCPOL_Pos (14UL)   /*!< Position of OUTPUTCPOL field.                                        */
  #define GPIOHSPADCTRL_CTRL_OUTPUTCPOL_Msk (0x1UL << GPIOHSPADCTRL_CTRL_OUTPUTCPOL_Pos) /*!< Bit mask of OUTPUTCPOL field.    */
  #define GPIOHSPADCTRL_CTRL_OUTPUTCPOL_Min (0x0UL)  /*!< Min enumerator value of OUTPUTCPOL field.                            */
  #define GPIOHSPADCTRL_CTRL_OUTPUTCPOL_Max (0x1UL)  /*!< Max enumerator value of OUTPUTCPOL field.                            */
  #define GPIOHSPADCTRL_CTRL_OUTPUTCPOL_ActiveHigh (0x0UL) /*!< Active high (idle state low)                                   */
  #define GPIOHSPADCTRL_CTRL_OUTPUTCPOL_ActiveLow (0x1UL) /*!< Active low (idle state high)                                    */

/* OUTPUTCHPA @Bit 15 : Serial clock (SCK) phase for output data delay */
  #define GPIOHSPADCTRL_CTRL_OUTPUTCHPA_Pos (15UL)   /*!< Position of OUTPUTCHPA field.                                        */
  #define GPIOHSPADCTRL_CTRL_OUTPUTCHPA_Msk (0x1UL << GPIOHSPADCTRL_CTRL_OUTPUTCHPA_Pos) /*!< Bit mask of OUTPUTCHPA field.    */
  #define GPIOHSPADCTRL_CTRL_OUTPUTCHPA_Min (0x0UL)  /*!< Min enumerator value of OUTPUTCHPA field.                            */
  #define GPIOHSPADCTRL_CTRL_OUTPUTCHPA_Max (0x1UL)  /*!< Max enumerator value of OUTPUTCHPA field.                            */
  #define GPIOHSPADCTRL_CTRL_OUTPUTCHPA_Leading (0x0UL) /*!< Sample on leading edge of clock                                   */
  #define GPIOHSPADCTRL_CTRL_OUTPUTCHPA_Trailing (0x1UL) /*!< Sample on trailing edge of clock                                 */

/* CSNPOL @Bit 16 : Chip Select (CSN) Polarity */
  #define GPIOHSPADCTRL_CTRL_CSNPOL_Pos (16UL)       /*!< Position of CSNPOL field.                                            */
  #define GPIOHSPADCTRL_CTRL_CSNPOL_Msk (0x1UL << GPIOHSPADCTRL_CTRL_CSNPOL_Pos) /*!< Bit mask of CSNPOL field.                */
  #define GPIOHSPADCTRL_CTRL_CSNPOL_Min (0x0UL)      /*!< Min enumerator value of CSNPOL field.                                */
  #define GPIOHSPADCTRL_CTRL_CSNPOL_Max (0x1UL)      /*!< Max enumerator value of CSNPOL field.                                */
  #define GPIOHSPADCTRL_CTRL_CSNPOL_LOW (0x0UL)      /*!< Active low (idle state high)                                         */
  #define GPIOHSPADCTRL_CTRL_CSNPOL_HIGH (0x1UL)     /*!< Active high (idle state low)                                         */

/* SCKFBPADEN @Bit 17 : Set IE/OE of the SCK feedback (FB) pad. This field needs to be set before SCKEN. */
  #define GPIOHSPADCTRL_CTRL_SCKFBPADEN_Pos (17UL)   /*!< Position of SCKFBPADEN field.                                        */
  #define GPIOHSPADCTRL_CTRL_SCKFBPADEN_Msk (0x1UL << GPIOHSPADCTRL_CTRL_SCKFBPADEN_Pos) /*!< Bit mask of SCKFBPADEN field.    */
  #define GPIOHSPADCTRL_CTRL_SCKFBPADEN_Min (0x0UL)  /*!< Min enumerator value of SCKFBPADEN field.                            */
  #define GPIOHSPADCTRL_CTRL_SCKFBPADEN_Max (0x1UL)  /*!< Max enumerator value of SCKFBPADEN field.                            */
  #define GPIOHSPADCTRL_CTRL_SCKFBPADEN_Disabled (0x0UL) /*!< FB pad IE/OE disabled                                            */
  #define GPIOHSPADCTRL_CTRL_SCKFBPADEN_Enabled (0x1UL) /*!< FB pad IE/OE enabled                                              */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                       GPIOINTERNAL                                       ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* =================================================== Struct GPIOINTERNAL =================================================== */
/**
  * @brief GPIO Internal
  */
  typedef struct {                                   /*!< GPIOINTERNAL Structure                                               */
    __IM uint32_t RESERVED;
  } NRF_GPIOINTERNAL_Type;                           /*!< Size = 4 (0x004)                                                     */

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          GPIOTE                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================ Struct GPIOTE_EVENTS_PORT ================================================ */
/**
  * @brief EVENTS_PORT [GPIOTE_EVENTS_PORT] Peripheral events.
  */
typedef struct {
  __IOM uint32_t  NONSECURE;                         /*!< (@ 0x00000000) Non-secure port event                                 */
  __IOM uint32_t  SECURE;                            /*!< (@ 0x00000004) Secure port event                                     */
} NRF_GPIOTE_EVENTS_PORT_Type;                       /*!< Size = 8 (0x008)                                                     */
