NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* COMPARE3 @Bit 3 : Write '1' to enable interrupt for event COMPARE[3] */
  #define GRTC_INTENSET5_COMPARE3_Pos (3UL)          /*!< Position of COMPARE3 field.                                          */
  #define GRTC_INTENSET5_COMPARE3_Msk (0x1UL << GRTC_INTENSET5_COMPARE3_Pos) /*!< Bit mask of COMPARE3 field.                  */
  #define GRTC_INTENSET5_COMPARE3_Min (0x0UL)        /*!< Min enumerator value of COMPARE3 field.                              */
  #define GRTC_INTENSET5_COMPARE3_Max (0x1UL)        /*!< Max enumerator value of COMPARE3 field.                              */
  #define GRTC_INTENSET5_COMPARE3_Set (0x1UL)        /*!< Enable                                                               */
  #define GRTC_INTENSET5_COMPARE3_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define GRTC_INTENSET5_COMPARE3_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* COMPARE4 @Bit 4 : Write '1' to enable interrupt for event COMPARE[4] */
  #define GRTC_INTENSET5_COMPARE4_Pos (4UL)          /*!< Position of COMPARE4 field.                                          */
  #define GRTC_INTENSET5_COMPARE4_Msk (0x1UL << GRTC_INTENSET5_COMPARE4_Pos) /*!< Bit mask of COMPARE4 field.                  */
  #define GRTC_INTENSET5_COMPARE4_Min (0x0UL)        /*!< Min enumerator value of COMPARE4 field.                              */
  #define GRTC_INTENSET5_COMPARE4_Max (0x1UL)        /*!< Max enumerator value of COMPARE4 field.                              */
  #define GRTC_INTENSET5_COMPARE4_Set (0x1UL)        /*!< Enable                                                               */
  #define GRTC_INTENSET5_COMPARE4_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define GRTC_INTENSET5_COMPARE4_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* COMPARE5 @Bit 5 : Write '1' to enable interrupt for event COMPARE[5] */
  #define GRTC_INTENSET5_COMPARE5_Pos (5UL)          /*!< Position of COMPARE5 field.                                          */
  #define GRTC_INTENSET5_COMPARE5_Msk (0x1UL << GRTC_INTENSET5_COMPARE5_Pos) /*!< Bit mask of COMPARE5 field.                  */
  #define GRTC_INTENSET5_COMPARE5_Min (0x0UL)        /*!< Min enumerator value of COMPARE5 field.                              */
  #define GRTC_INTENSET5_COMPARE5_Max (0x1UL)        /*!< Max enumerator value of COMPARE5 field.                              */
  #define GRTC_INTENSET5_COMPARE5_Set (0x1UL)        /*!< Enable                                                               */
  #define GRTC_INTENSET5_COMPARE5_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define GRTC_INTENSET5_COMPARE5_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* COMPARE6 @Bit 6 : Write '1' to enable interrupt for event COMPARE[6] */
  #define GRTC_INTENSET5_COMPARE6_Pos (6UL)          /*!< Position of COMPARE6 field.                                          */
  #define GRTC_INTENSET5_COMPARE6_Msk (0x1UL << GRTC_INTENSET5_COMPARE6_Pos) /*!< Bit mask of COMPARE6 field.                  */
  #define GRTC_INTENSET5_COMPARE6_Min (0x0UL)        /*!< Min enumerator value of COMPARE6 field.                              */
  #define GRTC_INTENSET5_COMPARE6_Max (0x1UL)        /*!< Max enumerator value of COMPARE6 field.                              */
  #define GRTC_INTENSET5_COMPARE6_Set (0x1UL)        /*!< Enable                                                               */
  #define GRTC_INTENSET5_COMPARE6_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define GRTC_INTENSET5_COMPARE6_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* COMPARE7 @Bit 7 : Write '1' to enable interrupt for event COMPARE[7] */
  #define GRTC_INTENSET5_COMPARE7_Pos (7UL)          /*!< Position of COMPARE7 field.                                          */
  #define GRTC_INTENSET5_COMPARE7_Msk (0x1UL << GRTC_INTENSET5_COMPARE7_Pos) /*!< Bit mask of COMPARE7 field.                  */
  #define GRTC_INTENSET5_COMPARE7_Min (0x0UL)        /*!< Min enumerator value of COMPARE7 field.                              */
  #define GRTC_INTENSET5_COMPARE7_Max (0x1UL)        /*!< Max enumerator value of COMPARE7 field.                              */
  #define GRTC_INTENSET5_COMPARE7_Set (0x1UL)        /*!< Enable                                                               */
  #define GRTC_INTENSET5_COMPARE7_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define GRTC_INTENSET5_COMPARE7_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* COMPARE8 @Bit 8 : Write '1' to enable interrupt for event COMPARE[8] */
  #define GRTC_INTENSET5_COMPARE8_Pos (8UL)          /*!< Position of COMPARE8 field.                                          */
  #define GRTC_INTENSET5_COMPARE8_Msk (0x1UL << GRTC_INTENSET5_COMPARE8_Pos) /*!< Bit mask of COMPARE8 field.                  */
  #define GRTC_INTENSET5_COMPARE8_Min (0x0UL)        /*!< Min enumerator value of COMPARE8 field.                              */
  #define GRTC_INTENSET5_COMPARE8_Max (0x1UL)        /*!< Max enumerator value of COMPARE8 field.                              */
  #define GRTC_INTENSET5_COMPARE8_Set (0x1UL)        /*!< Enable                                                               */
  #define GRTC_INTENSET5_COMPARE8_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define GRTC_INTENSET5_COMPARE8_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* COMPARE9 @Bit 9 : Write '1' to enable interrupt for event COMPARE[9] */
  #define GRTC_INTENSET5_COMPARE9_Pos (9UL)          /*!< Position of COMPARE9 field.                                          */
  #define GRTC_INTENSET5_COMPARE9_Msk (0x1UL << GRTC_INTENSET5_COMPARE9_Pos) /*!< Bit mask of COMPARE9 field.                  */
  #define GRTC_INTENSET5_COMPARE9_Min (0x0UL)        /*!< Min enumerator value of COMPARE9 field.                              */
  #define GRTC_INTENSET5_COMPARE9_Max (0x1UL)        /*!< Max enumerator value of COMPARE9 field.                              */
  #define GRTC_INTENSET5_COMPARE9_Set (0x1UL)        /*!< Enable                                                               */
  #define GRTC_INTENSET5_COMPARE9_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define GRTC_INTENSET5_COMPARE9_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

