NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* EVENTS_STOPREQ @Bit 0 : Clock stop has been requested */
  #define HFXO64M_EVENTS_STOPREQ_EVENTS_STOPREQ_Pos (0UL) /*!< Position of EVENTS_STOPREQ field.                               */
  #define HFXO64M_EVENTS_STOPREQ_EVENTS_STOPREQ_Msk (0x1UL << HFXO64M_EVENTS_STOPREQ_EVENTS_STOPREQ_Pos) /*!< Bit mask of
                                                                            EVENTS_STOPREQ field.*/
  #define HFXO64M_EVENTS_STOPREQ_EVENTS_STOPREQ_Min (0x0UL) /*!< Min enumerator value of EVENTS_STOPREQ field.                 */
  #define HFXO64M_EVENTS_STOPREQ_EVENTS_STOPREQ_Max (0x1UL) /*!< Max enumerator value of EVENTS_STOPREQ field.                 */
  #define HFXO64M_EVENTS_STOPREQ_EVENTS_STOPREQ_NotGenerated (0x0UL) /*!< Event not generated                                  */
  #define HFXO64M_EVENTS_STOPREQ_EVENTS_STOPREQ_Generated (0x1UL) /*!< Event generated                                         */


/* HFXO64M_INTEN: Enable or disable interrupt */
  #define HFXO64M_INTEN_ResetValue (0x00000000UL)    /*!< Reset value of INTEN register.                                       */

/* STARTED @Bit 0 : Enable or disable interrupt for event STARTED */
  #define HFXO64M_INTEN_STARTED_Pos (0UL)            /*!< Position of STARTED field.                                           */
  #define HFXO64M_INTEN_STARTED_Msk (0x1UL << HFXO64M_INTEN_STARTED_Pos) /*!< Bit mask of STARTED field.                       */
  #define HFXO64M_INTEN_STARTED_Min (0x0UL)          /*!< Min enumerator value of STARTED field.                               */
  #define HFXO64M_INTEN_STARTED_Max (0x1UL)          /*!< Max enumerator value of STARTED field.                               */
  #define HFXO64M_INTEN_STARTED_Disabled (0x0UL)     /*!< Disable                                                              */
  #define HFXO64M_INTEN_STARTED_Enabled (0x1UL)      /*!< Enable                                                               */

/* STOPPED @Bit 1 : Enable or disable interrupt for event STOPPED */
  #define HFXO64M_INTEN_STOPPED_Pos (1UL)            /*!< Position of STOPPED field.                                           */
  #define HFXO64M_INTEN_STOPPED_Msk (0x1UL << HFXO64M_INTEN_STOPPED_Pos) /*!< Bit mask of STOPPED field.                       */
  #define HFXO64M_INTEN_STOPPED_Min (0x0UL)          /*!< Min enumerator value of STOPPED field.                               */
  #define HFXO64M_INTEN_STOPPED_Max (0x1UL)          /*!< Max enumerator value of STOPPED field.                               */
  #define HFXO64M_INTEN_STOPPED_Disabled (0x0UL)     /*!< Disable                                                              */
  #define HFXO64M_INTEN_STOPPED_Enabled (0x1UL)      /*!< Enable                                                               */

/* ERRORBIAS @Bit 2 : Enable or disable interrupt for event ERRORBIAS */
  #define HFXO64M_INTEN_ERRORBIAS_Pos (2UL)          /*!< Position of ERRORBIAS field.                                         */
  #define HFXO64M_INTEN_ERRORBIAS_Msk (0x1UL << HFXO64M_INTEN_ERRORBIAS_Pos) /*!< Bit mask of ERRORBIAS field.                 */
  #define HFXO64M_INTEN_ERRORBIAS_Min (0x0UL)        /*!< Min enumerator value of ERRORBIAS field.                             */
  #define HFXO64M_INTEN_ERRORBIAS_Max (0x1UL)        /*!< Max enumerator value of ERRORBIAS field.                             */
  #define HFXO64M_INTEN_ERRORBIAS_Disabled (0x0UL)   /*!< Disable                                                              */
  #define HFXO64M_INTEN_ERRORBIAS_Enabled (0x1UL)    /*!< Enable                                                               */

/* ERRORDETECTOR @Bit 3 : Enable or disable interrupt for event ERRORDETECTOR */
  #define HFXO64M_INTEN_ERRORDETECTOR_Pos (3UL)      /*!< Position of ERRORDETECTOR field.                                     */
  #define HFXO64M_INTEN_ERRORDETECTOR_Msk (0x1UL << HFXO64M_INTEN_ERRORDETECTOR_Pos) /*!< Bit mask of ERRORDETECTOR field.     */
  #define HFXO64M_INTEN_ERRORDETECTOR_Min (0x0UL)    /*!< Min enumerator value of ERRORDETECTOR field.                         */
  #define HFXO64M_INTEN_ERRORDETECTOR_Max (0x1UL)    /*!< Max enumerator value of ERRORDETECTOR field.                         */
  #define HFXO64M_INTEN_ERRORDETECTOR_Disabled (0x0UL) /*!< Disable                                                            */
  #define HFXO64M_INTEN_ERRORDETECTOR_Enabled (0x1UL) /*!< Enable                                                              */

/* ERRORTCXO @Bit 4 : Enable or disable interrupt for event ERRORTCXO */
  #define HFXO64M_INTEN_ERRORTCXO_Pos (4UL)          /*!< Position of ERRORTCXO field.                                         */
  #define HFXO64M_INTEN_ERRORTCXO_Msk (0x1UL << HFXO64M_INTEN_ERRORTCXO_Pos) /*!< Bit mask of ERRORTCXO field.                 */
  #define HFXO64M_INTEN_ERRORTCXO_Min (0x0UL)        /*!< Min enumerator value of ERRORTCXO field.                             */
  #define HFXO64M_INTEN_ERRORTCXO_Max (0x1UL)        /*!< Max enumerator value of ERRORTCXO field.                             */
  #define HFXO64M_INTEN_ERRORTCXO_Disabled (0x0UL)   /*!< Disable                                                              */
  #define HFXO64M_INTEN_ERRORTCXO_Enabled (0x1UL)    /*!< Enable                                                               */

/* STARTREQ @Bit 5 : Enable or disable interrupt for event STARTREQ */
  #define HFXO64M_INTEN_STARTREQ_Pos (5UL)           /*!< Position of STARTREQ field.                                          */
  #define HFXO64M_INTEN_STARTREQ_Msk (0x1UL << HFXO64M_INTEN_STARTREQ_Pos) /*!< Bit mask of STARTREQ field.                    */
  #define HFXO64M_INTEN_STARTREQ_Min (0x0UL)         /*!< Min enumerator value of STARTREQ field.                              */
  #define HFXO64M_INTEN_STARTREQ_Max (0x1UL)         /*!< Max enumerator value of STARTREQ field.                              */
  #define HFXO64M_INTEN_STARTREQ_Disabled (0x0UL)    /*!< Disable                                                              */
  #define HFXO64M_INTEN_STARTREQ_Enabled (0x1UL)     /*!< Enable                                                               */

/* STOPREQ @Bit 6 : Enable or disable interrupt for event STOPREQ */
  #define HFXO64M_INTEN_STOPREQ_Pos (6UL)            /*!< Position of STOPREQ field.                                           */
  #define HFXO64M_INTEN_STOPREQ_Msk (0x1UL << HFXO64M_INTEN_STOPREQ_Pos) /*!< Bit mask of STOPREQ field.                       */
  #define HFXO64M_INTEN_STOPREQ_Min (0x0UL)          /*!< Min enumerator value of STOPREQ field.                               */
  #define HFXO64M_INTEN_STOPREQ_Max (0x1UL)          /*!< Max enumerator value of STOPREQ field.                               */
  #define HFXO64M_INTEN_STOPREQ_Disabled (0x0UL)     /*!< Disable                                                              */
  #define HFXO64M_INTEN_STOPREQ_Enabled (0x1UL)      /*!< Enable                                                               */


/* HFXO64M_INTENSET: Enable interrupt */
  #define HFXO64M_INTENSET_ResetValue (0x00000000UL) /*!< Reset value of INTENSET register.                                    */

/* STARTED @Bit 0 : Write '1' to enable interrupt for event STARTED */
  #define HFXO64M_INTENSET_STARTED_Pos (0UL)         /*!< Position of STARTED field.                                           */
  #define HFXO64M_INTENSET_STARTED_Msk (0x1UL << HFXO64M_INTENSET_STARTED_Pos) /*!< Bit mask of STARTED field.                 */
  #define HFXO64M_INTENSET_STARTED_Min (0x0UL)       /*!< Min enumerator value of STARTED field.                               */
  #define HFXO64M_INTENSET_STARTED_Max (0x1UL)       /*!< Max enumerator value of STARTED field.                               */
  #define HFXO64M_INTENSET_STARTED_Set (0x1UL)       /*!< Enable                                                               */
  #define HFXO64M_INTENSET_STARTED_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define HFXO64M_INTENSET_STARTED_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* STOPPED @Bit 1 : Write '1' to enable interrupt for event STOPPED */
  #define HFXO64M_INTENSET_STOPPED_Pos (1UL)         /*!< Position of STOPPED field.                                           */
  #define HFXO64M_INTENSET_STOPPED_Msk (0x1UL << HFXO64M_INTENSET_STOPPED_Pos) /*!< Bit mask of STOPPED field.                 */
  #define HFXO64M_INTENSET_STOPPED_Min (0x0UL)       /*!< Min enumerator value of STOPPED field.                               */
  #define HFXO64M_INTENSET_STOPPED_Max (0x1UL)       /*!< Max enumerator value of STOPPED field.                               */
  #define HFXO64M_INTENSET_STOPPED_Set (0x1UL)       /*!< Enable                                                               */
  #define HFXO64M_INTENSET_STOPPED_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define HFXO64M_INTENSET_STOPPED_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

