NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* IPCT_PUBLISH_RECEIVE: Publish configuration for event RECEIVE[n] */
  #define IPCT_PUBLISH_RECEIVE_MaxCount (4UL)        /*!< Max size of PUBLISH_RECEIVE[4] array.                                */
  #define IPCT_PUBLISH_RECEIVE_MaxIndex (3UL)        /*!< Max index of PUBLISH_RECEIVE[4] array.                               */
  #define IPCT_PUBLISH_RECEIVE_MinIndex (0UL)        /*!< Min index of PUBLISH_RECEIVE[4] array.                               */
  #define IPCT_PUBLISH_RECEIVE_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_RECEIVE[4] register.                      */

/* CHIDX @Bits 0..7 : DPPI channel that event RECEIVE[n] will publish to */
  #define IPCT_PUBLISH_RECEIVE_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define IPCT_PUBLISH_RECEIVE_CHIDX_Msk (0xFFUL << IPCT_PUBLISH_RECEIVE_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define IPCT_PUBLISH_RECEIVE_CHIDX_Min (0x00UL)    /*!< Min value of CHIDX field.                                            */
  #define IPCT_PUBLISH_RECEIVE_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define IPCT_PUBLISH_RECEIVE_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define IPCT_PUBLISH_RECEIVE_EN_Msk (0x1UL << IPCT_PUBLISH_RECEIVE_EN_Pos) /*!< Bit mask of EN field.                        */
  #define IPCT_PUBLISH_RECEIVE_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define IPCT_PUBLISH_RECEIVE_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define IPCT_PUBLISH_RECEIVE_EN_Disabled (0x0UL)   /*!< Disable publishing                                                   */
  #define IPCT_PUBLISH_RECEIVE_EN_Enabled (0x1UL)    /*!< Enable publishing                                                    */


/* IPCT_PUBLISH_READY: Publish configuration for event READY[n] */
  #define IPCT_PUBLISH_READY_MaxCount (4UL)          /*!< Max size of PUBLISH_READY[4] array.                                  */
  #define IPCT_PUBLISH_READY_MaxIndex (3UL)          /*!< Max index of PUBLISH_READY[4] array.                                 */
  #define IPCT_PUBLISH_READY_MinIndex (0UL)          /*!< Min index of PUBLISH_READY[4] array.                                 */
  #define IPCT_PUBLISH_READY_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_READY[4] register.                          */

/* CHIDX @Bits 0..7 : DPPI channel that event READY[n] will publish to */
  #define IPCT_PUBLISH_READY_CHIDX_Pos (0UL)         /*!< Position of CHIDX field.                                             */
  #define IPCT_PUBLISH_READY_CHIDX_Msk (0xFFUL << IPCT_PUBLISH_READY_CHIDX_Pos) /*!< Bit mask of CHIDX field.                  */
  #define IPCT_PUBLISH_READY_CHIDX_Min (0x00UL)      /*!< Min value of CHIDX field.                                            */
  #define IPCT_PUBLISH_READY_CHIDX_Max (0xFFUL)      /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define IPCT_PUBLISH_READY_EN_Pos (31UL)           /*!< Position of EN field.                                                */
  #define IPCT_PUBLISH_READY_EN_Msk (0x1UL << IPCT_PUBLISH_READY_EN_Pos) /*!< Bit mask of EN field.                            */
  #define IPCT_PUBLISH_READY_EN_Min (0x0UL)          /*!< Min enumerator value of EN field.                                    */
  #define IPCT_PUBLISH_READY_EN_Max (0x1UL)          /*!< Max enumerator value of EN field.                                    */
  #define IPCT_PUBLISH_READY_EN_Disabled (0x0UL)     /*!< Disable publishing                                                   */
  #define IPCT_PUBLISH_READY_EN_Enabled (0x1UL)      /*!< Enable publishing                                                    */


/* IPCT_SHORTS: Shortcuts between local events and tasks */
  #define IPCT_SHORTS_ResetValue (0x00000000UL)      /*!< Reset value of SHORTS register.                                      */

/* RECEIVE0_FLUSH0 @Bit 0 : Shortcut between event RECEIVE[0] and task FLUSH[0] */
  #define IPCT_SHORTS_RECEIVE0_FLUSH0_Pos (0UL)      /*!< Position of RECEIVE0_FLUSH0 field.                                   */
  #define IPCT_SHORTS_RECEIVE0_FLUSH0_Msk (0x1UL << IPCT_SHORTS_RECEIVE0_FLUSH0_Pos) /*!< Bit mask of RECEIVE0_FLUSH0 field.   */
  #define IPCT_SHORTS_RECEIVE0_FLUSH0_Min (0x0UL)    /*!< Min enumerator value of RECEIVE0_FLUSH0 field.                       */
  #define IPCT_SHORTS_RECEIVE0_FLUSH0_Max (0x1UL)    /*!< Max enumerator value of RECEIVE0_FLUSH0 field.                       */
  #define IPCT_SHORTS_RECEIVE0_FLUSH0_Disabled (0x0UL) /*!< Disable shortcut                                                   */
  #define IPCT_SHORTS_RECEIVE0_FLUSH0_Enabled (0x1UL) /*!< Enable shortcut                                                     */

/* RECEIVE1_FLUSH1 @Bit 1 : Shortcut between event RECEIVE[1] and task FLUSH[1] */
  #define IPCT_SHORTS_RECEIVE1_FLUSH1_Pos (1UL)      /*!< Position of RECEIVE1_FLUSH1 field.                                   */
  #define IPCT_SHORTS_RECEIVE1_FLUSH1_Msk (0x1UL << IPCT_SHORTS_RECEIVE1_FLUSH1_Pos) /*!< Bit mask of RECEIVE1_FLUSH1 field.   */
  #define IPCT_SHORTS_RECEIVE1_FLUSH1_Min (0x0UL)    /*!< Min enumerator value of RECEIVE1_FLUSH1 field.                       */
  #define IPCT_SHORTS_RECEIVE1_FLUSH1_Max (0x1UL)    /*!< Max enumerator value of RECEIVE1_FLUSH1 field.                       */
  #define IPCT_SHORTS_RECEIVE1_FLUSH1_Disabled (0x0UL) /*!< Disable shortcut                                                   */
  #define IPCT_SHORTS_RECEIVE1_FLUSH1_Enabled (0x1UL) /*!< Enable shortcut                                                     */

/* RECEIVE2_FLUSH2 @Bit 2 : Shortcut between event RECEIVE[2] and task FLUSH[2] */
  #define IPCT_SHORTS_RECEIVE2_FLUSH2_Pos (2UL)      /*!< Position of RECEIVE2_FLUSH2 field.                                   */
  #define IPCT_SHORTS_RECEIVE2_FLUSH2_Msk (0x1UL << IPCT_SHORTS_RECEIVE2_FLUSH2_Pos) /*!< Bit mask of RECEIVE2_FLUSH2 field.   */
  #define IPCT_SHORTS_RECEIVE2_FLUSH2_Min (0x0UL)    /*!< Min enumerator value of RECEIVE2_FLUSH2 field.                       */
  #define IPCT_SHORTS_RECEIVE2_FLUSH2_Max (0x1UL)    /*!< Max enumerator value of RECEIVE2_FLUSH2 field.                       */
  #define IPCT_SHORTS_RECEIVE2_FLUSH2_Disabled (0x0UL) /*!< Disable shortcut                                                   */
  #define IPCT_SHORTS_RECEIVE2_FLUSH2_Enabled (0x1UL) /*!< Enable shortcut                                                     */

/* RECEIVE3_FLUSH3 @Bit 3 : Shortcut between event RECEIVE[3] and task FLUSH[3] */
  #define IPCT_SHORTS_RECEIVE3_FLUSH3_Pos (3UL)      /*!< Position of RECEIVE3_FLUSH3 field.                                   */
  #define IPCT_SHORTS_RECEIVE3_FLUSH3_Msk (0x1UL << IPCT_SHORTS_RECEIVE3_FLUSH3_Pos) /*!< Bit mask of RECEIVE3_FLUSH3 field.   */
  #define IPCT_SHORTS_RECEIVE3_FLUSH3_Min (0x0UL)    /*!< Min enumerator value of RECEIVE3_FLUSH3 field.                       */
  #define IPCT_SHORTS_RECEIVE3_FLUSH3_Max (0x1UL)    /*!< Max enumerator value of RECEIVE3_FLUSH3 field.                       */
  #define IPCT_SHORTS_RECEIVE3_FLUSH3_Disabled (0x0UL) /*!< Disable shortcut                                                   */
  #define IPCT_SHORTS_RECEIVE3_FLUSH3_Enabled (0x1UL) /*!< Enable shortcut                                                     */


/* IPCT_INTEN0: Enable or disable interrupt */
  #define IPCT_INTEN0_ResetValue (0x00000000UL)      /*!< Reset value of INTEN0 register.                                      */

/* RECEIVE0 @Bit 0 : Enable or disable interrupt for event RECEIVE[0] */
  #define IPCT_INTEN0_RECEIVE0_Pos (0UL)             /*!< Position of RECEIVE0 field.                                          */
  #define IPCT_INTEN0_RECEIVE0_Msk (0x1UL << IPCT_INTEN0_RECEIVE0_Pos) /*!< Bit mask of RECEIVE0 field.                        */
  #define IPCT_INTEN0_RECEIVE0_Min (0x0UL)           /*!< Min enumerator value of RECEIVE0 field.                              */
  #define IPCT_INTEN0_RECEIVE0_Max (0x1UL)           /*!< Max enumerator value of RECEIVE0 field.                              */
  #define IPCT_INTEN0_RECEIVE0_Disabled (0x0UL)      /*!< Disable                                                              */
  #define IPCT_INTEN0_RECEIVE0_Enabled (0x1UL)       /*!< Enable                                                               */

/* RECEIVE1 @Bit 1 : Enable or disable interrupt for event RECEIVE[1] */
  #define IPCT_INTEN0_RECEIVE1_Pos (1UL)             /*!< Position of RECEIVE1 field.                                          */
  #define IPCT_INTEN0_RECEIVE1_Msk (0x1UL << IPCT_INTEN0_RECEIVE1_Pos) /*!< Bit mask of RECEIVE1 field.                        */
  #define IPCT_INTEN0_RECEIVE1_Min (0x0UL)           /*!< Min enumerator value of RECEIVE1 field.                              */
  #define IPCT_INTEN0_RECEIVE1_Max (0x1UL)           /*!< Max enumerator value of RECEIVE1 field.                              */
  #define IPCT_INTEN0_RECEIVE1_Disabled (0x0UL)      /*!< Disable                                                              */
  #define IPCT_INTEN0_RECEIVE1_Enabled (0x1UL)       /*!< Enable                                                               */

/* RECEIVE2 @Bit 2 : Enable or disable interrupt for event RECEIVE[2] */
  #define IPCT_INTEN0_RECEIVE2_Pos (2UL)             /*!< Position of RECEIVE2 field.                                          */
  #define IPCT_INTEN0_RECEIVE2_Msk (0x1UL << IPCT_INTEN0_RECEIVE2_Pos) /*!< Bit mask of RECEIVE2 field.                        */
  #define IPCT_INTEN0_RECEIVE2_Min (0x0UL)           /*!< Min enumerator value of RECEIVE2 field.                              */
  #define IPCT_INTEN0_RECEIVE2_Max (0x1UL)           /*!< Max enumerator value of RECEIVE2 field.                              */
  #define IPCT_INTEN0_RECEIVE2_Disabled (0x0UL)      /*!< Disable                                                              */
  #define IPCT_INTEN0_RECEIVE2_Enabled (0x1UL)       /*!< Enable                                                               */

/* RECEIVE3 @Bit 3 : Enable or disable interrupt for event RECEIVE[3] */
  #define IPCT_INTEN0_RECEIVE3_Pos (3UL)             /*!< Position of RECEIVE3 field.                                          */
  #define IPCT_INTEN0_RECEIVE3_Msk (0x1UL << IPCT_INTEN0_RECEIVE3_Pos) /*!< Bit mask of RECEIVE3 field.                        */
  #define IPCT_INTEN0_RECEIVE3_Min (0x0UL)           /*!< Min enumerator value of RECEIVE3 field.                              */
  #define IPCT_INTEN0_RECEIVE3_Max (0x1UL)           /*!< Max enumerator value of RECEIVE3 field.                              */
  #define IPCT_INTEN0_RECEIVE3_Disabled (0x0UL)      /*!< Disable                                                              */
  #define IPCT_INTEN0_RECEIVE3_Enabled (0x1UL)       /*!< Enable                                                               */

/* READY0 @Bit 16 : Enable or disable interrupt for event READY[0] */
  #define IPCT_INTEN0_READY0_Pos (16UL)              /*!< Position of READY0 field.                                            */
  #define IPCT_INTEN0_READY0_Msk (0x1UL << IPCT_INTEN0_READY0_Pos) /*!< Bit mask of READY0 field.                              */
  #define IPCT_INTEN0_READY0_Min (0x0UL)             /*!< Min enumerator value of READY0 field.                                */
  #define IPCT_INTEN0_READY0_Max (0x1UL)             /*!< Max enumerator value of READY0 field.                                */
  #define IPCT_INTEN0_READY0_Disabled (0x0UL)        /*!< Disable                                                              */
  #define IPCT_INTEN0_READY0_Enabled (0x1UL)         /*!< Enable                                                               */

