NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* MODECHANGED @Bit 0 : Enable or disable interrupt for event MODECHANGED */
  #define LFXO_INTEN_MODECHANGED_Pos (0UL)           /*!< Position of MODECHANGED field.                                       */
  #define LFXO_INTEN_MODECHANGED_Msk (0x1UL << LFXO_INTEN_MODECHANGED_Pos) /*!< Bit mask of MODECHANGED field.                 */
  #define LFXO_INTEN_MODECHANGED_Min (0x0UL)         /*!< Min enumerator value of MODECHANGED field.                           */
  #define LFXO_INTEN_MODECHANGED_Max (0x1UL)         /*!< Max enumerator value of MODECHANGED field.                           */
  #define LFXO_INTEN_MODECHANGED_Disabled (0x0UL)    /*!< Disable                                                              */
  #define LFXO_INTEN_MODECHANGED_Enabled (0x1UL)     /*!< Enable                                                               */

/* ERRORSTARTING @Bit 1 : Enable or disable interrupt for event ERRORSTARTING */
  #define LFXO_INTEN_ERRORSTARTING_Pos (1UL)         /*!< Position of ERRORSTARTING field.                                     */
  #define LFXO_INTEN_ERRORSTARTING_Msk (0x1UL << LFXO_INTEN_ERRORSTARTING_Pos) /*!< Bit mask of ERRORSTARTING field.           */
  #define LFXO_INTEN_ERRORSTARTING_Min (0x0UL)       /*!< Min enumerator value of ERRORSTARTING field.                         */
  #define LFXO_INTEN_ERRORSTARTING_Max (0x1UL)       /*!< Max enumerator value of ERRORSTARTING field.                         */
  #define LFXO_INTEN_ERRORSTARTING_Disabled (0x0UL)  /*!< Disable                                                              */
  #define LFXO_INTEN_ERRORSTARTING_Enabled (0x1UL)   /*!< Enable                                                               */

/* ERRORRUNNING @Bit 2 : Enable or disable interrupt for event ERRORRUNNING */
  #define LFXO_INTEN_ERRORRUNNING_Pos (2UL)          /*!< Position of ERRORRUNNING field.                                      */
  #define LFXO_INTEN_ERRORRUNNING_Msk (0x1UL << LFXO_INTEN_ERRORRUNNING_Pos) /*!< Bit mask of ERRORRUNNING field.              */
  #define LFXO_INTEN_ERRORRUNNING_Min (0x0UL)        /*!< Min enumerator value of ERRORRUNNING field.                          */
  #define LFXO_INTEN_ERRORRUNNING_Max (0x1UL)        /*!< Max enumerator value of ERRORRUNNING field.                          */
  #define LFXO_INTEN_ERRORRUNNING_Disabled (0x0UL)   /*!< Disable                                                              */
  #define LFXO_INTEN_ERRORRUNNING_Enabled (0x1UL)    /*!< Enable                                                               */


/* LFXO_INTENSET: Enable interrupt */
  #define LFXO_INTENSET_ResetValue (0x00000000UL)    /*!< Reset value of INTENSET register.                                    */

/* MODECHANGED @Bit 0 : Write '1' to enable interrupt for event MODECHANGED */
  #define LFXO_INTENSET_MODECHANGED_Pos (0UL)        /*!< Position of MODECHANGED field.                                       */
  #define LFXO_INTENSET_MODECHANGED_Msk (0x1UL << LFXO_INTENSET_MODECHANGED_Pos) /*!< Bit mask of MODECHANGED field.           */
  #define LFXO_INTENSET_MODECHANGED_Min (0x0UL)      /*!< Min enumerator value of MODECHANGED field.                           */
  #define LFXO_INTENSET_MODECHANGED_Max (0x1UL)      /*!< Max enumerator value of MODECHANGED field.                           */
  #define LFXO_INTENSET_MODECHANGED_Set (0x1UL)      /*!< Enable                                                               */
  #define LFXO_INTENSET_MODECHANGED_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define LFXO_INTENSET_MODECHANGED_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* ERRORSTARTING @Bit 1 : Write '1' to enable interrupt for event ERRORSTARTING */
  #define LFXO_INTENSET_ERRORSTARTING_Pos (1UL)      /*!< Position of ERRORSTARTING field.                                     */
  #define LFXO_INTENSET_ERRORSTARTING_Msk (0x1UL << LFXO_INTENSET_ERRORSTARTING_Pos) /*!< Bit mask of ERRORSTARTING field.     */
  #define LFXO_INTENSET_ERRORSTARTING_Min (0x0UL)    /*!< Min enumerator value of ERRORSTARTING field.                         */
  #define LFXO_INTENSET_ERRORSTARTING_Max (0x1UL)    /*!< Max enumerator value of ERRORSTARTING field.                         */
  #define LFXO_INTENSET_ERRORSTARTING_Set (0x1UL)    /*!< Enable                                                               */
  #define LFXO_INTENSET_ERRORSTARTING_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define LFXO_INTENSET_ERRORSTARTING_Enabled (0x1UL) /*!< Read: Enabled                                                       */

/* ERRORRUNNING @Bit 2 : Write '1' to enable interrupt for event ERRORRUNNING */
  #define LFXO_INTENSET_ERRORRUNNING_Pos (2UL)       /*!< Position of ERRORRUNNING field.                                      */
  #define LFXO_INTENSET_ERRORRUNNING_Msk (0x1UL << LFXO_INTENSET_ERRORRUNNING_Pos) /*!< Bit mask of ERRORRUNNING field.        */
  #define LFXO_INTENSET_ERRORRUNNING_Min (0x0UL)     /*!< Min enumerator value of ERRORRUNNING field.                          */
  #define LFXO_INTENSET_ERRORRUNNING_Max (0x1UL)     /*!< Max enumerator value of ERRORRUNNING field.                          */
  #define LFXO_INTENSET_ERRORRUNNING_Set (0x1UL)     /*!< Enable                                                               */
  #define LFXO_INTENSET_ERRORRUNNING_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define LFXO_INTENSET_ERRORRUNNING_Enabled (0x1UL) /*!< Read: Enabled                                                        */


/* LFXO_INTENCLR: Disable interrupt */
  #define LFXO_INTENCLR_ResetValue (0x00000000UL)    /*!< Reset value of INTENCLR register.                                    */

/* MODECHANGED @Bit 0 : Write '1' to disable interrupt for event MODECHANGED */
  #define LFXO_INTENCLR_MODECHANGED_Pos (0UL)        /*!< Position of MODECHANGED field.                                       */
  #define LFXO_INTENCLR_MODECHANGED_Msk (0x1UL << LFXO_INTENCLR_MODECHANGED_Pos) /*!< Bit mask of MODECHANGED field.           */
  #define LFXO_INTENCLR_MODECHANGED_Min (0x0UL)      /*!< Min enumerator value of MODECHANGED field.                           */
  #define LFXO_INTENCLR_MODECHANGED_Max (0x1UL)      /*!< Max enumerator value of MODECHANGED field.                           */
  #define LFXO_INTENCLR_MODECHANGED_Clear (0x1UL)    /*!< Disable                                                              */
  #define LFXO_INTENCLR_MODECHANGED_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define LFXO_INTENCLR_MODECHANGED_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* ERRORSTARTING @Bit 1 : Write '1' to disable interrupt for event ERRORSTARTING */
  #define LFXO_INTENCLR_ERRORSTARTING_Pos (1UL)      /*!< Position of ERRORSTARTING field.                                     */
  #define LFXO_INTENCLR_ERRORSTARTING_Msk (0x1UL << LFXO_INTENCLR_ERRORSTARTING_Pos) /*!< Bit mask of ERRORSTARTING field.     */
  #define LFXO_INTENCLR_ERRORSTARTING_Min (0x0UL)    /*!< Min enumerator value of ERRORSTARTING field.                         */
  #define LFXO_INTENCLR_ERRORSTARTING_Max (0x1UL)    /*!< Max enumerator value of ERRORSTARTING field.                         */
  #define LFXO_INTENCLR_ERRORSTARTING_Clear (0x1UL)  /*!< Disable                                                              */
  #define LFXO_INTENCLR_ERRORSTARTING_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define LFXO_INTENCLR_ERRORSTARTING_Enabled (0x1UL) /*!< Read: Enabled                                                       */

/* ERRORRUNNING @Bit 2 : Write '1' to disable interrupt for event ERRORRUNNING */
  #define LFXO_INTENCLR_ERRORRUNNING_Pos (2UL)       /*!< Position of ERRORRUNNING field.                                      */
  #define LFXO_INTENCLR_ERRORRUNNING_Msk (0x1UL << LFXO_INTENCLR_ERRORRUNNING_Pos) /*!< Bit mask of ERRORRUNNING field.        */
  #define LFXO_INTENCLR_ERRORRUNNING_Min (0x0UL)     /*!< Min enumerator value of ERRORRUNNING field.                          */
  #define LFXO_INTENCLR_ERRORRUNNING_Max (0x1UL)     /*!< Max enumerator value of ERRORRUNNING field.                          */
  #define LFXO_INTENCLR_ERRORRUNNING_Clear (0x1UL)   /*!< Disable                                                              */
  #define LFXO_INTENCLR_ERRORRUNNING_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define LFXO_INTENCLR_ERRORRUNNING_Enabled (0x1UL) /*!< Read: Enabled                                                        */


