NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* SECATTR @Bit 3 : Security mapping */
  #define MPC_OVERRIDE_PERM_SECATTR_Pos (3UL)        /*!< Position of SECATTR field.                                           */
  #define MPC_OVERRIDE_PERM_SECATTR_Msk (0x1UL << MPC_OVERRIDE_PERM_SECATTR_Pos) /*!< Bit mask of SECATTR field.               */
  #define MPC_OVERRIDE_PERM_SECATTR_Min (0x0UL)      /*!< Min enumerator value of SECATTR field.                               */
  #define MPC_OVERRIDE_PERM_SECATTR_Max (0x1UL)      /*!< Max enumerator value of SECATTR field.                               */
  #define MPC_OVERRIDE_PERM_SECATTR_Secure (0x1UL)   /*!< Override region n is mapped in secure memory address space           */
  #define MPC_OVERRIDE_PERM_SECATTR_NonSecure (0x0UL) /*!< Override region n is mapped in non-secure memory address space      */

/* PRIVL @Bit 4 : Privileged access */
  #define MPC_OVERRIDE_PERM_PRIVL_Pos (4UL)          /*!< Position of PRIVL field.                                             */
  #define MPC_OVERRIDE_PERM_PRIVL_Msk (0x1UL << MPC_OVERRIDE_PERM_PRIVL_Pos) /*!< Bit mask of PRIVL field.                     */
  #define MPC_OVERRIDE_PERM_PRIVL_Min (0x0UL)        /*!< Min enumerator value of PRIVL field.                                 */
  #define MPC_OVERRIDE_PERM_PRIVL_Max (0x1UL)        /*!< Max enumerator value of PRIVL field.                                 */
  #define MPC_OVERRIDE_PERM_PRIVL_Privileged (0x1UL) /*!< Privileged access only                                               */
  #define MPC_OVERRIDE_PERM_PRIVL_Unprivileged (0x0UL) /*!< Privileged and unprivileged access                                 */


/* MPC_OVERRIDE_PERMMASK: Masks permission setting fields from register OVERRIDE.PERM */
  #define MPC_OVERRIDE_PERMMASK_ResetValue (0x00000000UL) /*!< Reset value of PERMMASK register.                               */

/* READ @Bit 0 : Read mask */
  #define MPC_OVERRIDE_PERMMASK_READ_Pos (0UL)       /*!< Position of READ field.                                              */
  #define MPC_OVERRIDE_PERMMASK_READ_Msk (0x1UL << MPC_OVERRIDE_PERMMASK_READ_Pos) /*!< Bit mask of READ field.                */
  #define MPC_OVERRIDE_PERMMASK_READ_Min (0x0UL)     /*!< Min enumerator value of READ field.                                  */
  #define MPC_OVERRIDE_PERMMASK_READ_Max (0x1UL)     /*!< Max enumerator value of READ field.                                  */
  #define MPC_OVERRIDE_PERMMASK_READ_Masked (0x0UL)  /*!< Permission setting READ in OVERRIDE register will not be applied     */
  #define MPC_OVERRIDE_PERMMASK_READ_UnMasked (0x1UL) /*!< Permission setting READ in OVERRIDE register will be applied        */

/* WRITE @Bit 1 : Write mask */
  #define MPC_OVERRIDE_PERMMASK_WRITE_Pos (1UL)      /*!< Position of WRITE field.                                             */
  #define MPC_OVERRIDE_PERMMASK_WRITE_Msk (0x1UL << MPC_OVERRIDE_PERMMASK_WRITE_Pos) /*!< Bit mask of WRITE field.             */
  #define MPC_OVERRIDE_PERMMASK_WRITE_Min (0x0UL)    /*!< Min enumerator value of WRITE field.                                 */
  #define MPC_OVERRIDE_PERMMASK_WRITE_Max (0x1UL)    /*!< Max enumerator value of WRITE field.                                 */
  #define MPC_OVERRIDE_PERMMASK_WRITE_Masked (0x0UL) /*!< Permission setting WRITE in OVERRIDE register will not be applied    */
  #define MPC_OVERRIDE_PERMMASK_WRITE_UnMasked (0x1UL) /*!< Permission setting WRITE in OVERRIDE register will be applied      */

/* EXECUTE @Bit 2 : Execute mask */
  #define MPC_OVERRIDE_PERMMASK_EXECUTE_Pos (2UL)    /*!< Position of EXECUTE field.                                           */
  #define MPC_OVERRIDE_PERMMASK_EXECUTE_Msk (0x1UL << MPC_OVERRIDE_PERMMASK_EXECUTE_Pos) /*!< Bit mask of EXECUTE field.       */
  #define MPC_OVERRIDE_PERMMASK_EXECUTE_Min (0x0UL)  /*!< Min enumerator value of EXECUTE field.                               */
  #define MPC_OVERRIDE_PERMMASK_EXECUTE_Max (0x1UL)  /*!< Max enumerator value of EXECUTE field.                               */
  #define MPC_OVERRIDE_PERMMASK_EXECUTE_Masked (0x0UL) /*!< Permission setting EXECUTE in OVERRIDE register will not be applied*/
  #define MPC_OVERRIDE_PERMMASK_EXECUTE_UnMasked (0x1UL) /*!< Permission setting EXECUTE in OVERRIDE register will be applied  */

/* SECATTR @Bit 3 : Security mapping mask */
  #define MPC_OVERRIDE_PERMMASK_SECATTR_Pos (3UL)    /*!< Position of SECATTR field.                                           */
  #define MPC_OVERRIDE_PERMMASK_SECATTR_Msk (0x1UL << MPC_OVERRIDE_PERMMASK_SECATTR_Pos) /*!< Bit mask of SECATTR field.       */
  #define MPC_OVERRIDE_PERMMASK_SECATTR_Min (0x0UL)  /*!< Min enumerator value of SECATTR field.                               */
  #define MPC_OVERRIDE_PERMMASK_SECATTR_Max (0x1UL)  /*!< Max enumerator value of SECATTR field.                               */
  #define MPC_OVERRIDE_PERMMASK_SECATTR_Masked (0x0UL) /*!< Permission setting SECATTR in OVERRIDE register will not be applied*/
  #define MPC_OVERRIDE_PERMMASK_SECATTR_UnMasked (0x1UL) /*!< Permission setting SECATTR in OVERRIDE register will be applied  */

/* PRIVL @Bit 4 : Privileged mask */
  #define MPC_OVERRIDE_PERMMASK_PRIVL_Pos (4UL)      /*!< Position of PRIVL field.                                             */
  #define MPC_OVERRIDE_PERMMASK_PRIVL_Msk (0x1UL << MPC_OVERRIDE_PERMMASK_PRIVL_Pos) /*!< Bit mask of PRIVL field.             */
  #define MPC_OVERRIDE_PERMMASK_PRIVL_Min (0x0UL)    /*!< Min enumerator value of PRIVL field.                                 */
  #define MPC_OVERRIDE_PERMMASK_PRIVL_Max (0x1UL)    /*!< Max enumerator value of PRIVL field.                                 */
  #define MPC_OVERRIDE_PERMMASK_PRIVL_Masked (0x0UL) /*!< Permission setting PRIVL in OVERRIDE register will not be applied    */
  #define MPC_OVERRIDE_PERMMASK_PRIVL_UnMasked (0x1UL) /*!< Permission setting PRIVL in OVERRIDE register will be applied      */


/* ======================================================= Struct MPC ======================================================== */
/**
  * @brief Memory Privilege Controller
  */
  typedef struct {                                   /*!< MPC Structure                                                        */
    __IM uint32_t RESERVED[64];
    __IOM uint32_t EVENTS_MEMACCERR;                 /*!< (@ 0x00000100) Memory Access Error event                             */
    __IM uint32_t RESERVED1[127];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t RESERVED2[61];
    __IOM NRF_MPC_MEMACCERR_Type MEMACCERR;          /*!< (@ 0x00000400) Memory Access Error status registers                  */
    __IM uint32_t RESERVED3[254];
    __IOM NRF_MPC_OVERRIDE_Type OVERRIDE[40];        /*!< (@ 0x00000800) Special privilege tables                              */
  } NRF_MPC_Type;                                    /*!< Size = 3328 (0xD00)                                                  */

/* MPC_EVENTS_MEMACCERR: Memory Access Error event */
  #define MPC_EVENTS_MEMACCERR_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_MEMACCERR register.                        */

/* EVENTS_MEMACCERR @Bit 0 : Memory Access Error event */
  #define MPC_EVENTS_MEMACCERR_EVENTS_MEMACCERR_Pos (0UL) /*!< Position of EVENTS_MEMACCERR field.                             */
  #define MPC_EVENTS_MEMACCERR_EVENTS_MEMACCERR_Msk (0x1UL << MPC_EVENTS_MEMACCERR_EVENTS_MEMACCERR_Pos) /*!< Bit mask of
                                                                            EVENTS_MEMACCERR field.*/
  #define MPC_EVENTS_MEMACCERR_EVENTS_MEMACCERR_Min (0x0UL) /*!< Min enumerator value of EVENTS_MEMACCERR field.               */
  #define MPC_EVENTS_MEMACCERR_EVENTS_MEMACCERR_Max (0x1UL) /*!< Max enumerator value of EVENTS_MEMACCERR field.               */
  #define MPC_EVENTS_MEMACCERR_EVENTS_MEMACCERR_NotGenerated (0x0UL) /*!< Event not generated                                  */
  #define MPC_EVENTS_MEMACCERR_EVENTS_MEMACCERR_Generated (0x1UL) /*!< Event generated                                         */


/* MPC_INTEN: Enable or disable interrupt */
  #define MPC_INTEN_ResetValue (0x00000000UL)        /*!< Reset value of INTEN register.                                       */

/* MEMACCERR @Bit 0 : Enable or disable interrupt for event MEMACCERR */
  #define MPC_INTEN_MEMACCERR_Pos (0UL)              /*!< Position of MEMACCERR field.                                         */
  #define MPC_INTEN_MEMACCERR_Msk (0x1UL << MPC_INTEN_MEMACCERR_Pos) /*!< Bit mask of MEMACCERR field.                         */
  #define MPC_INTEN_MEMACCERR_Min (0x0UL)            /*!< Min enumerator value of MEMACCERR field.                             */
  #define MPC_INTEN_MEMACCERR_Max (0x1UL)            /*!< Max enumerator value of MEMACCERR field.                             */
  #define MPC_INTEN_MEMACCERR_Disabled (0x0UL)       /*!< Disable                                                              */
  #define MPC_INTEN_MEMACCERR_Enabled (0x1UL)        /*!< Enable                                                               */


/* MPC_INTENSET: Enable interrupt */
  #define MPC_INTENSET_ResetValue (0x00000000UL)     /*!< Reset value of INTENSET register.                                    */

/* MEMACCERR @Bit 0 : Write '1' to enable interrupt for event MEMACCERR */
  #define MPC_INTENSET_MEMACCERR_Pos (0UL)           /*!< Position of MEMACCERR field.                                         */
  #define MPC_INTENSET_MEMACCERR_Msk (0x1UL << MPC_INTENSET_MEMACCERR_Pos) /*!< Bit mask of MEMACCERR field.                   */
  #define MPC_INTENSET_MEMACCERR_Min (0x0UL)         /*!< Min enumerator value of MEMACCERR field.                             */
  #define MPC_INTENSET_MEMACCERR_Max (0x1UL)         /*!< Max enumerator value of MEMACCERR field.                             */
  #define MPC_INTENSET_MEMACCERR_Set (0x1UL)         /*!< Enable                                                               */
  #define MPC_INTENSET_MEMACCERR_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define MPC_INTENSET_MEMACCERR_Enabled (0x1UL)     /*!< Read: Enabled                                                        */


/* MPC_INTENCLR: Disable interrupt */
  #define MPC_INTENCLR_ResetValue (0x00000000UL)     /*!< Reset value of INTENCLR register.                                    */

/* MEMACCERR @Bit 0 : Write '1' to disable interrupt for event MEMACCERR */
  #define MPC_INTENCLR_MEMACCERR_Pos (0UL)           /*!< Position of MEMACCERR field.                                         */
  #define MPC_INTENCLR_MEMACCERR_Msk (0x1UL << MPC_INTENCLR_MEMACCERR_Pos) /*!< Bit mask of MEMACCERR field.                   */
  #define MPC_INTENCLR_MEMACCERR_Min (0x0UL)         /*!< Min enumerator value of MEMACCERR field.                             */
  #define MPC_INTENCLR_MEMACCERR_Max (0x1UL)         /*!< Max enumerator value of MEMACCERR field.                             */
  #define MPC_INTENCLR_MEMACCERR_Clear (0x1UL)       /*!< Disable                                                              */
  #define MPC_INTENCLR_MEMACCERR_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define MPC_INTENCLR_MEMACCERR_Enabled (0x1UL)     /*!< Read: Enabled                                                        */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           MRAMC                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

