NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* ==================================================== Struct MRAMC_ECC ===================================================== */
/**
  * @brief ECC [MRAMC_ECC] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ERROR;                             /*!< (@ 0x00000000) ECC Error status.                                     */
  __IOM uint32_t  ERRORCORR;                         /*!< (@ 0x00000004) ECC error detected and corrected.                     */
  __IM  uint32_t  ERRORADDR;                         /*!< (@ 0x00000008) Address of the first ECC error that could not be
                                                                         corrected.*/
  __IM  uint32_t  CORRADDR;                          /*!< (@ 0x0000000C) Address of the first ECC error that was corrected.    */
} NRF_MRAMC_ECC_Type;                                /*!< Size = 16 (0x010)                                                    */

/* MRAMC_ECC_ERROR: ECC Error status. */
  #define MRAMC_ECC_ERROR_ResetValue (0x00000000UL)  /*!< Reset value of ERROR register.                                       */

/* ECCERROR @Bit 0 : ECC error detected for a read which could not be corrected. Write 0 to clear. */
  #define MRAMC_ECC_ERROR_ECCERROR_Pos (0UL)         /*!< Position of ECCERROR field.                                          */
  #define MRAMC_ECC_ERROR_ECCERROR_Msk (0x1UL << MRAMC_ECC_ERROR_ECCERROR_Pos) /*!< Bit mask of ECCERROR field.                */
  #define MRAMC_ECC_ERROR_ECCERROR_Min (0x0UL)       /*!< Min enumerator value of ECCERROR field.                              */
  #define MRAMC_ECC_ERROR_ECCERROR_Max (0x1UL)       /*!< Max enumerator value of ECCERROR field.                              */
  #define MRAMC_ECC_ERROR_ECCERROR_NoEccError (0x0UL) /*!< ECC error not detected                                              */
  #define MRAMC_ECC_ERROR_ECCERROR_EccError (0x1UL)  /*!< ECC error detected                                                   */


/* MRAMC_ECC_ERRORCORR: ECC error detected and corrected. */
  #define MRAMC_ECC_ERRORCORR_ResetValue (0x00000000UL) /*!< Reset value of ERRORCORR register.                                */

/* ERRORCORR @Bit 0 : ECC error detected and corrected for a read. Write 0 to clear. */
  #define MRAMC_ECC_ERRORCORR_ERRORCORR_Pos (0UL)    /*!< Position of ERRORCORR field.                                         */
  #define MRAMC_ECC_ERRORCORR_ERRORCORR_Msk (0x1UL << MRAMC_ECC_ERRORCORR_ERRORCORR_Pos) /*!< Bit mask of ERRORCORR field.     */
  #define MRAMC_ECC_ERRORCORR_ERRORCORR_Min (0x0UL)  /*!< Min enumerator value of ERRORCORR field.                             */
  #define MRAMC_ECC_ERRORCORR_ERRORCORR_Max (0x1UL)  /*!< Max enumerator value of ERRORCORR field.                             */
  #define MRAMC_ECC_ERRORCORR_ERRORCORR_NoEccError (0x0UL) /*!< ECC error not detected                                         */
  #define MRAMC_ECC_ERRORCORR_ERRORCORR_ErrorCorr (0x1UL) /*!< ECC error detected and corrected                                */


/* MRAMC_ECC_ERRORADDR: Address of the first ECC error that could not be corrected. */
  #define MRAMC_ECC_ERRORADDR_ResetValue (0xFFFFFFFFUL) /*!< Reset value of ERRORADDR register.                                */

/* ERRORADDR @Bits 0..31 : Address */
  #define MRAMC_ECC_ERRORADDR_ERRORADDR_Pos (0UL)    /*!< Position of ERRORADDR field.                                         */
  #define MRAMC_ECC_ERRORADDR_ERRORADDR_Msk (0xFFFFFFFFUL << MRAMC_ECC_ERRORADDR_ERRORADDR_Pos) /*!< Bit mask of ERRORADDR
                                                                            field.*/


/* MRAMC_ECC_CORRADDR: Address of the first ECC error that was corrected. */
  #define MRAMC_ECC_CORRADDR_ResetValue (0xFFFFFFFFUL) /*!< Reset value of CORRADDR register.                                  */

/* CORRADDR @Bits 0..31 : Address */
  #define MRAMC_ECC_CORRADDR_CORRADDR_Pos (0UL)      /*!< Position of CORRADDR field.                                          */
  #define MRAMC_ECC_CORRADDR_CORRADDR_Msk (0xFFFFFFFFUL << MRAMC_ECC_CORRADDR_CORRADDR_Pos) /*!< Bit mask of CORRADDR field.   */



/* ================================================= Struct MRAMC_LOWAVGCURR ================================================= */
/**
  * @brief LOWAVGCURR [MRAMC_LOWAVGCURR] (unspecified)
  */
typedef struct {
  __IOM uint32_t  READ;                              /*!< (@ 0x00000000) Preload timeout value for low average current in case
                                                                         of read*/
  __IOM uint32_t  WRITE;                             /*!< (@ 0x00000004) Preload timeout value for low average current in case
                                                                         of write*/
  __IOM uint32_t  ERASE;                             /*!< (@ 0x00000008) Preload timeout value for low average current in case
                                                                         of erase*/
} NRF_MRAMC_LOWAVGCURR_Type;                         /*!< Size = 12 (0x00C)                                                    */

/* MRAMC_LOWAVGCURR_READ: Preload timeout value for low average current in case of read */
  #define MRAMC_LOWAVGCURR_READ_ResetValue (0x00000000UL) /*!< Reset value of READ register.                                   */

/* VALUE @Bits 0..11 : Preload value */
  #define MRAMC_LOWAVGCURR_READ_VALUE_Pos (0UL)      /*!< Position of VALUE field.                                             */
  #define MRAMC_LOWAVGCURR_READ_VALUE_Msk (0xFFFUL << MRAMC_LOWAVGCURR_READ_VALUE_Pos) /*!< Bit mask of VALUE field.           */
  #define MRAMC_LOWAVGCURR_READ_VALUE_Min (0x000UL)  /*!< Min value of VALUE field.                                            */
  #define MRAMC_LOWAVGCURR_READ_VALUE_Max (0xFFFUL)  /*!< Max size of VALUE field.                                             */


/* MRAMC_LOWAVGCURR_WRITE: Preload timeout value for low average current in case of write */
  #define MRAMC_LOWAVGCURR_WRITE_ResetValue (0x00000000UL) /*!< Reset value of WRITE register.                                 */

/* VALUE @Bits 0..11 : Preload value */
  #define MRAMC_LOWAVGCURR_WRITE_VALUE_Pos (0UL)     /*!< Position of VALUE field.                                             */
  #define MRAMC_LOWAVGCURR_WRITE_VALUE_Msk (0xFFFUL << MRAMC_LOWAVGCURR_WRITE_VALUE_Pos) /*!< Bit mask of VALUE field.         */
  #define MRAMC_LOWAVGCURR_WRITE_VALUE_Min (0x000UL) /*!< Min value of VALUE field.                                            */
  #define MRAMC_LOWAVGCURR_WRITE_VALUE_Max (0xFFFUL) /*!< Max size of VALUE field.                                             */


