NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* KEY @Bits 16..31 : Key to enable the writing to this register. */
  #define MRAMC_TRIM_START_KEY_Pos (16UL)            /*!< Position of KEY field.                                               */
  #define MRAMC_TRIM_START_KEY_Msk (0xFFFFUL << MRAMC_TRIM_START_KEY_Pos) /*!< Bit mask of KEY field.                          */
  #define MRAMC_TRIM_START_KEY_Min (0x0000UL)        /*!< Min enumerator value of KEY field.                                   */
  #define MRAMC_TRIM_START_KEY_Max (0xA66DUL)        /*!< Max enumerator value of KEY field.                                   */
  #define MRAMC_TRIM_START_KEY_Disable (0x0000UL)    /*!< Disable the writing to this register                                 */
  #define MRAMC_TRIM_START_KEY_Enable (0xA66DUL)     /*!< Enable the writing to this register                                  */


/* MRAMC_TRIM_READY: Status of shifting the MRAM trim configuration data. */
  #define MRAMC_TRIM_READY_ResetValue (0x00000001UL) /*!< Reset value of READY register.                                       */

/* READY @Bit 0 : Shifting the MRAM trim configuration data is in progress or not. */
  #define MRAMC_TRIM_READY_READY_Pos (0UL)           /*!< Position of READY field.                                             */
  #define MRAMC_TRIM_READY_READY_Msk (0x1UL << MRAMC_TRIM_READY_READY_Pos) /*!< Bit mask of READY field.                       */
  #define MRAMC_TRIM_READY_READY_Min (0x0UL)         /*!< Min enumerator value of READY field.                                 */
  #define MRAMC_TRIM_READY_READY_Max (0x1UL)         /*!< Max enumerator value of READY field.                                 */
  #define MRAMC_TRIM_READY_READY_Busy (0x0UL)        /*!< Shifting the MRAM trim configuration data is in progress.            */
  #define MRAMC_TRIM_READY_READY_Ready (0x1UL)       /*!< Ready for shifting the next MRAM trim configuration data.            */


/* MRAMC_TRIM_DONE: This register is used to indicate to the MRAMC that the whole MRAM trim configuration data write is
                     completed. */

  #define MRAMC_TRIM_DONE_ResetValue (0x00000000UL)  /*!< Reset value of DONE register.                                        */

/* TRIMCOMPLETED @Bits 0..31 : Trim configuration is completed. */
  #define MRAMC_TRIM_DONE_TRIMCOMPLETED_Pos (0UL)    /*!< Position of TRIMCOMPLETED field.                                     */
  #define MRAMC_TRIM_DONE_TRIMCOMPLETED_Msk (0xFFFFFFFFUL << MRAMC_TRIM_DONE_TRIMCOMPLETED_Pos) /*!< Bit mask of TRIMCOMPLETED
                                                                            field.*/
  #define MRAMC_TRIM_DONE_TRIMCOMPLETED_Min (0x00000000UL) /*!< Min enumerator value of TRIMCOMPLETED field.                   */
  #define MRAMC_TRIM_DONE_TRIMCOMPLETED_Max (0xA66DA66DUL) /*!< Max enumerator value of TRIMCOMPLETED field.                   */
  #define MRAMC_TRIM_DONE_TRIMCOMPLETED_TrimUnknown (0x00000000UL) /*!< Read: Trim configuration is unknown                    */
  #define MRAMC_TRIM_DONE_TRIMCOMPLETED_TrimCompleted (0x00000001UL) /*!< Read: Trim configuration data write is completed.    */
  #define MRAMC_TRIM_DONE_TRIMCOMPLETED_TrimComplete (0xA66DA66DUL) /*!< Write: Trim configuration data write is complete.     */
  #define MRAMC_TRIM_DONE_TRIMCOMPLETED_NoOperation (0x00000000UL) /*!< Write ignored for all other values than 0xA66DA66D.    */



/* =================================================== Struct MRAMC_ERASE ==================================================== */
/**
  * @brief ERASE [MRAMC_ERASE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ERASEWORD;                         /*!< (@ 0x00000000) Register for erasing a word in the MRAM main block.   */
  __IOM uint32_t  SIZE;                              /*!< (@ 0x00000004) Size for erasing an area in the MRAM main block       */
  __IOM uint32_t  ERASEAREA;                         /*!< (@ 0x00000008) Register for erasing an area in the MRAM main block   */
  __OM  uint32_t  ERASEALL;                          /*!< (@ 0x0000000C) Register for erasing whole MRAM main block and the
                                                                         first NVR page This register is deprecated and must not
                                                                         be used. Use ERASEALL from CTRLAP instead.*/
  __IOM uint32_t  LOCK;                              /*!< (@ 0x00000010) Locking the erase registers.                          */
} NRF_MRAMC_ERASE_Type;                              /*!< Size = 20 (0x014)                                                    */

/* MRAMC_ERASE_ERASEWORD: Register for erasing a word in the MRAM main block. */
  #define MRAMC_ERASE_ERASEWORD_ResetValue (0x00000000UL) /*!< Reset value of ERASEWORD register.                              */

/* ERASEWORD @Bits 0..31 : Address of the word that needs to be erased. */
  #define MRAMC_ERASE_ERASEWORD_ERASEWORD_Pos (0UL)  /*!< Position of ERASEWORD field.                                         */
  #define MRAMC_ERASE_ERASEWORD_ERASEWORD_Msk (0xFFFFFFFFUL << MRAMC_ERASE_ERASEWORD_ERASEWORD_Pos) /*!< Bit mask of ERASEWORD
                                                                            field.*/


/* MRAMC_ERASE_SIZE: Size for erasing an area in the MRAM main block */
  #define MRAMC_ERASE_SIZE_ResetValue (0x00000000UL) /*!< Reset value of SIZE register.                                        */

/* SIZE @Bits 0..18 : Number of MRAM words to be erased using ERASE.ERASEAREA. */
  #define MRAMC_ERASE_SIZE_SIZE_Pos (0UL)            /*!< Position of SIZE field.                                              */
  #define MRAMC_ERASE_SIZE_SIZE_Msk (0x7FFFFUL << MRAMC_ERASE_SIZE_SIZE_Pos) /*!< Bit mask of SIZE field.                      */
  #define MRAMC_ERASE_SIZE_SIZE_Min (0x00001UL)      /*!< Min value of SIZE field.                                             */
  #define MRAMC_ERASE_SIZE_SIZE_Max (0x40000UL)      /*!< Max size of SIZE field.                                              */


/* MRAMC_ERASE_ERASEAREA: Register for erasing an area in the MRAM main block */
  #define MRAMC_ERASE_ERASEAREA_ResetValue (0x00000000UL) /*!< Reset value of ERASEAREA register.                              */

/* ERASEAREA @Bits 0..31 : Start address of the area to be erased. */
  #define MRAMC_ERASE_ERASEAREA_ERASEAREA_Pos (0UL)  /*!< Position of ERASEAREA field.                                         */
  #define MRAMC_ERASE_ERASEAREA_ERASEAREA_Msk (0xFFFFFFFFUL << MRAMC_ERASE_ERASEAREA_ERASEAREA_Pos) /*!< Bit mask of ERASEAREA
                                                                            field.*/


/* MRAMC_ERASE_ERASEALL: Register for erasing whole MRAM main block and the first NVR page This register is deprecated and must
                          not be used. Use ERASEALL from CTRLAP instead. */

