NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
  #define MRAMC_ERASE_ERASEALL_ResetValue (0x00000000UL) /*!< Reset value of ERASEALL register.                                */

/* ERASEALL @Bit 0 : Erase whole MRAM and the first NVR page. The other NVR pages are not erased. */
  #define MRAMC_ERASE_ERASEALL_ERASEALL_Pos (0UL)    /*!< Position of ERASEALL field.                                          */
  #define MRAMC_ERASE_ERASEALL_ERASEALL_Msk (0x1UL << MRAMC_ERASE_ERASEALL_ERASEALL_Pos) /*!< Bit mask of ERASEALL field.      */
  #define MRAMC_ERASE_ERASEALL_ERASEALL_Min (0x0UL)  /*!< Min enumerator value of ERASEALL field.                              */
  #define MRAMC_ERASE_ERASEALL_ERASEALL_Max (0x1UL)  /*!< Max enumerator value of ERASEALL field.                              */
  #define MRAMC_ERASE_ERASEALL_ERASEALL_NoOperation (0x0UL) /*!< No operation                                                  */
  #define MRAMC_ERASE_ERASEALL_ERASEALL_Erase (0x1UL) /*!< Start erase of chip                                                 */


/* MRAMC_ERASE_LOCK: Locking the erase registers. */
  #define MRAMC_ERASE_LOCK_ResetValue (0x00000000UL) /*!< Reset value of LOCK register.                                        */

/* ERASEWORD @Bit 0 : Lock for ERASE.ERASEWORD. */
  #define MRAMC_ERASE_LOCK_ERASEWORD_Pos (0UL)       /*!< Position of ERASEWORD field.                                         */
  #define MRAMC_ERASE_LOCK_ERASEWORD_Msk (0x1UL << MRAMC_ERASE_LOCK_ERASEWORD_Pos) /*!< Bit mask of ERASEWORD field.           */
  #define MRAMC_ERASE_LOCK_ERASEWORD_Min (0x0UL)     /*!< Min enumerator value of ERASEWORD field.                             */
  #define MRAMC_ERASE_LOCK_ERASEWORD_Max (0x1UL)     /*!< Max enumerator value of ERASEWORD field.                             */
  #define MRAMC_ERASE_LOCK_ERASEWORD_Disabled (0x0UL) /*!< Lock disabled.                                                      */
  #define MRAMC_ERASE_LOCK_ERASEWORD_Enabled (0x1UL) /*!< Lock enabled.                                                        */

/* ERASEAREA @Bit 1 : Lock for ERASE.ERASEAREA. */
  #define MRAMC_ERASE_LOCK_ERASEAREA_Pos (1UL)       /*!< Position of ERASEAREA field.                                         */
  #define MRAMC_ERASE_LOCK_ERASEAREA_Msk (0x1UL << MRAMC_ERASE_LOCK_ERASEAREA_Pos) /*!< Bit mask of ERASEAREA field.           */
  #define MRAMC_ERASE_LOCK_ERASEAREA_Min (0x0UL)     /*!< Min enumerator value of ERASEAREA field.                             */
  #define MRAMC_ERASE_LOCK_ERASEAREA_Max (0x1UL)     /*!< Max enumerator value of ERASEAREA field.                             */
  #define MRAMC_ERASE_LOCK_ERASEAREA_Disabled (0x0UL) /*!< Lock disabled.                                                      */
  #define MRAMC_ERASE_LOCK_ERASEAREA_Enabled (0x1UL) /*!< Lock enabled.                                                        */

/* ERASEALL @Bit 2 : Lock for ERASE.ERASEALL. */
  #define MRAMC_ERASE_LOCK_ERASEALL_Pos (2UL)        /*!< Position of ERASEALL field.                                          */
  #define MRAMC_ERASE_LOCK_ERASEALL_Msk (0x1UL << MRAMC_ERASE_LOCK_ERASEALL_Pos) /*!< Bit mask of ERASEALL field.              */
  #define MRAMC_ERASE_LOCK_ERASEALL_Min (0x0UL)      /*!< Min enumerator value of ERASEALL field.                              */
  #define MRAMC_ERASE_LOCK_ERASEALL_Max (0x1UL)      /*!< Max enumerator value of ERASEALL field.                              */
  #define MRAMC_ERASE_LOCK_ERASEALL_Disabled (0x0UL) /*!< Lock disabled.                                                       */
  #define MRAMC_ERASE_LOCK_ERASEALL_Enabled (0x1UL)  /*!< Lock enabled.                                                        */



/* ================================================= Struct MRAMC_CONFIGNVR ================================================== */
/**
  * @brief CONFIGNVR [MRAMC_CONFIGNVR] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PAGE[4];                           /*!< (@ 0x00000000) Configuration register for NVR page n                 */
} NRF_MRAMC_CONFIGNVR_Type;                          /*!< Size = 16 (0x010)                                                    */

/* MRAMC_CONFIGNVR_PAGE: Configuration register for NVR page n */
  #define MRAMC_CONFIGNVR_PAGE_MaxCount (4UL)        /*!< Max size of PAGE[4] array.                                           */
  #define MRAMC_CONFIGNVR_PAGE_MaxIndex (3UL)        /*!< Max index of PAGE[4] array.                                          */
  #define MRAMC_CONFIGNVR_PAGE_MinIndex (0UL)        /*!< Min index of PAGE[4] array.                                          */
  #define MRAMC_CONFIGNVR_PAGE_ResetValue (0xFFF00000UL) /*!< Reset value of PAGE[4] register.                                 */

/* WEN @Bits 0..1 : Write enable. */
  #define MRAMC_CONFIGNVR_PAGE_WEN_Pos (0UL)         /*!< Position of WEN field.                                               */
  #define MRAMC_CONFIGNVR_PAGE_WEN_Msk (0x3UL << MRAMC_CONFIGNVR_PAGE_WEN_Pos) /*!< Bit mask of WEN field.                     */
  #define MRAMC_CONFIGNVR_PAGE_WEN_Min (0x0UL)       /*!< Min enumerator value of WEN field.                                   */
  #define MRAMC_CONFIGNVR_PAGE_WEN_Max (0x2UL)       /*!< Max enumerator value of WEN field.                                   */
  #define MRAMC_CONFIGNVR_PAGE_WEN_DisableWrite (0x0UL) /*!< Write is disabled                                                 */
  #define MRAMC_CONFIGNVR_PAGE_WEN_EnableNormalWrite (0x1UL) /*!< Normal write is enabled                                      */
  #define MRAMC_CONFIGNVR_PAGE_WEN_EnableDirectWrite (0x2UL) /*!< Direct write is enabled                                      */

/* EEN @Bits 4..5 : Erase enable. */
  #define MRAMC_CONFIGNVR_PAGE_EEN_Pos (4UL)         /*!< Position of EEN field.                                               */
  #define MRAMC_CONFIGNVR_PAGE_EEN_Msk (0x3UL << MRAMC_CONFIGNVR_PAGE_EEN_Pos) /*!< Bit mask of EEN field.                     */
  #define MRAMC_CONFIGNVR_PAGE_EEN_Min (0x0UL)       /*!< Min enumerator value of EEN field.                                   */
  #define MRAMC_CONFIGNVR_PAGE_EEN_Max (0x2UL)       /*!< Max enumerator value of EEN field.                                   */
  #define MRAMC_CONFIGNVR_PAGE_EEN_DisableErase (0x0UL) /*!< Erase is disabled but read is allowed                             */
  #define MRAMC_CONFIGNVR_PAGE_EEN_EnablePageErase (0x1UL) /*!< Erase page and read are allowed                                */
  #define MRAMC_CONFIGNVR_PAGE_EEN_EnableWordErase (0x2UL) /*!< Erase word and read are allowed                                */

