NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* IO3 @Bit 1 : Value to override IO3 to in custom command mode */
  #define MSPI_CUSTCMD_VALUE_IO3_Pos (1UL)           /*!< Position of IO3 field.                                               */
  #define MSPI_CUSTCMD_VALUE_IO3_Msk (0x1UL << MSPI_CUSTCMD_VALUE_IO3_Pos) /*!< Bit mask of IO3 field.                         */



/* ===================================================== Struct MSPI_RXD ===================================================== */
/**
  * @brief RXD [MSPI_RXD] (unspecified)
  */
typedef struct {
  __IM  uint32_t  AMOUNT;                            /*!< (@ 0x00000000) DMA data amount                                       */
} NRF_MSPI_RXD_Type;                                 /*!< Size = 4 (0x004)                                                     */

/* MSPI_RXD_AMOUNT: DMA data amount */
  #define MSPI_RXD_AMOUNT_ResetValue (0x00000000UL)  /*!< Reset value of AMOUNT register.                                      */

/* AMOUNT @Bits 0..23 : (unspecified) */
  #define MSPI_RXD_AMOUNT_AMOUNT_Pos (0UL)           /*!< Position of AMOUNT field.                                            */
  #define MSPI_RXD_AMOUNT_AMOUNT_Msk (0xFFFFFFUL << MSPI_RXD_AMOUNT_AMOUNT_Pos) /*!< Bit mask of AMOUNT field.                 */



/* ===================================================== Struct MSPI_TXD ===================================================== */
/**
  * @brief TXD [MSPI_TXD] (unspecified)
  */
typedef struct {
  __IM  uint32_t  AMOUNT;                            /*!< (@ 0x00000000) DMA data amount                                       */
} NRF_MSPI_TXD_Type;                                 /*!< Size = 4 (0x004)                                                     */

/* MSPI_TXD_AMOUNT: DMA data amount */
  #define MSPI_TXD_AMOUNT_ResetValue (0x00000000UL)  /*!< Reset value of AMOUNT register.                                      */

/* AMOUNT @Bits 0..23 : (unspecified) */
  #define MSPI_TXD_AMOUNT_AMOUNT_Pos (0UL)           /*!< Position of AMOUNT field.                                            */
  #define MSPI_TXD_AMOUNT_AMOUNT_Msk (0xFFFFFFUL << MSPI_TXD_AMOUNT_AMOUNT_Pos) /*!< Bit mask of AMOUNT field.                 */



/* ================================================= Struct MSPI_DMA_STATUS ================================================== */
/**
  * @brief STATUS [MSPI_DMA_STATUS] EasyVDMA status registers.
  */
typedef struct {
  __IM  uint32_t  BYTECOUNT;                         /*!< (@ 0x00000000) Number of bytes sent or received during processing of
                                                                         current descriptor list*/
  __IM  uint32_t  ATTRIBUTE;                         /*!< (@ 0x00000004) Latest job attribute being processed.                 */
  __IM  uint32_t  ADDRESS;                           /*!< (@ 0x00000008) Latest address being accessed.                        */
  __IM  uint32_t  JOBCOUNT;                          /*!< (@ 0x0000000C) Number of completed jobs in current descriptor list.  */
  __IM  uint32_t  BUSERROR;                          /*!< (@ 0x00000010) AXI bus error status.                                 */
  __IM  uint32_t  FIFO;                              /*!< (@ 0x00000014) Data fifo status.                                     */
  __IM  uint32_t  ACTIVE;                            /*!< (@ 0x00000018) DMA activity state.                                   */
} NRF_MSPI_DMA_STATUS_Type;                          /*!< Size = 28 (0x01C)                                                    */

/* MSPI_DMA_STATUS_BYTECOUNT: Number of bytes sent or received during processing of current descriptor list */
  #define MSPI_DMA_STATUS_BYTECOUNT_ResetValue (0x00000000UL) /*!< Reset value of BYTECOUNT register.                          */

/* BYTECOUNT @Bits 0..31 : Number of bytes sent or received during processing of current descriptor list */
  #define MSPI_DMA_STATUS_BYTECOUNT_BYTECOUNT_Pos (0UL) /*!< Position of BYTECOUNT field.                                      */
  #define MSPI_DMA_STATUS_BYTECOUNT_BYTECOUNT_Msk (0xFFFFFFFFUL << MSPI_DMA_STATUS_BYTECOUNT_BYTECOUNT_Pos) /*!< Bit mask of
                                                                            BYTECOUNT field.*/


/* MSPI_DMA_STATUS_ATTRIBUTE: Latest job attribute being processed. */
  #define MSPI_DMA_STATUS_ATTRIBUTE_ResetValue (0x00000000UL) /*!< Reset value of ATTRIBUTE register.                          */

/* ATTRIBUTE @Bits 0..5 : Latest job attribute being processed. */
  #define MSPI_DMA_STATUS_ATTRIBUTE_ATTRIBUTE_Pos (0UL) /*!< Position of ATTRIBUTE field.                                      */
  #define MSPI_DMA_STATUS_ATTRIBUTE_ATTRIBUTE_Msk (0x3FUL << MSPI_DMA_STATUS_ATTRIBUTE_ATTRIBUTE_Pos) /*!< Bit mask of ATTRIBUTE
                                                                            field.*/


/* MSPI_DMA_STATUS_ADDRESS: Latest address being accessed. */
  #define MSPI_DMA_STATUS_ADDRESS_ResetValue (0x00000000UL) /*!< Reset value of ADDRESS register.                              */

/* ADDRESS @Bits 0..31 : Latest address being accessed. */
  #define MSPI_DMA_STATUS_ADDRESS_ADDRESS_Pos (0UL)  /*!< Position of ADDRESS field.                                           */
  #define MSPI_DMA_STATUS_ADDRESS_ADDRESS_Msk (0xFFFFFFFFUL << MSPI_DMA_STATUS_ADDRESS_ADDRESS_Pos) /*!< Bit mask of ADDRESS
                                                                            field.*/


/* MSPI_DMA_STATUS_JOBCOUNT: Number of completed jobs in current descriptor list. */
  #define MSPI_DMA_STATUS_JOBCOUNT_ResetValue (0x00000000UL) /*!< Reset value of JOBCOUNT register.                            */

/* JOBCOUNT @Bits 0..31 : Number of completed jobs in current descriptor list. */
  #define MSPI_DMA_STATUS_JOBCOUNT_JOBCOUNT_Pos (0UL) /*!< Position of JOBCOUNT field.                                         */
  #define MSPI_DMA_STATUS_JOBCOUNT_JOBCOUNT_Msk (0xFFFFFFFFUL << MSPI_DMA_STATUS_JOBCOUNT_JOBCOUNT_Pos) /*!< Bit mask of
                                                                            JOBCOUNT field.*/


