NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* SPIFRF @Bits 22..23 : SPI Frame Format */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_SPIFRF_Pos (22UL) /*!< Position of SPIFRF field.                                     */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_SPIFRF_Msk (0x3UL << MSPI_CONTROLLERCORE_CORE_CTRLR0_SPIFRF_Pos) /*!< Bit mask of
                                                                            SPIFRF field.*/
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_SPIFRF_Min (0x0UL) /*!< Min enumerator value of SPIFRF field.                        */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_SPIFRF_Max (0x3UL) /*!< Max enumerator value of SPIFRF field.                        */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_SPIFRF_SPI_STANDARD (0x0UL) /*!< Standard SPI Format                                 */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_SPIFRF_SPI_DUAL (0x1UL) /*!< Dual SPI Format                                         */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_SPIFRF_SPI_QUAD (0x2UL) /*!< Quad SPI Format                                         */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_SPIFRF_SPI_OCTAL (0x3UL) /*!< Octal SPI Format                                       */

/* RSVDCTRLR024 @Bit 24 : (unspecified) */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_RSVDCTRLR024_Pos (24UL) /*!< Position of RSVDCTRLR024 field.                         */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_RSVDCTRLR024_Msk (0x1UL << MSPI_CONTROLLERCORE_CORE_CTRLR0_RSVDCTRLR024_Pos) /*!< Bit
                                                                            mask of RSVDCTRLR024 field.*/

/* SPIDWSEN @Bit 25 : Enable Dynamic wait states in SPI mode of operation. This field is only applicable when CTRLR0.FRF is set
                      to 0 (Motorola SPI Frame Format). */

  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_SPIDWSEN_Pos (25UL) /*!< Position of SPIDWSEN field.                                 */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_SPIDWSEN_Msk (0x1UL << MSPI_CONTROLLERCORE_CORE_CTRLR0_SPIDWSEN_Pos) /*!< Bit mask of
                                                                            SPIDWSEN field.*/
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_SPIDWSEN_Min (0x0UL) /*!< Min enumerator value of SPIDWSEN field.                    */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_SPIDWSEN_Max (0x1UL) /*!< Max enumerator value of SPIDWSEN field.                    */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_SPIDWSEN_DISABLE (0x0UL) /*!< Disable SPI Dynamic Wait State                         */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_SPIDWSEN_ENABLE (0x1UL) /*!< Enable SPI Dynamic Wait State                           */

/* RSVDCTRLR026 @Bit 26 : (unspecified) */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_RSVDCTRLR026_Pos (26UL) /*!< Position of RSVDCTRLR026 field.                         */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_RSVDCTRLR026_Msk (0x1UL << MSPI_CONTROLLERCORE_CORE_CTRLR0_RSVDCTRLR026_Pos) /*!< Bit
                                                                            mask of RSVDCTRLR026 field.*/

/* RSVDCTRLR027 @Bit 27 : (unspecified) */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_RSVDCTRLR027_Pos (27UL) /*!< Position of RSVDCTRLR027 field.                         */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_RSVDCTRLR027_Msk (0x1UL << MSPI_CONTROLLERCORE_CORE_CTRLR0_RSVDCTRLR027_Pos) /*!< Bit
                                                                            mask of RSVDCTRLR027 field.*/

/* RSVDCTRLR02830 @Bits 28..30 : (unspecified) */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_RSVDCTRLR02830_Pos (28UL) /*!< Position of RSVDCTRLR02830 field.                     */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_RSVDCTRLR02830_Msk (0x7UL << MSPI_CONTROLLERCORE_CORE_CTRLR0_RSVDCTRLR02830_Pos) /*!<
                                                                            Bit mask of RSVDCTRLR02830 field.*/

/* RSVDCTRLR031 @Bit 31 : (unspecified) */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_RSVDCTRLR031_Pos (31UL) /*!< Position of RSVDCTRLR031 field.                         */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_RSVDCTRLR031_Msk (0x1UL << MSPI_CONTROLLERCORE_CORE_CTRLR0_RSVDCTRLR031_Pos) /*!< Bit
                                                                            mask of RSVDCTRLR031 field.*/


/* MSPI_CONTROLLERCORE_CORE_CTRLR1: Control Register 1 */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR1_ResetValue (0x00000000UL) /*!< Reset value of CTRLR1 register.                       */

/* NDF @Bits 0..15 : Number of Data Frames. */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR1_NDF_Pos (0UL) /*!< Position of NDF field.                                            */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR1_NDF_Msk (0xFFFFUL << MSPI_CONTROLLERCORE_CORE_CTRLR1_NDF_Pos) /*!< Bit mask of NDF
                                                                            field.*/

/* RSVDCTRLR1 @Bits 16..31 : (unspecified) */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR1_RSVDCTRLR1_Pos (16UL) /*!< Position of RSVDCTRLR1 field.                             */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR1_RSVDCTRLR1_Msk (0xFFFFUL << MSPI_CONTROLLERCORE_CORE_CTRLR1_RSVDCTRLR1_Pos) /*!< Bit
                                                                            mask of RSVDCTRLR1 field.*/


/* MSPI_CONTROLLERCORE_CORE_SSIENR: SSI Enable Register */
  #define MSPI_CONTROLLERCORE_CORE_SSIENR_ResetValue (0x00000000UL) /*!< Reset value of SSIENR register.                       */

/* SSICEN @Bit 0 : SSI Enable. */
  #define MSPI_CONTROLLERCORE_CORE_SSIENR_SSICEN_Pos (0UL) /*!< Position of SSICEN field.                                      */
  #define MSPI_CONTROLLERCORE_CORE_SSIENR_SSICEN_Msk (0x1UL << MSPI_CONTROLLERCORE_CORE_SSIENR_SSICEN_Pos) /*!< Bit mask of
                                                                            SSICEN field.*/
  #define MSPI_CONTROLLERCORE_CORE_SSIENR_SSICEN_Min (0x0UL) /*!< Min enumerator value of SSICEN field.                        */
  #define MSPI_CONTROLLERCORE_CORE_SSIENR_SSICEN_Max (0x1UL) /*!< Max enumerator value of SSICEN field.                        */
  #define MSPI_CONTROLLERCORE_CORE_SSIENR_SSICEN_DISABLE (0x0UL) /*!< Disables MSPI CORE                                       */
  #define MSPI_CONTROLLERCORE_CORE_SSIENR_SSICEN_ENABLED (0x1UL) /*!< Enables MSPI CORE                                        */

/* RSVDSSIENR @Bits 1..31 : (unspecified) */
  #define MSPI_CONTROLLERCORE_CORE_SSIENR_RSVDSSIENR_Pos (1UL) /*!< Position of RSVDSSIENR field.                              */
  #define MSPI_CONTROLLERCORE_CORE_SSIENR_RSVDSSIENR_Msk (0x7FFFFFFFUL << MSPI_CONTROLLERCORE_CORE_SSIENR_RSVDSSIENR_Pos) /*!<
                                                                            Bit mask of RSVDSSIENR field.*/


