NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* DMATDL @Bits 0..3 : Transmit Data Level. This bit field controls the level at which a DMA request is made by the transmit
                       logic. It is equal to the watermark level; that is, the dma_tx_req signal is generated when the number of
                       valid data entries in the transmit FIFO is equal to or below this field value, and TDMAE = 1. */

  #define MSPI_PERIPHERALCORE_CORE_DMATDLR_DMATDL_Pos (0UL) /*!< Position of DMATDL field.                                     */
  #define MSPI_PERIPHERALCORE_CORE_DMATDLR_DMATDL_Msk (0xFUL << MSPI_PERIPHERALCORE_CORE_DMATDLR_DMATDL_Pos) /*!< Bit mask of
                                                                            DMATDL field.*/

/* RSVDDMATDLR @Bits 4..31 : (unspecified) */
  #define MSPI_PERIPHERALCORE_CORE_DMATDLR_RSVDDMATDLR_Pos (4UL) /*!< Position of RSVDDMATDLR field.                           */
  #define MSPI_PERIPHERALCORE_CORE_DMATDLR_RSVDDMATDLR_Msk (0xFFFFFFFUL << MSPI_PERIPHERALCORE_CORE_DMATDLR_RSVDDMATDLR_Pos)
                                                                            /*!< Bit mask of RSVDDMATDLR field.*/


/* MSPI_PERIPHERALCORE_CORE_DMARDLR: DMA Receive Data Level */
  #define MSPI_PERIPHERALCORE_CORE_DMARDLR_ResetValue (0x00000000UL) /*!< Reset value of DMARDLR register.                     */

/* DMARDL @Bits 0..3 : Receive Data Level. This bit field controls the level at which a DMA request is made by the receive
                       logic. The watermark level = DMARDL+1; that is, dma_rx_req is generated when the number of valid data
                       entries in the receive FIFO is equal to or above this field value + 1, and RDMAE=1. */

  #define MSPI_PERIPHERALCORE_CORE_DMARDLR_DMARDL_Pos (0UL) /*!< Position of DMARDL field.                                     */
  #define MSPI_PERIPHERALCORE_CORE_DMARDLR_DMARDL_Msk (0xFUL << MSPI_PERIPHERALCORE_CORE_DMARDLR_DMARDL_Pos) /*!< Bit mask of
                                                                            DMARDL field.*/

/* RSVDDMARDLR @Bits 4..31 : (unspecified) */
  #define MSPI_PERIPHERALCORE_CORE_DMARDLR_RSVDDMARDLR_Pos (4UL) /*!< Position of RSVDDMARDLR field.                           */
  #define MSPI_PERIPHERALCORE_CORE_DMARDLR_RSVDDMARDLR_Msk (0xFFFFFFFUL << MSPI_PERIPHERALCORE_CORE_DMARDLR_RSVDDMARDLR_Pos)
                                                                            /*!< Bit mask of RSVDDMARDLR field.*/


/* MSPI_PERIPHERALCORE_CORE_IDR: Identification Register */
  #define MSPI_PERIPHERALCORE_CORE_IDR_ResetValue (0x51535049UL) /*!< Reset value of IDR register.                             */

/* IDCODE @Bits 0..31 : Identification code. The register contains the identification code of the peripheral, which is written
                        into the register at configuration time using CoreConsultant. */

  #define MSPI_PERIPHERALCORE_CORE_IDR_IDCODE_Pos (0UL) /*!< Position of IDCODE field.                                         */
  #define MSPI_PERIPHERALCORE_CORE_IDR_IDCODE_Msk (0xFFFFFFFFUL << MSPI_PERIPHERALCORE_CORE_IDR_IDCODE_Pos) /*!< Bit mask of
                                                                            IDCODE field.*/


/* MSPI_PERIPHERALCORE_CORE_SSICVERSIONID: MSPI CORE component version */
  #define MSPI_PERIPHERALCORE_CORE_SSICVERSIONID_ResetValue (0x3230312AUL) /*!< Reset value of SSICVERSIONID register.         */

/* SSICCOMPVERSION @Bits 0..31 : Contains the hex representation of the Synopsys component version. Consists of ASCII value for
                                 each number in the version, followed by *. For example 31_30_33_2A represents the version
                                 1.03*. */

  #define MSPI_PERIPHERALCORE_CORE_SSICVERSIONID_SSICCOMPVERSION_Pos (0UL) /*!< Position of SSICCOMPVERSION field.             */
  #define MSPI_PERIPHERALCORE_CORE_SSICVERSIONID_SSICCOMPVERSION_Msk (0xFFFFFFFFUL << MSPI_PERIPHERALCORE_CORE_SSICVERSIONID_SSICCOMPVERSION_Pos)
                                                                            /*!< Bit mask of SSICCOMPVERSION field.*/


/* MSPI_PERIPHERALCORE_CORE_DR: MSPI CORE Data Register 0 */
  #define MSPI_PERIPHERALCORE_CORE_DR_MaxCount (36UL) /*!< Max size of DR[36] array.                                           */
  #define MSPI_PERIPHERALCORE_CORE_DR_MaxIndex (35UL) /*!< Max index of DR[36] array.                                          */
  #define MSPI_PERIPHERALCORE_CORE_DR_MinIndex (0UL) /*!< Min index of DR[36] array.                                           */
  #define MSPI_PERIPHERALCORE_CORE_DR_ResetValue (0x00000000UL) /*!< Reset value of DR[36] register.                           */

/* DR @Bits 0..31 : Data Register. When writing to this register, you must right-justify the data. Read data are automatically
                    right-justified. */

  #define MSPI_PERIPHERALCORE_CORE_DR_DR_Pos (0UL)   /*!< Position of DR field.                                                */
  #define MSPI_PERIPHERALCORE_CORE_DR_DR_Msk (0xFFFFFFFFUL << MSPI_PERIPHERALCORE_CORE_DR_DR_Pos) /*!< Bit mask of DR field.   */


/* MSPI_PERIPHERALCORE_CORE_RXSAMPLEDELAY: RX Sample Delay Register */
  #define MSPI_PERIPHERALCORE_CORE_RXSAMPLEDELAY_ResetValue (0x00000000UL) /*!< Reset value of RXSAMPLEDELAY register.         */

/* RSD @Bits 0..7 : Receive Data (rxd) Sample Delay. This register is used to delay the sample of the rxd input port. Each value
                    */

  #define MSPI_PERIPHERALCORE_CORE_RXSAMPLEDELAY_RSD_Pos (0UL) /*!< Position of RSD field.                                     */
  #define MSPI_PERIPHERALCORE_CORE_RXSAMPLEDELAY_RSD_Msk (0xFFUL << MSPI_PERIPHERALCORE_CORE_RXSAMPLEDELAY_RSD_Pos) /*!< Bit
                                                                            mask of RSD field.*/

/* RSVD0RXSAMPLEDELAY @Bits 8..15 : (unspecified) */
  #define MSPI_PERIPHERALCORE_CORE_RXSAMPLEDELAY_RSVD0RXSAMPLEDELAY_Pos (8UL) /*!< Position of RSVD0RXSAMPLEDELAY field.       */
  #define MSPI_PERIPHERALCORE_CORE_RXSAMPLEDELAY_RSVD0RXSAMPLEDELAY_Msk (0xFFUL << MSPI_PERIPHERALCORE_CORE_RXSAMPLEDELAY_RSVD0RXSAMPLEDELAY_Pos)
                                                                            /*!< Bit mask of RSVD0RXSAMPLEDELAY field.*/

