NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* RSVDSPICTRLR019 @Bit 19 : (unspecified) */
  #define MSPI_PERIPHERALCORE_CORE_SPICTRLR0_RSVDSPICTRLR019_Pos (19UL) /*!< Position of RSVDSPICTRLR019 field.                */
  #define MSPI_PERIPHERALCORE_CORE_SPICTRLR0_RSVDSPICTRLR019_Msk (0x1UL << MSPI_PERIPHERALCORE_CORE_SPICTRLR0_RSVDSPICTRLR019_Pos)
                                                                            /*!< Bit mask of RSVDSPICTRLR019 field.*/

/* RSVDSPICTRLR020 @Bit 20 : (unspecified) */
  #define MSPI_PERIPHERALCORE_CORE_SPICTRLR0_RSVDSPICTRLR020_Pos (20UL) /*!< Position of RSVDSPICTRLR020 field.                */
  #define MSPI_PERIPHERALCORE_CORE_SPICTRLR0_RSVDSPICTRLR020_Msk (0x1UL << MSPI_PERIPHERALCORE_CORE_SPICTRLR0_RSVDSPICTRLR020_Pos)
                                                                            /*!< Bit mask of RSVDSPICTRLR020 field.*/

/* RSVDSPICTRLR021 @Bit 21 : (unspecified) */
  #define MSPI_PERIPHERALCORE_CORE_SPICTRLR0_RSVDSPICTRLR021_Pos (21UL) /*!< Position of RSVDSPICTRLR021 field.                */
  #define MSPI_PERIPHERALCORE_CORE_SPICTRLR0_RSVDSPICTRLR021_Msk (0x1UL << MSPI_PERIPHERALCORE_CORE_SPICTRLR0_RSVDSPICTRLR021_Pos)
                                                                            /*!< Bit mask of RSVDSPICTRLR021 field.*/

/* RSVDSPICTRLR022 @Bit 22 : (unspecified) */
  #define MSPI_PERIPHERALCORE_CORE_SPICTRLR0_RSVDSPICTRLR022_Pos (22UL) /*!< Position of RSVDSPICTRLR022 field.                */
  #define MSPI_PERIPHERALCORE_CORE_SPICTRLR0_RSVDSPICTRLR022_Msk (0x1UL << MSPI_PERIPHERALCORE_CORE_SPICTRLR0_RSVDSPICTRLR022_Pos)
                                                                            /*!< Bit mask of RSVDSPICTRLR022 field.*/

/* RSVDSPICTRLR023 @Bit 23 : (unspecified) */
  #define MSPI_PERIPHERALCORE_CORE_SPICTRLR0_RSVDSPICTRLR023_Pos (23UL) /*!< Position of RSVDSPICTRLR023 field.                */
  #define MSPI_PERIPHERALCORE_CORE_SPICTRLR0_RSVDSPICTRLR023_Msk (0x1UL << MSPI_PERIPHERALCORE_CORE_SPICTRLR0_RSVDSPICTRLR023_Pos)
                                                                            /*!< Bit mask of RSVDSPICTRLR023 field.*/

/* RSVDSPICTRLR024 @Bit 24 : (unspecified) */
  #define MSPI_PERIPHERALCORE_CORE_SPICTRLR0_RSVDSPICTRLR024_Pos (24UL) /*!< Position of RSVDSPICTRLR024 field.                */
  #define MSPI_PERIPHERALCORE_CORE_SPICTRLR0_RSVDSPICTRLR024_Msk (0x1UL << MSPI_PERIPHERALCORE_CORE_SPICTRLR0_RSVDSPICTRLR024_Pos)
                                                                            /*!< Bit mask of RSVDSPICTRLR024 field.*/

/* RSVDSPICTRLR025 @Bit 25 : (unspecified) */
  #define MSPI_PERIPHERALCORE_CORE_SPICTRLR0_RSVDSPICTRLR025_Pos (25UL) /*!< Position of RSVDSPICTRLR025 field.                */
  #define MSPI_PERIPHERALCORE_CORE_SPICTRLR0_RSVDSPICTRLR025_Msk (0x1UL << MSPI_PERIPHERALCORE_CORE_SPICTRLR0_RSVDSPICTRLR025_Pos)
                                                                            /*!< Bit mask of RSVDSPICTRLR025 field.*/

/* RSVDSPICTRLR02627 @Bits 26..27 : (unspecified) */
  #define MSPI_PERIPHERALCORE_CORE_SPICTRLR0_RSVDSPICTRLR02627_Pos (26UL) /*!< Position of RSVDSPICTRLR02627 field.            */
  #define MSPI_PERIPHERALCORE_CORE_SPICTRLR0_RSVDSPICTRLR02627_Msk (0x3UL << MSPI_PERIPHERALCORE_CORE_SPICTRLR0_RSVDSPICTRLR02627_Pos)
                                                                            /*!< Bit mask of RSVDSPICTRLR02627 field.*/

/* RSVDSPICTRLR028 @Bit 28 : (unspecified) */
  #define MSPI_PERIPHERALCORE_CORE_SPICTRLR0_RSVDSPICTRLR028_Pos (28UL) /*!< Position of RSVDSPICTRLR028 field.                */
  #define MSPI_PERIPHERALCORE_CORE_SPICTRLR0_RSVDSPICTRLR028_Msk (0x1UL << MSPI_PERIPHERALCORE_CORE_SPICTRLR0_RSVDSPICTRLR028_Pos)
                                                                            /*!< Bit mask of RSVDSPICTRLR028 field.*/

/* RSVDSPICTRLR029 @Bit 29 : (unspecified) */
  #define MSPI_PERIPHERALCORE_CORE_SPICTRLR0_RSVDSPICTRLR029_Pos (29UL) /*!< Position of RSVDSPICTRLR029 field.                */
  #define MSPI_PERIPHERALCORE_CORE_SPICTRLR0_RSVDSPICTRLR029_Msk (0x1UL << MSPI_PERIPHERALCORE_CORE_SPICTRLR0_RSVDSPICTRLR029_Pos)
                                                                            /*!< Bit mask of RSVDSPICTRLR029 field.*/

/* CLKSTRETCHEN @Bit 30 : Enables clock stretching capability in SPI transfers. */
  #define MSPI_PERIPHERALCORE_CORE_SPICTRLR0_CLKSTRETCHEN_Pos (30UL) /*!< Position of CLKSTRETCHEN field.                      */
  #define MSPI_PERIPHERALCORE_CORE_SPICTRLR0_CLKSTRETCHEN_Msk (0x1UL << MSPI_PERIPHERALCORE_CORE_SPICTRLR0_CLKSTRETCHEN_Pos)
                                                                            /*!< Bit mask of CLKSTRETCHEN field.*/

/* RSVDSPICTRLR0 @Bit 31 : (unspecified) */
  #define MSPI_PERIPHERALCORE_CORE_SPICTRLR0_RSVDSPICTRLR0_Pos (31UL) /*!< Position of RSVDSPICTRLR0 field.                    */
  #define MSPI_PERIPHERALCORE_CORE_SPICTRLR0_RSVDSPICTRLR0_Msk (0x1UL << MSPI_PERIPHERALCORE_CORE_SPICTRLR0_RSVDSPICTRLR0_Pos)
                                                                            /*!< Bit mask of RSVDSPICTRLR0 field.*/


/* MSPI_PERIPHERALCORE_CORE_SPICTRLR1: SPI Control 1 register */
  #define MSPI_PERIPHERALCORE_CORE_SPICTRLR1_ResetValue (0x00000000UL) /*!< Reset value of SPICTRLR1 register.                 */

/* DYNWS @Bits 0..2 : SPI Dynamic Wait states field. */
  #define MSPI_PERIPHERALCORE_CORE_SPICTRLR1_DYNWS_Pos (0UL) /*!< Position of DYNWS field.                                     */
  #define MSPI_PERIPHERALCORE_CORE_SPICTRLR1_DYNWS_Msk (0x7UL << MSPI_PERIPHERALCORE_CORE_SPICTRLR1_DYNWS_Pos) /*!< Bit mask of
                                                                            DYNWS field.*/

/* RSVDSPICTRLR134 @Bits 3..4 : (unspecified) */
  #define MSPI_PERIPHERALCORE_CORE_SPICTRLR1_RSVDSPICTRLR134_Pos (3UL) /*!< Position of RSVDSPICTRLR134 field.                 */
  #define MSPI_PERIPHERALCORE_CORE_SPICTRLR1_RSVDSPICTRLR134_Msk (0x3UL << MSPI_PERIPHERALCORE_CORE_SPICTRLR1_RSVDSPICTRLR134_Pos)
                                                                            /*!< Bit mask of RSVDSPICTRLR134 field.*/

