NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* DFS @Bits 0..4 : Data Frame Size. */
  #define MSPI_XIPCORE_CORE_CTRLR0_DFS_Pos (0UL)     /*!< Position of DFS field.                                               */
  #define MSPI_XIPCORE_CORE_CTRLR0_DFS_Msk (0x1FUL << MSPI_XIPCORE_CORE_CTRLR0_DFS_Pos) /*!< Bit mask of DFS field.            */
  #define MSPI_XIPCORE_CORE_CTRLR0_DFS_Min (0x03UL)  /*!< Min enumerator value of DFS field.                                   */
  #define MSPI_XIPCORE_CORE_CTRLR0_DFS_Max (0x1FUL)  /*!< Max enumerator value of DFS field.                                   */
  #define MSPI_XIPCORE_CORE_CTRLR0_DFS_DFS_04_BIT (0x03UL) /*!< 04-bit serial data transfer                                    */
  #define MSPI_XIPCORE_CORE_CTRLR0_DFS_DFS_05_BIT (0x04UL) /*!< 05-bit serial data transfer                                    */
  #define MSPI_XIPCORE_CORE_CTRLR0_DFS_DFS_06_BIT (0x05UL) /*!< 06-bit serial data transfer                                    */
  #define MSPI_XIPCORE_CORE_CTRLR0_DFS_DFS_07_BIT (0x06UL) /*!< 07-bit serial data transfer                                    */
  #define MSPI_XIPCORE_CORE_CTRLR0_DFS_DFS_08_BIT (0x07UL) /*!< 08-bit serial data transfer                                    */
  #define MSPI_XIPCORE_CORE_CTRLR0_DFS_DFS_09_BIT (0x08UL) /*!< 09-bit serial data transfer                                    */
  #define MSPI_XIPCORE_CORE_CTRLR0_DFS_DFS_10_BIT (0x09UL) /*!< 10-bit serial data transfer                                    */
  #define MSPI_XIPCORE_CORE_CTRLR0_DFS_DFS_11_BIT (0x0AUL) /*!< 11-bit serial data transfer                                    */
  #define MSPI_XIPCORE_CORE_CTRLR0_DFS_DFS_12_BIT (0x0BUL) /*!< 12-bit serial data transfer                                    */
  #define MSPI_XIPCORE_CORE_CTRLR0_DFS_DFS_13_BIT (0x0CUL) /*!< 13-bit serial data transfer                                    */
  #define MSPI_XIPCORE_CORE_CTRLR0_DFS_DFS_14_BIT (0x0DUL) /*!< 14-bit serial data transfer                                    */
  #define MSPI_XIPCORE_CORE_CTRLR0_DFS_DFS_15_BIT (0x0EUL) /*!< 15-bit serial data transfer                                    */
  #define MSPI_XIPCORE_CORE_CTRLR0_DFS_DFS_16_BIT (0x0FUL) /*!< 16-bit serial data transfer                                    */
  #define MSPI_XIPCORE_CORE_CTRLR0_DFS_DFS_17_BIT (0x10UL) /*!< 17-bit serial data transfer                                    */
  #define MSPI_XIPCORE_CORE_CTRLR0_DFS_DFS_18_BIT (0x11UL) /*!< 18-bit serial data transfer                                    */
  #define MSPI_XIPCORE_CORE_CTRLR0_DFS_DFS_19_BIT (0x12UL) /*!< 19-bit serial data transfer                                    */
  #define MSPI_XIPCORE_CORE_CTRLR0_DFS_DFS_20_BIT (0x13UL) /*!< 20-bit serial data transfer                                    */
  #define MSPI_XIPCORE_CORE_CTRLR0_DFS_DFS_21_BIT (0x14UL) /*!< 21-bit serial data transfer                                    */
  #define MSPI_XIPCORE_CORE_CTRLR0_DFS_DFS_22_BIT (0x15UL) /*!< 22-bit serial data transfer                                    */
  #define MSPI_XIPCORE_CORE_CTRLR0_DFS_DFS_23_BIT (0x16UL) /*!< 23-bit serial data transfer                                    */
  #define MSPI_XIPCORE_CORE_CTRLR0_DFS_DFS_24_BIT (0x17UL) /*!< 24-bit serial data transfer                                    */
  #define MSPI_XIPCORE_CORE_CTRLR0_DFS_DFS_25_BIT (0x18UL) /*!< 25-bit serial data transfer                                    */
  #define MSPI_XIPCORE_CORE_CTRLR0_DFS_DFS_26_BIT (0x19UL) /*!< 26-bit serial data transfer                                    */
  #define MSPI_XIPCORE_CORE_CTRLR0_DFS_DFS_27_BIT (0x1AUL) /*!< 27-bit serial data transfer                                    */
  #define MSPI_XIPCORE_CORE_CTRLR0_DFS_DFS_28_BIT (0x1BUL) /*!< 28-bit serial data transfer                                    */
  #define MSPI_XIPCORE_CORE_CTRLR0_DFS_DFS_29_BIT (0x1CUL) /*!< 29-bit serial data transfer                                    */
  #define MSPI_XIPCORE_CORE_CTRLR0_DFS_DFS_30_BIT (0x1DUL) /*!< 30-bit serial data transfer                                    */
  #define MSPI_XIPCORE_CORE_CTRLR0_DFS_DFS_31_BIT (0x1EUL) /*!< 31-bit serial data transfer                                    */
  #define MSPI_XIPCORE_CORE_CTRLR0_DFS_DFS_32_BIT (0x1FUL) /*!< 32-bit serial data transfer                                    */

/* RSVDCTRLR05 @Bit 5 : (unspecified) */
  #define MSPI_XIPCORE_CORE_CTRLR0_RSVDCTRLR05_Pos (5UL) /*!< Position of RSVDCTRLR05 field.                                   */
  #define MSPI_XIPCORE_CORE_CTRLR0_RSVDCTRLR05_Msk (0x1UL << MSPI_XIPCORE_CORE_CTRLR0_RSVDCTRLR05_Pos) /*!< Bit mask of
                                                                            RSVDCTRLR05 field.*/

/* FRF @Bits 6..7 : Frame Format. */
  #define MSPI_XIPCORE_CORE_CTRLR0_FRF_Pos (6UL)     /*!< Position of FRF field.                                               */
  #define MSPI_XIPCORE_CORE_CTRLR0_FRF_Msk (0x3UL << MSPI_XIPCORE_CORE_CTRLR0_FRF_Pos) /*!< Bit mask of FRF field.             */
  #define MSPI_XIPCORE_CORE_CTRLR0_FRF_Min (0x0UL)   /*!< Min enumerator value of FRF field.                                   */
  #define MSPI_XIPCORE_CORE_CTRLR0_FRF_Max (0x2UL)   /*!< Max enumerator value of FRF field.                                   */
  #define MSPI_XIPCORE_CORE_CTRLR0_FRF_SPI (0x0UL)   /*!< Motorola SPI Frame Format                                            */
  #define MSPI_XIPCORE_CORE_CTRLR0_FRF_SSP (0x1UL)   /*!< Texas Instruments SSP Frame Format                                   */
  #define MSPI_XIPCORE_CORE_CTRLR0_FRF_MICROWIRE (0x2UL) /*!< National Semiconductors Microwire Frame Format                   */

/* SCPH @Bit 8 : Serial Clock Phase. */
  #define MSPI_XIPCORE_CORE_CTRLR0_SCPH_Pos (8UL)    /*!< Position of SCPH field.                                              */
  #define MSPI_XIPCORE_CORE_CTRLR0_SCPH_Msk (0x1UL << MSPI_XIPCORE_CORE_CTRLR0_SCPH_Pos) /*!< Bit mask of SCPH field.          */
  #define MSPI_XIPCORE_CORE_CTRLR0_SCPH_Min (0x0UL)  /*!< Min enumerator value of SCPH field.                                  */
  #define MSPI_XIPCORE_CORE_CTRLR0_SCPH_Max (0x1UL)  /*!< Max enumerator value of SCPH field.                                  */
  #define MSPI_XIPCORE_CORE_CTRLR0_SCPH_MIDDLE_BIT (0x0UL) /*!< Serial clock toggles in middle of first bit                    */
  #define MSPI_XIPCORE_CORE_CTRLR0_SCPH_START_BIT (0x1UL) /*!< Serial clock toggles at start of first bit                      */

/* SCPOL @Bit 9 : Serial Clock Polarity. */
  #define MSPI_XIPCORE_CORE_CTRLR0_SCPOL_Pos (9UL)   /*!< Position of SCPOL field.                                             */
  #define MSPI_XIPCORE_CORE_CTRLR0_SCPOL_Msk (0x1UL << MSPI_XIPCORE_CORE_CTRLR0_SCPOL_Pos) /*!< Bit mask of SCPOL field.       */
  #define MSPI_XIPCORE_CORE_CTRLR0_SCPOL_Min (0x0UL) /*!< Min enumerator value of SCPOL field.                                 */
  #define MSPI_XIPCORE_CORE_CTRLR0_SCPOL_Max (0x1UL) /*!< Max enumerator value of SCPOL field.                                 */
  #define MSPI_XIPCORE_CORE_CTRLR0_SCPOL_INACTIVE_LOW (0x0UL) /*!< Inactive state of serial clock is low                       */
  #define MSPI_XIPCORE_CORE_CTRLR0_SCPOL_INACTIVE_HIGH (0x1UL) /*!< Inactive state of serial clock is high                     */

