NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* MSTIR @Bit 5 : Multi-Controller Contention Raw Interrupt Status. This bit field is not present if the MSPI CORE is configured
                  as a serial-target device. */

  #define MSPI_XIPCORE_CORE_RISR_MSTIR_Pos (5UL)     /*!< Position of MSTIR field.                                             */
  #define MSPI_XIPCORE_CORE_RISR_MSTIR_Msk (0x1UL << MSPI_XIPCORE_CORE_RISR_MSTIR_Pos) /*!< Bit mask of MSTIR field.           */
  #define MSPI_XIPCORE_CORE_RISR_MSTIR_Min (0x0UL)   /*!< Min enumerator value of MSTIR field.                                 */
  #define MSPI_XIPCORE_CORE_RISR_MSTIR_Max (0x1UL)   /*!< Max enumerator value of MSTIR field.                                 */
  #define MSPI_XIPCORE_CORE_RISR_MSTIR_INACTIVE (0x0UL) /*!< ssi_mst_intr interrupt is not active prior masking                */
  #define MSPI_XIPCORE_CORE_RISR_MSTIR_ACTIVE (0x1UL) /*!< ssi_mst_intr interrupt is active prior to masking                   */

/* XRXOIR @Bit 6 : XIP Receive FIFO Overflow Raw Interrupt Status */
  #define MSPI_XIPCORE_CORE_RISR_XRXOIR_Pos (6UL)    /*!< Position of XRXOIR field.                                            */
  #define MSPI_XIPCORE_CORE_RISR_XRXOIR_Msk (0x1UL << MSPI_XIPCORE_CORE_RISR_XRXOIR_Pos) /*!< Bit mask of XRXOIR field.        */
  #define MSPI_XIPCORE_CORE_RISR_XRXOIR_Min (0x0UL)  /*!< Min enumerator value of XRXOIR field.                                */
  #define MSPI_XIPCORE_CORE_RISR_XRXOIR_Max (0x1UL)  /*!< Max enumerator value of XRXOIR field.                                */
  #define MSPI_XIPCORE_CORE_RISR_XRXOIR_INACTIVE (0x0UL) /*!< ssi_xrxo_intr interrupt is not active prior masking              */
  #define MSPI_XIPCORE_CORE_RISR_XRXOIR_ACTIVE (0x1UL) /*!< ssi_xrxo_intr interrupt is active prior to masking                 */

/* RSVDRISR7 @Bit 7 : (unspecified) */
  #define MSPI_XIPCORE_CORE_RISR_RSVDRISR7_Pos (7UL) /*!< Position of RSVDRISR7 field.                                         */
  #define MSPI_XIPCORE_CORE_RISR_RSVDRISR7_Msk (0x1UL << MSPI_XIPCORE_CORE_RISR_RSVDRISR7_Pos) /*!< Bit mask of RSVDRISR7
                                                                            field.*/

/* RSVDRISR8 @Bit 8 : (unspecified) */
  #define MSPI_XIPCORE_CORE_RISR_RSVDRISR8_Pos (8UL) /*!< Position of RSVDRISR8 field.                                         */
  #define MSPI_XIPCORE_CORE_RISR_RSVDRISR8_Msk (0x1UL << MSPI_XIPCORE_CORE_RISR_RSVDRISR8_Pos) /*!< Bit mask of RSVDRISR8
                                                                            field.*/

/* RSVD9RISR @Bit 9 : (unspecified) */
  #define MSPI_XIPCORE_CORE_RISR_RSVD9RISR_Pos (9UL) /*!< Position of RSVD9RISR field.                                         */
  #define MSPI_XIPCORE_CORE_RISR_RSVD9RISR_Msk (0x1UL << MSPI_XIPCORE_CORE_RISR_RSVD9RISR_Pos) /*!< Bit mask of RSVD9RISR
                                                                            field.*/

/* RSVDRISR10 @Bit 10 : (unspecified) */
  #define MSPI_XIPCORE_CORE_RISR_RSVDRISR10_Pos (10UL) /*!< Position of RSVDRISR10 field.                                      */
  #define MSPI_XIPCORE_CORE_RISR_RSVDRISR10_Msk (0x1UL << MSPI_XIPCORE_CORE_RISR_RSVDRISR10_Pos) /*!< Bit mask of RSVDRISR10
                                                                            field.*/

/* RSVDRISR11 @Bit 11 : (unspecified) */
  #define MSPI_XIPCORE_CORE_RISR_RSVDRISR11_Pos (11UL) /*!< Position of RSVDRISR11 field.                                      */
  #define MSPI_XIPCORE_CORE_RISR_RSVDRISR11_Msk (0x1UL << MSPI_XIPCORE_CORE_RISR_RSVDRISR11_Pos) /*!< Bit mask of RSVDRISR11
                                                                            field.*/

/* RSVD1231RISR @Bits 12..31 : (unspecified) */
  #define MSPI_XIPCORE_CORE_RISR_RSVD1231RISR_Pos (12UL) /*!< Position of RSVD1231RISR field.                                  */
  #define MSPI_XIPCORE_CORE_RISR_RSVD1231RISR_Msk (0xFFFFFUL << MSPI_XIPCORE_CORE_RISR_RSVD1231RISR_Pos) /*!< Bit mask of
                                                                            RSVD1231RISR field.*/


/* MSPI_XIPCORE_CORE_TXEICR: Transmit FIFO Error Interrupt Clear Register Register */
  #define MSPI_XIPCORE_CORE_TXEICR_ResetValue (0x00000000UL) /*!< Reset value of TXEICR register.                              */

/* TXEICR @Bit 0 : Clear Transmit FIFO Overflow/Underflow Interrupt. */
  #define MSPI_XIPCORE_CORE_TXEICR_TXEICR_Pos (0UL)  /*!< Position of TXEICR field.                                            */
  #define MSPI_XIPCORE_CORE_TXEICR_TXEICR_Msk (0x1UL << MSPI_XIPCORE_CORE_TXEICR_TXEICR_Pos) /*!< Bit mask of TXEICR field.    */

/* RSVDTXEICR @Bits 1..31 : (unspecified) */
  #define MSPI_XIPCORE_CORE_TXEICR_RSVDTXEICR_Pos (1UL) /*!< Position of RSVDTXEICR field.                                     */
  #define MSPI_XIPCORE_CORE_TXEICR_RSVDTXEICR_Msk (0x7FFFFFFFUL << MSPI_XIPCORE_CORE_TXEICR_RSVDTXEICR_Pos) /*!< Bit mask of
                                                                            RSVDTXEICR field.*/


/* MSPI_XIPCORE_CORE_RXOICR: Receive FIFO Overflow Interrupt Clear Register */
  #define MSPI_XIPCORE_CORE_RXOICR_ResetValue (0x00000000UL) /*!< Reset value of RXOICR register.                              */

/* RXOICR @Bit 0 : Clear Receive FIFO Overflow Interrupt. */
  #define MSPI_XIPCORE_CORE_RXOICR_RXOICR_Pos (0UL)  /*!< Position of RXOICR field.                                            */
  #define MSPI_XIPCORE_CORE_RXOICR_RXOICR_Msk (0x1UL << MSPI_XIPCORE_CORE_RXOICR_RXOICR_Pos) /*!< Bit mask of RXOICR field.    */

/* RSVDRXOICR @Bits 1..31 : (unspecified) */
  #define MSPI_XIPCORE_CORE_RXOICR_RSVDRXOICR_Pos (1UL) /*!< Position of RSVDRXOICR field.                                     */
  #define MSPI_XIPCORE_CORE_RXOICR_RSVDRXOICR_Msk (0x7FFFFFFFUL << MSPI_XIPCORE_CORE_RXOICR_RSVDRXOICR_Pos) /*!< Bit mask of
                                                                            RSVDRXOICR field.*/


/* MSPI_XIPCORE_CORE_RXUICR: Receive FIFO Underflow Interrupt Clear Register */
  #define MSPI_XIPCORE_CORE_RXUICR_ResetValue (0x00000000UL) /*!< Reset value of RXUICR register.                              */

/* RXUICR @Bit 0 : Clear Receive FIFO Underflow Interrupt. */
  #define MSPI_XIPCORE_CORE_RXUICR_RXUICR_Pos (0UL)  /*!< Position of RXUICR field.                                            */
  #define MSPI_XIPCORE_CORE_RXUICR_RXUICR_Msk (0x1UL << MSPI_XIPCORE_CORE_RXUICR_RXUICR_Pos) /*!< Bit mask of RXUICR field.    */

/* RSVDRXUICR @Bits 1..31 : (unspecified) */
  #define MSPI_XIPCORE_CORE_RXUICR_RSVDRXUICR_Pos (1UL) /*!< Position of RSVDRXUICR field.                                     */
  #define MSPI_XIPCORE_CORE_RXUICR_RSVDRXUICR_Msk (0x7FFFFFFFUL << MSPI_XIPCORE_CORE_RXUICR_RSVDRXUICR_Pos) /*!< Bit mask of
                                                                            RSVDRXUICR field.*/


