NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* RSVDSPICTRLR019 @Bit 19 : (unspecified) */
  #define MSPI_XIPCORE_CORE_SPICTRLR0_RSVDSPICTRLR019_Pos (19UL) /*!< Position of RSVDSPICTRLR019 field.                       */
  #define MSPI_XIPCORE_CORE_SPICTRLR0_RSVDSPICTRLR019_Msk (0x1UL << MSPI_XIPCORE_CORE_SPICTRLR0_RSVDSPICTRLR019_Pos) /*!< Bit
                                                                            mask of RSVDSPICTRLR019 field.*/

/* RSVDSPICTRLR020 @Bit 20 : (unspecified) */
  #define MSPI_XIPCORE_CORE_SPICTRLR0_RSVDSPICTRLR020_Pos (20UL) /*!< Position of RSVDSPICTRLR020 field.                       */
  #define MSPI_XIPCORE_CORE_SPICTRLR0_RSVDSPICTRLR020_Msk (0x1UL << MSPI_XIPCORE_CORE_SPICTRLR0_RSVDSPICTRLR020_Pos) /*!< Bit
                                                                            mask of RSVDSPICTRLR020 field.*/

/* RSVDSPICTRLR021 @Bit 21 : (unspecified) */
  #define MSPI_XIPCORE_CORE_SPICTRLR0_RSVDSPICTRLR021_Pos (21UL) /*!< Position of RSVDSPICTRLR021 field.                       */
  #define MSPI_XIPCORE_CORE_SPICTRLR0_RSVDSPICTRLR021_Msk (0x1UL << MSPI_XIPCORE_CORE_SPICTRLR0_RSVDSPICTRLR021_Pos) /*!< Bit
                                                                            mask of RSVDSPICTRLR021 field.*/

/* RSVDSPICTRLR022 @Bit 22 : (unspecified) */
  #define MSPI_XIPCORE_CORE_SPICTRLR0_RSVDSPICTRLR022_Pos (22UL) /*!< Position of RSVDSPICTRLR022 field.                       */
  #define MSPI_XIPCORE_CORE_SPICTRLR0_RSVDSPICTRLR022_Msk (0x1UL << MSPI_XIPCORE_CORE_SPICTRLR0_RSVDSPICTRLR022_Pos) /*!< Bit
                                                                            mask of RSVDSPICTRLR022 field.*/

/* RSVDSPICTRLR023 @Bit 23 : (unspecified) */
  #define MSPI_XIPCORE_CORE_SPICTRLR0_RSVDSPICTRLR023_Pos (23UL) /*!< Position of RSVDSPICTRLR023 field.                       */
  #define MSPI_XIPCORE_CORE_SPICTRLR0_RSVDSPICTRLR023_Msk (0x1UL << MSPI_XIPCORE_CORE_SPICTRLR0_RSVDSPICTRLR023_Pos) /*!< Bit
                                                                            mask of RSVDSPICTRLR023 field.*/

/* RSVDSPICTRLR024 @Bit 24 : (unspecified) */
  #define MSPI_XIPCORE_CORE_SPICTRLR0_RSVDSPICTRLR024_Pos (24UL) /*!< Position of RSVDSPICTRLR024 field.                       */
  #define MSPI_XIPCORE_CORE_SPICTRLR0_RSVDSPICTRLR024_Msk (0x1UL << MSPI_XIPCORE_CORE_SPICTRLR0_RSVDSPICTRLR024_Pos) /*!< Bit
                                                                            mask of RSVDSPICTRLR024 field.*/

/* RSVDSPICTRLR025 @Bit 25 : (unspecified) */
  #define MSPI_XIPCORE_CORE_SPICTRLR0_RSVDSPICTRLR025_Pos (25UL) /*!< Position of RSVDSPICTRLR025 field.                       */
  #define MSPI_XIPCORE_CORE_SPICTRLR0_RSVDSPICTRLR025_Msk (0x1UL << MSPI_XIPCORE_CORE_SPICTRLR0_RSVDSPICTRLR025_Pos) /*!< Bit
                                                                            mask of RSVDSPICTRLR025 field.*/

/* RSVDSPICTRLR02627 @Bits 26..27 : (unspecified) */
  #define MSPI_XIPCORE_CORE_SPICTRLR0_RSVDSPICTRLR02627_Pos (26UL) /*!< Position of RSVDSPICTRLR02627 field.                   */
  #define MSPI_XIPCORE_CORE_SPICTRLR0_RSVDSPICTRLR02627_Msk (0x3UL << MSPI_XIPCORE_CORE_SPICTRLR0_RSVDSPICTRLR02627_Pos) /*!<
                                                                            Bit mask of RSVDSPICTRLR02627 field.*/

/* RSVDSPICTRLR028 @Bit 28 : (unspecified) */
  #define MSPI_XIPCORE_CORE_SPICTRLR0_RSVDSPICTRLR028_Pos (28UL) /*!< Position of RSVDSPICTRLR028 field.                       */
  #define MSPI_XIPCORE_CORE_SPICTRLR0_RSVDSPICTRLR028_Msk (0x1UL << MSPI_XIPCORE_CORE_SPICTRLR0_RSVDSPICTRLR028_Pos) /*!< Bit
                                                                            mask of RSVDSPICTRLR028 field.*/

/* RSVDSPICTRLR029 @Bit 29 : (unspecified) */
  #define MSPI_XIPCORE_CORE_SPICTRLR0_RSVDSPICTRLR029_Pos (29UL) /*!< Position of RSVDSPICTRLR029 field.                       */
  #define MSPI_XIPCORE_CORE_SPICTRLR0_RSVDSPICTRLR029_Msk (0x1UL << MSPI_XIPCORE_CORE_SPICTRLR0_RSVDSPICTRLR029_Pos) /*!< Bit
                                                                            mask of RSVDSPICTRLR029 field.*/

/* CLKSTRETCHEN @Bit 30 : Enables clock stretching capability in SPI transfers. */
  #define MSPI_XIPCORE_CORE_SPICTRLR0_CLKSTRETCHEN_Pos (30UL) /*!< Position of CLKSTRETCHEN field.                             */
  #define MSPI_XIPCORE_CORE_SPICTRLR0_CLKSTRETCHEN_Msk (0x1UL << MSPI_XIPCORE_CORE_SPICTRLR0_CLKSTRETCHEN_Pos) /*!< Bit mask of
                                                                            CLKSTRETCHEN field.*/

/* RSVDSPICTRLR0 @Bit 31 : (unspecified) */
  #define MSPI_XIPCORE_CORE_SPICTRLR0_RSVDSPICTRLR0_Pos (31UL) /*!< Position of RSVDSPICTRLR0 field.                           */
  #define MSPI_XIPCORE_CORE_SPICTRLR0_RSVDSPICTRLR0_Msk (0x1UL << MSPI_XIPCORE_CORE_SPICTRLR0_RSVDSPICTRLR0_Pos) /*!< Bit mask
                                                                            of RSVDSPICTRLR0 field.*/


/* MSPI_XIPCORE_CORE_XIPMODEBITS: eXecute in Place - Mode bits */
  #define MSPI_XIPCORE_CORE_XIPMODEBITS_ResetValue (0x00000000UL) /*!< Reset value of XIPMODEBITS register.                    */

/* XIPMDBITS @Bits 0..15 : XIP mode bits to be sent after address phase of XIP transfer. */
  #define MSPI_XIPCORE_CORE_XIPMODEBITS_XIPMDBITS_Pos (0UL) /*!< Position of XIPMDBITS field.                                  */
  #define MSPI_XIPCORE_CORE_XIPMODEBITS_XIPMDBITS_Msk (0xFFFFUL << MSPI_XIPCORE_CORE_XIPMODEBITS_XIPMDBITS_Pos) /*!< Bit mask of
                                                                            XIPMDBITS field.*/

/* RSVDXIPMDBITS @Bits 16..31 : (unspecified) */
  #define MSPI_XIPCORE_CORE_XIPMODEBITS_RSVDXIPMDBITS_Pos (16UL) /*!< Position of RSVDXIPMDBITS field.                         */
  #define MSPI_XIPCORE_CORE_XIPMODEBITS_RSVDXIPMDBITS_Msk (0xFFFFUL << MSPI_XIPCORE_CORE_XIPMODEBITS_RSVDXIPMDBITS_Pos) /*!< Bit
                                                                            mask of RSVDXIPMDBITS field.*/


/* MSPI_XIPCORE_CORE_XIPINCRINST: XIP_INCR_INST - XIP INCR transfer opcode */
  #define MSPI_XIPCORE_CORE_XIPINCRINST_ResetValue (0x00000000UL) /*!< Reset value of XIPINCRINST register.                    */

/* INCRINST @Bits 0..15 : XIP INCR transfer opcode. */
  #define MSPI_XIPCORE_CORE_XIPINCRINST_INCRINST_Pos (0UL) /*!< Position of INCRINST field.                                    */
  #define MSPI_XIPCORE_CORE_XIPINCRINST_INCRINST_Msk (0xFFFFUL << MSPI_XIPCORE_CORE_XIPINCRINST_INCRINST_Pos) /*!< Bit mask of
                                                                            INCRINST field.*/

