NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* RSVDXIPCTRL25 @Bit 25 : (unspecified) */
  #define MSPI_XIPCORE_CORE_XIPCTRL_RSVDXIPCTRL25_Pos (25UL) /*!< Position of RSVDXIPCTRL25 field.                             */
  #define MSPI_XIPCORE_CORE_XIPCTRL_RSVDXIPCTRL25_Msk (0x1UL << MSPI_XIPCORE_CORE_XIPCTRL_RSVDXIPCTRL25_Pos) /*!< Bit mask of
                                                                            RSVDXIPCTRL25 field.*/

/* XIPMBL @Bits 26..27 : XIP Mode bits length. Sets the length of mode bits in XIP mode of operation. These bits are valid only
                         when XIP_CTRL.XIP_MD_BIT_EN is set to 1. */

  #define MSPI_XIPCORE_CORE_XIPCTRL_XIPMBL_Pos (26UL) /*!< Position of XIPMBL field.                                           */
  #define MSPI_XIPCORE_CORE_XIPCTRL_XIPMBL_Msk (0x3UL << MSPI_XIPCORE_CORE_XIPCTRL_XIPMBL_Pos) /*!< Bit mask of XIPMBL field.  */
  #define MSPI_XIPCORE_CORE_XIPCTRL_XIPMBL_Min (0x0UL) /*!< Min enumerator value of XIPMBL field.                              */
  #define MSPI_XIPCORE_CORE_XIPCTRL_XIPMBL_Max (0x3UL) /*!< Max enumerator value of XIPMBL field.                              */
  #define MSPI_XIPCORE_CORE_XIPCTRL_XIPMBL_MBL_2 (0x0UL) /*!< Mode bits length equal to 2                                      */
  #define MSPI_XIPCORE_CORE_XIPCTRL_XIPMBL_MBL_4 (0x1UL) /*!< Mode bits length equal to 4                                      */
  #define MSPI_XIPCORE_CORE_XIPCTRL_XIPMBL_MBL_8 (0x2UL) /*!< Mode bits length equal to 8                                      */
  #define MSPI_XIPCORE_CORE_XIPCTRL_XIPMBL_MBL_16 (0x3UL) /*!< Mode bits length equal to 16                                    */

/* RSVDXIPCTRL28 @Bit 28 : (unspecified) */
  #define MSPI_XIPCORE_CORE_XIPCTRL_RSVDXIPCTRL28_Pos (28UL) /*!< Position of RSVDXIPCTRL28 field.                             */
  #define MSPI_XIPCORE_CORE_XIPCTRL_RSVDXIPCTRL28_Msk (0x1UL << MSPI_XIPCORE_CORE_XIPCTRL_RSVDXIPCTRL28_Pos) /*!< Bit mask of
                                                                            RSVDXIPCTRL28 field.*/

/* XIPPREFETCHEN @Bit 29 : Enables XIP pre-fetch functionality in MSPI CORE. */
  #define MSPI_XIPCORE_CORE_XIPCTRL_XIPPREFETCHEN_Pos (29UL) /*!< Position of XIPPREFETCHEN field.                             */
  #define MSPI_XIPCORE_CORE_XIPCTRL_XIPPREFETCHEN_Msk (0x1UL << MSPI_XIPCORE_CORE_XIPCTRL_XIPPREFETCHEN_Pos) /*!< Bit mask of
                                                                            XIPPREFETCHEN field.*/

/* RSVDXIPCTRL30 @Bit 30 : (unspecified) */
  #define MSPI_XIPCORE_CORE_XIPCTRL_RSVDXIPCTRL30_Pos (30UL) /*!< Position of RSVDXIPCTRL30 field.                             */
  #define MSPI_XIPCORE_CORE_XIPCTRL_RSVDXIPCTRL30_Msk (0x1UL << MSPI_XIPCORE_CORE_XIPCTRL_RSVDXIPCTRL30_Pos) /*!< Bit mask of
                                                                            RSVDXIPCTRL30 field.*/

/* RSVDXIPCTRL @Bit 31 : (unspecified) */
  #define MSPI_XIPCORE_CORE_XIPCTRL_RSVDXIPCTRL_Pos (31UL) /*!< Position of RSVDXIPCTRL field.                                 */
  #define MSPI_XIPCORE_CORE_XIPCTRL_RSVDXIPCTRL_Msk (0x1UL << MSPI_XIPCORE_CORE_XIPCTRL_RSVDXIPCTRL_Pos) /*!< Bit mask of
                                                                            RSVDXIPCTRL field.*/


/* MSPI_XIPCORE_CORE_XIPSER: XIP Target Enable Register */
  #define MSPI_XIPCORE_CORE_XIPSER_ResetValue (0x00000000UL) /*!< Reset value of XIPSER register.                              */

/* SER @Bits 0..3 : Chip Select Enable Flag. */
  #define MSPI_XIPCORE_CORE_XIPSER_SER_Pos (0UL)     /*!< Position of SER field.                                               */
  #define MSPI_XIPCORE_CORE_XIPSER_SER_Msk (0xFUL << MSPI_XIPCORE_CORE_XIPSER_SER_Pos) /*!< Bit mask of SER field.             */

/* RSVDSER @Bits 4..31 : (unspecified) */
  #define MSPI_XIPCORE_CORE_XIPSER_RSVDSER_Pos (4UL) /*!< Position of RSVDSER field.                                           */
  #define MSPI_XIPCORE_CORE_XIPSER_RSVDSER_Msk (0xFFFFFFFUL << MSPI_XIPCORE_CORE_XIPSER_RSVDSER_Pos) /*!< Bit mask of RSVDSER
                                                                            field.*/


/* MSPI_XIPCORE_CORE_XRXOICR: XIP Receive FIFO Overflow Interrupt Clear Register */
  #define MSPI_XIPCORE_CORE_XRXOICR_ResetValue (0x00000000UL) /*!< Reset value of XRXOICR register.                            */

/* XRXOICR @Bit 0 : Clear XIP Receive FIFO Overflow Interrupt. */
  #define MSPI_XIPCORE_CORE_XRXOICR_XRXOICR_Pos (0UL) /*!< Position of XRXOICR field.                                          */
  #define MSPI_XIPCORE_CORE_XRXOICR_XRXOICR_Msk (0x1UL << MSPI_XIPCORE_CORE_XRXOICR_XRXOICR_Pos) /*!< Bit mask of XRXOICR
                                                                            field.*/

/* RSVDXRXOICR @Bits 1..31 : (unspecified) */
  #define MSPI_XIPCORE_CORE_XRXOICR_RSVDXRXOICR_Pos (1UL) /*!< Position of RSVDXRXOICR field.                                  */
  #define MSPI_XIPCORE_CORE_XRXOICR_RSVDXRXOICR_Msk (0x7FFFFFFFUL << MSPI_XIPCORE_CORE_XRXOICR_RSVDXRXOICR_Pos) /*!< Bit mask of
                                                                            RSVDXRXOICR field.*/


/* MSPI_XIPCORE_CORE_XIPCNTTIMEOUT: XIP time out register for continuous transfers */
  #define MSPI_XIPCORE_CORE_XIPCNTTIMEOUT_ResetValue (0x00000000UL) /*!< Reset value of XIPCNTTIMEOUT register.                */

/* XTOC @Bits 0..7 : XIP time out value in terms of hclk. Once target is selected in continuous XIP mode this counter will be
                     used to de-select the target if there is no request for the time specified in the counter. */

  #define MSPI_XIPCORE_CORE_XIPCNTTIMEOUT_XTOC_Pos (0UL) /*!< Position of XTOC field.                                          */
  #define MSPI_XIPCORE_CORE_XIPCNTTIMEOUT_XTOC_Msk (0xFFUL << MSPI_XIPCORE_CORE_XIPCNTTIMEOUT_XTOC_Pos) /*!< Bit mask of XTOC
                                                                            field.*/

/* RSVDXTOC @Bits 8..31 : (unspecified) */
  #define MSPI_XIPCORE_CORE_XIPCNTTIMEOUT_RSVDXTOC_Pos (8UL) /*!< Position of RSVDXTOC field.                                  */
  #define MSPI_XIPCORE_CORE_XIPCNTTIMEOUT_RSVDXTOC_Msk (0xFFFFFFUL << MSPI_XIPCORE_CORE_XIPCNTTIMEOUT_RSVDXTOC_Pos) /*!< Bit
                                                                            mask of RSVDXTOC field.*/


