NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* MSPI_XIPCORE_CORE_SPICTRLR1: SPI Control 1 register */
  #define MSPI_XIPCORE_CORE_SPICTRLR1_ResetValue (0x00000000UL) /*!< Reset value of SPICTRLR1 register.                        */

/* RSVDSPICTRLR102 @Bits 0..2 : (unspecified) */
  #define MSPI_XIPCORE_CORE_SPICTRLR1_RSVDSPICTRLR102_Pos (0UL) /*!< Position of RSVDSPICTRLR102 field.                        */
  #define MSPI_XIPCORE_CORE_SPICTRLR1_RSVDSPICTRLR102_Msk (0x7UL << MSPI_XIPCORE_CORE_SPICTRLR1_RSVDSPICTRLR102_Pos) /*!< Bit
                                                                            mask of RSVDSPICTRLR102 field.*/

/* RSVDSPICTRLR134 @Bits 3..4 : (unspecified) */
  #define MSPI_XIPCORE_CORE_SPICTRLR1_RSVDSPICTRLR134_Pos (3UL) /*!< Position of RSVDSPICTRLR134 field.                        */
  #define MSPI_XIPCORE_CORE_SPICTRLR1_RSVDSPICTRLR134_Msk (0x3UL << MSPI_XIPCORE_CORE_SPICTRLR1_RSVDSPICTRLR134_Pos) /*!< Bit
                                                                            mask of RSVDSPICTRLR134 field.*/

/* RSVDSPICTRLR158 @Bits 5..8 : (unspecified) */
  #define MSPI_XIPCORE_CORE_SPICTRLR1_RSVDSPICTRLR158_Pos (5UL) /*!< Position of RSVDSPICTRLR158 field.                        */
  #define MSPI_XIPCORE_CORE_SPICTRLR1_RSVDSPICTRLR158_Msk (0xFUL << MSPI_XIPCORE_CORE_SPICTRLR1_RSVDSPICTRLR158_Pos) /*!< Bit
                                                                            mask of RSVDSPICTRLR158 field.*/

/* RSVDSPICTRLR1 @Bits 9..15 : (unspecified) */
  #define MSPI_XIPCORE_CORE_SPICTRLR1_RSVDSPICTRLR1_Pos (9UL) /*!< Position of RSVDSPICTRLR1 field.                            */
  #define MSPI_XIPCORE_CORE_SPICTRLR1_RSVDSPICTRLR1_Msk (0x7FUL << MSPI_XIPCORE_CORE_SPICTRLR1_RSVDSPICTRLR1_Pos) /*!< Bit mask
                                                                            of RSVDSPICTRLR1 field.*/

/* CSMINHIGH @Bits 16..19 : Chip-Select Minimum HIGH period. */
  #define MSPI_XIPCORE_CORE_SPICTRLR1_CSMINHIGH_Pos (16UL) /*!< Position of CSMINHIGH field.                                   */
  #define MSPI_XIPCORE_CORE_SPICTRLR1_CSMINHIGH_Msk (0xFUL << MSPI_XIPCORE_CORE_SPICTRLR1_CSMINHIGH_Pos) /*!< Bit mask of
                                                                            CSMINHIGH field.*/

/* RSVDSPICTRLR12031 @Bits 20..31 : (unspecified) */
  #define MSPI_XIPCORE_CORE_SPICTRLR1_RSVDSPICTRLR12031_Pos (20UL) /*!< Position of RSVDSPICTRLR12031 field.                   */
  #define MSPI_XIPCORE_CORE_SPICTRLR1_RSVDSPICTRLR12031_Msk (0xFFFUL << MSPI_XIPCORE_CORE_SPICTRLR1_RSVDSPICTRLR12031_Pos) /*!<
                                                                            Bit mask of RSVDSPICTRLR12031 field.*/



/* =================================================== Struct MSPI_XIPCORE =================================================== */
/**
  * @brief XIPCORE [MSPI_XIPCORE] (unspecified)
  */
typedef struct {
  __IOM NRF_MSPI_XIPCORE_CORE_Type CORE;             /*!< (@ 0x00000000) (unspecified)                                         */
} NRF_MSPI_XIPCORE_Type;                             /*!< Size = 512 (0x200)                                                   */

/* ======================================================= Struct MSPI ======================================================= */
/**
  * @brief Multi serial peripheral interface
  */
  typedef struct {                                   /*!< MSPI Structure                                                       */
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000000) Start operation.                                      */
    __OM uint32_t TASKS_RESET;                       /*!< (@ 0x00000004) Reset the MSPI                                        */
    __OM uint32_t TASKS_ACQUIRESEMAPHORE;            /*!< (@ 0x00000008) Request the semaphore This task is exclusive to the
                                                                         'peripheral' configuration*/
    __OM uint32_t TASKS_RELEASESEMAPHORE;            /*!< (@ 0x0000000C) Release the semaphore This task is exclusive to the
                                                                         'peripheral' configuration*/
    __IM uint32_t RESERVED[60];
    __IOM uint32_t EVENTS_CORE;                      /*!< (@ 0x00000100) Interrupt from the MSPI core                          */
    __IOM NRF_MSPI_EVENTS_DMA_Type EVENTS_DMA;       /*!< (@ 0x00000104) Peripheral events.                                    */
    __IOM uint32_t EVENTS_IDLE;                      /*!< (@ 0x00000134) This event signifies that the MSPI core is no longer
                                                                         busy*/
    __IOM uint32_t EVENTS_OVERFLOW;                  /*!< (@ 0x00000138) The MSPI peripheral has received the specified number
                                                                         of bytes. Any data received after this event will be
                                                                         discarded if a new RX buffer has not been configured.
                                                                         This event is exclusive to the 'peripheral'
                                                                         configuration*/
    __IM uint32_t RESERVED1;
    __IOM uint32_t EVENTS_ACQUIRED;                  /*!< (@ 0x00000140) The semaphore has been acquired by the CPU This event
                                                                         is exclusive to the 'peripheral' configuration*/
    __IM uint32_t RESERVED2[47];
    __IOM uint32_t SHORTS;                           /*!< (@ 0x00000200) Shortcuts between local events and tasks              */
    __IM uint32_t RESERVED3[63];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED4[60];
    __IOM uint32_t ENABLE;                           /*!< (@ 0x00000400) Enables the MSPI                                      */
    __IOM NRF_MSPI_CONFIG_Type CONFIG;               /*!< (@ 0x00000404) (unspecified)                                         */
    __IM uint32_t RESERVED5;
    __IOM NRF_MSPI_FORMAT_Type FORMAT;               /*!< (@ 0x00000418) (unspecified)                                         */
    __IOM NRF_MSPI_CUSTCMD_Type CUSTCMD;             /*!< (@ 0x0000042C) (unspecified)                                         */
    __IM uint32_t RESERVED6[15];
    __IOM uint32_t PINOECONTROL;                     /*!< (@ 0x00000470) Override and control the output enable signal to the
                                                                         GPIO pads*/
    __IM uint32_t RESERVED7[7];
    __IOM uint32_t TMOD;                             /*!< (@ 0x00000490) Transfer Mode of the MSPI when used as peripheral This
                                                                         register is exclusive to the 'peripheral'
                                                                         configuration*/
    __IOM uint32_t ENDON;                            /*!< (@ 0x00000494) End the DMA if the MSPI meets any of the defined states
                                                                         This task is exclusive to the 'peripheral'
                                                                         configuration*/
    __IM uint32_t RESERVED8[6];
    __IOM NRF_MSPI_RXD_Type RXD;                     /*!< (@ 0x000004B0) (unspecified)                                         */
    __IM uint32_t RESERVED9[7];
    __IOM NRF_MSPI_TXD_Type TXD;                     /*!< (@ 0x000004D0) (unspecified)                                         */
    __IM uint32_t RESERVED10[11];
    __IOM NRF_MSPI_DMA_Type DMA;                     /*!< (@ 0x00000500) (unspecified)                                         */
    __IM uint32_t RESERVED11[189];
    #if defined(_GNUC_)
      #pragma GCC diagnostic push
      #pragma GCC diagnostic ignored "-Wpedantic"
    #endif
    union {
      __IOM NRF_MSPI_CONTROLLERCORE_Type CONTROLLERCORE; /*!< (@ 0x00000900) (unspecified)                                     */
      __IOM NRF_MSPI_PERIPHERALCORE_Type PERIPHERALCORE; /*!< (@ 0x00000900) (unspecified)                                     */
      __IOM NRF_MSPI_XIPCORE_Type XIPCORE;           /*!< (@ 0x00000900) (unspecified)                                         */
    };
    #if defined(_GNUC_)
      #pragma GCC diagnostic pop
    #endif
  } NRF_MSPI_Type;                                   /*!< Size = 2816 (0xB00)                                                  */

/* MSPI_TASKS_START: Start operation. */
  #define MSPI_TASKS_START_ResetValue (0x00000000UL) /*!< Reset value of TASKS_START register.                                 */

