NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* TASKS_START @Bit 0 : Start operation. */
  #define MSPI_TASKS_START_TASKS_START_Pos (0UL)     /*!< Position of TASKS_START field.                                       */
  #define MSPI_TASKS_START_TASKS_START_Msk (0x1UL << MSPI_TASKS_START_TASKS_START_Pos) /*!< Bit mask of TASKS_START field.     */
  #define MSPI_TASKS_START_TASKS_START_Min (0x1UL)   /*!< Min enumerator value of TASKS_START field.                           */
  #define MSPI_TASKS_START_TASKS_START_Max (0x1UL)   /*!< Max enumerator value of TASKS_START field.                           */
  #define MSPI_TASKS_START_TASKS_START_Trigger (0x1UL) /*!< Trigger task                                                       */


/* MSPI_TASKS_RESET: Reset the MSPI */
  #define MSPI_TASKS_RESET_ResetValue (0x00000000UL) /*!< Reset value of TASKS_RESET register.                                 */

/* TASKS_RESET @Bit 0 : Reset the MSPI */
  #define MSPI_TASKS_RESET_TASKS_RESET_Pos (0UL)     /*!< Position of TASKS_RESET field.                                       */
  #define MSPI_TASKS_RESET_TASKS_RESET_Msk (0x1UL << MSPI_TASKS_RESET_TASKS_RESET_Pos) /*!< Bit mask of TASKS_RESET field.     */
  #define MSPI_TASKS_RESET_TASKS_RESET_Min (0x1UL)   /*!< Min enumerator value of TASKS_RESET field.                           */
  #define MSPI_TASKS_RESET_TASKS_RESET_Max (0x1UL)   /*!< Max enumerator value of TASKS_RESET field.                           */
  #define MSPI_TASKS_RESET_TASKS_RESET_Trigger (0x1UL) /*!< Trigger task                                                       */


/* MSPI_TASKS_ACQUIRESEMAPHORE: Request the semaphore This task is exclusive to the 'peripheral' configuration */
  #define MSPI_TASKS_ACQUIRESEMAPHORE_ResetValue (0x00000000UL) /*!< Reset value of TASKS_ACQUIRESEMAPHORE register.           */

/* TASKS_ACQUIRESEMAPHORE @Bit 0 : Request the semaphore This task is exclusive to the 'peripheral' configuration */
  #define MSPI_TASKS_ACQUIRESEMAPHORE_TASKS_ACQUIRESEMAPHORE_Pos (0UL) /*!< Position of TASKS_ACQUIRESEMAPHORE field.          */
  #define MSPI_TASKS_ACQUIRESEMAPHORE_TASKS_ACQUIRESEMAPHORE_Msk (0x1UL << MSPI_TASKS_ACQUIRESEMAPHORE_TASKS_ACQUIRESEMAPHORE_Pos)
                                                                            /*!< Bit mask of TASKS_ACQUIRESEMAPHORE field.*/
  #define MSPI_TASKS_ACQUIRESEMAPHORE_TASKS_ACQUIRESEMAPHORE_Min (0x1UL) /*!< Min enumerator value of TASKS_ACQUIRESEMAPHORE
                                                                            field.*/
  #define MSPI_TASKS_ACQUIRESEMAPHORE_TASKS_ACQUIRESEMAPHORE_Max (0x1UL) /*!< Max enumerator value of TASKS_ACQUIRESEMAPHORE
                                                                            field.*/
  #define MSPI_TASKS_ACQUIRESEMAPHORE_TASKS_ACQUIRESEMAPHORE_Trigger (0x1UL) /*!< Trigger task                                 */


/* MSPI_TASKS_RELEASESEMAPHORE: Release the semaphore This task is exclusive to the 'peripheral' configuration */
  #define MSPI_TASKS_RELEASESEMAPHORE_ResetValue (0x00000000UL) /*!< Reset value of TASKS_RELEASESEMAPHORE register.           */

/* TASKS_RELEASESEMAPHORE @Bit 0 : Release the semaphore This task is exclusive to the 'peripheral' configuration */
  #define MSPI_TASKS_RELEASESEMAPHORE_TASKS_RELEASESEMAPHORE_Pos (0UL) /*!< Position of TASKS_RELEASESEMAPHORE field.          */
  #define MSPI_TASKS_RELEASESEMAPHORE_TASKS_RELEASESEMAPHORE_Msk (0x1UL << MSPI_TASKS_RELEASESEMAPHORE_TASKS_RELEASESEMAPHORE_Pos)
                                                                            /*!< Bit mask of TASKS_RELEASESEMAPHORE field.*/
  #define MSPI_TASKS_RELEASESEMAPHORE_TASKS_RELEASESEMAPHORE_Min (0x1UL) /*!< Min enumerator value of TASKS_RELEASESEMAPHORE
                                                                            field.*/
  #define MSPI_TASKS_RELEASESEMAPHORE_TASKS_RELEASESEMAPHORE_Max (0x1UL) /*!< Max enumerator value of TASKS_RELEASESEMAPHORE
                                                                            field.*/
  #define MSPI_TASKS_RELEASESEMAPHORE_TASKS_RELEASESEMAPHORE_Trigger (0x1UL) /*!< Trigger task                                 */


/* MSPI_EVENTS_CORE: Interrupt from the MSPI core */
  #define MSPI_EVENTS_CORE_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_CORE register.                                 */

/* EVENTS_CORE @Bit 0 : Interrupt from the MSPI core */
  #define MSPI_EVENTS_CORE_EVENTS_CORE_Pos (0UL)     /*!< Position of EVENTS_CORE field.                                       */
  #define MSPI_EVENTS_CORE_EVENTS_CORE_Msk (0x1UL << MSPI_EVENTS_CORE_EVENTS_CORE_Pos) /*!< Bit mask of EVENTS_CORE field.     */
  #define MSPI_EVENTS_CORE_EVENTS_CORE_Min (0x0UL)   /*!< Min enumerator value of EVENTS_CORE field.                           */
  #define MSPI_EVENTS_CORE_EVENTS_CORE_Max (0x1UL)   /*!< Max enumerator value of EVENTS_CORE field.                           */
  #define MSPI_EVENTS_CORE_EVENTS_CORE_NotGenerated (0x0UL) /*!< Event not generated                                           */
  #define MSPI_EVENTS_CORE_EVENTS_CORE_Generated (0x1UL) /*!< Event generated                                                  */


/* MSPI_EVENTS_IDLE: This event signifies that the MSPI core is no longer busy */
  #define MSPI_EVENTS_IDLE_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_IDLE register.                                 */

/* EVENTS_IDLE @Bit 0 : This event signifies that the MSPI core is no longer busy */
  #define MSPI_EVENTS_IDLE_EVENTS_IDLE_Pos (0UL)     /*!< Position of EVENTS_IDLE field.                                       */
  #define MSPI_EVENTS_IDLE_EVENTS_IDLE_Msk (0x1UL << MSPI_EVENTS_IDLE_EVENTS_IDLE_Pos) /*!< Bit mask of EVENTS_IDLE field.     */
  #define MSPI_EVENTS_IDLE_EVENTS_IDLE_Min (0x0UL)   /*!< Min enumerator value of EVENTS_IDLE field.                           */
  #define MSPI_EVENTS_IDLE_EVENTS_IDLE_Max (0x1UL)   /*!< Max enumerator value of EVENTS_IDLE field.                           */
  #define MSPI_EVENTS_IDLE_EVENTS_IDLE_NotGenerated (0x0UL) /*!< Event not generated                                           */
  #define MSPI_EVENTS_IDLE_EVENTS_IDLE_Generated (0x1UL) /*!< Event generated                                                  */


