NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* DMADONELIST @Bit 1 : Write '1' to disable interrupt for event DMADONELIST */
  #define MSPI_INTENCLR_DMADONELIST_Pos (1UL)        /*!< Position of DMADONELIST field.                                       */
  #define MSPI_INTENCLR_DMADONELIST_Msk (0x1UL << MSPI_INTENCLR_DMADONELIST_Pos) /*!< Bit mask of DMADONELIST field.           */
  #define MSPI_INTENCLR_DMADONELIST_Min (0x0UL)      /*!< Min enumerator value of DMADONELIST field.                           */
  #define MSPI_INTENCLR_DMADONELIST_Max (0x1UL)      /*!< Max enumerator value of DMADONELIST field.                           */
  #define MSPI_INTENCLR_DMADONELIST_Clear (0x1UL)    /*!< Disable                                                              */
  #define MSPI_INTENCLR_DMADONELIST_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define MSPI_INTENCLR_DMADONELIST_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* DMADONELISTPART @Bit 2 : Write '1' to disable interrupt for event DMADONELISTPART */
  #define MSPI_INTENCLR_DMADONELISTPART_Pos (2UL)    /*!< Position of DMADONELISTPART field.                                   */
  #define MSPI_INTENCLR_DMADONELISTPART_Msk (0x1UL << MSPI_INTENCLR_DMADONELISTPART_Pos) /*!< Bit mask of DMADONELISTPART
                                                                            field.*/
  #define MSPI_INTENCLR_DMADONELISTPART_Min (0x0UL)  /*!< Min enumerator value of DMADONELISTPART field.                       */
  #define MSPI_INTENCLR_DMADONELISTPART_Max (0x1UL)  /*!< Max enumerator value of DMADONELISTPART field.                       */
  #define MSPI_INTENCLR_DMADONELISTPART_Clear (0x1UL) /*!< Disable                                                             */
  #define MSPI_INTENCLR_DMADONELISTPART_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define MSPI_INTENCLR_DMADONELISTPART_Enabled (0x1UL) /*!< Read: Enabled                                                     */

/* DMADONESELECTJOB @Bit 3 : Write '1' to disable interrupt for event DMADONESELECTJOB */
  #define MSPI_INTENCLR_DMADONESELECTJOB_Pos (3UL)   /*!< Position of DMADONESELECTJOB field.                                  */
  #define MSPI_INTENCLR_DMADONESELECTJOB_Msk (0x1UL << MSPI_INTENCLR_DMADONESELECTJOB_Pos) /*!< Bit mask of DMADONESELECTJOB
                                                                            field.*/
  #define MSPI_INTENCLR_DMADONESELECTJOB_Min (0x0UL) /*!< Min enumerator value of DMADONESELECTJOB field.                      */
  #define MSPI_INTENCLR_DMADONESELECTJOB_Max (0x1UL) /*!< Max enumerator value of DMADONESELECTJOB field.                      */
  #define MSPI_INTENCLR_DMADONESELECTJOB_Clear (0x1UL) /*!< Disable                                                            */
  #define MSPI_INTENCLR_DMADONESELECTJOB_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define MSPI_INTENCLR_DMADONESELECTJOB_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* DMADONEDATA @Bit 4 : Write '1' to disable interrupt for event DMADONEDATA */
  #define MSPI_INTENCLR_DMADONEDATA_Pos (4UL)        /*!< Position of DMADONEDATA field.                                       */
  #define MSPI_INTENCLR_DMADONEDATA_Msk (0x1UL << MSPI_INTENCLR_DMADONEDATA_Pos) /*!< Bit mask of DMADONEDATA field.           */
  #define MSPI_INTENCLR_DMADONEDATA_Min (0x0UL)      /*!< Min enumerator value of DMADONEDATA field.                           */
  #define MSPI_INTENCLR_DMADONEDATA_Max (0x1UL)      /*!< Max enumerator value of DMADONEDATA field.                           */
  #define MSPI_INTENCLR_DMADONEDATA_Clear (0x1UL)    /*!< Disable                                                              */
  #define MSPI_INTENCLR_DMADONEDATA_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define MSPI_INTENCLR_DMADONEDATA_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* DMADONEJOB @Bit 5 : Write '1' to disable interrupt for event DMADONEJOB */
  #define MSPI_INTENCLR_DMADONEJOB_Pos (5UL)         /*!< Position of DMADONEJOB field.                                        */
  #define MSPI_INTENCLR_DMADONEJOB_Msk (0x1UL << MSPI_INTENCLR_DMADONEJOB_Pos) /*!< Bit mask of DMADONEJOB field.              */
  #define MSPI_INTENCLR_DMADONEJOB_Min (0x0UL)       /*!< Min enumerator value of DMADONEJOB field.                            */
  #define MSPI_INTENCLR_DMADONEJOB_Max (0x1UL)       /*!< Max enumerator value of DMADONEJOB field.                            */
  #define MSPI_INTENCLR_DMADONEJOB_Clear (0x1UL)     /*!< Disable                                                              */
  #define MSPI_INTENCLR_DMADONEJOB_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define MSPI_INTENCLR_DMADONEJOB_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* DMAERROR @Bit 6 : Write '1' to disable interrupt for event DMAERROR */
  #define MSPI_INTENCLR_DMAERROR_Pos (6UL)           /*!< Position of DMAERROR field.                                          */
  #define MSPI_INTENCLR_DMAERROR_Msk (0x1UL << MSPI_INTENCLR_DMAERROR_Pos) /*!< Bit mask of DMAERROR field.                    */
  #define MSPI_INTENCLR_DMAERROR_Min (0x0UL)         /*!< Min enumerator value of DMAERROR field.                              */
  #define MSPI_INTENCLR_DMAERROR_Max (0x1UL)         /*!< Max enumerator value of DMAERROR field.                              */
  #define MSPI_INTENCLR_DMAERROR_Clear (0x1UL)       /*!< Disable                                                              */
  #define MSPI_INTENCLR_DMAERROR_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define MSPI_INTENCLR_DMAERROR_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* DMAPAUSED @Bit 7 : Write '1' to disable interrupt for event DMAPAUSED */
  #define MSPI_INTENCLR_DMAPAUSED_Pos (7UL)          /*!< Position of DMAPAUSED field.                                         */
  #define MSPI_INTENCLR_DMAPAUSED_Msk (0x1UL << MSPI_INTENCLR_DMAPAUSED_Pos) /*!< Bit mask of DMAPAUSED field.                 */
  #define MSPI_INTENCLR_DMAPAUSED_Min (0x0UL)        /*!< Min enumerator value of DMAPAUSED field.                             */
  #define MSPI_INTENCLR_DMAPAUSED_Max (0x1UL)        /*!< Max enumerator value of DMAPAUSED field.                             */
  #define MSPI_INTENCLR_DMAPAUSED_Clear (0x1UL)      /*!< Disable                                                              */
  #define MSPI_INTENCLR_DMAPAUSED_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define MSPI_INTENCLR_DMAPAUSED_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* DMARESET @Bit 8 : Write '1' to disable interrupt for event DMARESET */
  #define MSPI_INTENCLR_DMARESET_Pos (8UL)           /*!< Position of DMARESET field.                                          */
  #define MSPI_INTENCLR_DMARESET_Msk (0x1UL << MSPI_INTENCLR_DMARESET_Pos) /*!< Bit mask of DMARESET field.                    */
  #define MSPI_INTENCLR_DMARESET_Min (0x0UL)         /*!< Min enumerator value of DMARESET field.                              */
  #define MSPI_INTENCLR_DMARESET_Max (0x1UL)         /*!< Max enumerator value of DMARESET field.                              */
  #define MSPI_INTENCLR_DMARESET_Clear (0x1UL)       /*!< Disable                                                              */
  #define MSPI_INTENCLR_DMARESET_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define MSPI_INTENCLR_DMARESET_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* DMADONE @Bit 9 : Write '1' to disable interrupt for event DMADONE */
  #define MSPI_INTENCLR_DMADONE_Pos (9UL)            /*!< Position of DMADONE field.                                           */
  #define MSPI_INTENCLR_DMADONE_Msk (0x1UL << MSPI_INTENCLR_DMADONE_Pos) /*!< Bit mask of DMADONE field.                       */
  #define MSPI_INTENCLR_DMADONE_Min (0x0UL)          /*!< Min enumerator value of DMADONE field.                               */
  #define MSPI_INTENCLR_DMADONE_Max (0x1UL)          /*!< Max enumerator value of DMADONE field.                               */
  #define MSPI_INTENCLR_DMADONE_Clear (0x1UL)        /*!< Disable                                                              */
  #define MSPI_INTENCLR_DMADONE_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define MSPI_INTENCLR_DMADONE_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* DMATXUNEXPECTEDIDLE @Bit 10 : Write '1' to disable interrupt for event DMATXUNEXPECTEDIDLE */
  #define MSPI_INTENCLR_DMATXUNEXPECTEDIDLE_Pos (10UL) /*!< Position of DMATXUNEXPECTEDIDLE field.                             */
  #define MSPI_INTENCLR_DMATXUNEXPECTEDIDLE_Msk (0x1UL << MSPI_INTENCLR_DMATXUNEXPECTEDIDLE_Pos) /*!< Bit mask of
                                                                            DMATXUNEXPECTEDIDLE field.*/
  #define MSPI_INTENCLR_DMATXUNEXPECTEDIDLE_Min (0x0UL) /*!< Min enumerator value of DMATXUNEXPECTEDIDLE field.                */
  #define MSPI_INTENCLR_DMATXUNEXPECTEDIDLE_Max (0x1UL) /*!< Max enumerator value of DMATXUNEXPECTEDIDLE field.                */
  #define MSPI_INTENCLR_DMATXUNEXPECTEDIDLE_Clear (0x1UL) /*!< Disable                                                         */
  #define MSPI_INTENCLR_DMATXUNEXPECTEDIDLE_Disabled (0x0UL) /*!< Read: Disabled                                               */
  #define MSPI_INTENCLR_DMATXUNEXPECTEDIDLE_Enabled (0x1UL) /*!< Read: Enabled                                                 */

/* DMAINTERNALBUSERROR @Bit 11 : Write '1' to disable interrupt for event DMAINTERNALBUSERROR */
  #define MSPI_INTENCLR_DMAINTERNALBUSERROR_Pos (11UL) /*!< Position of DMAINTERNALBUSERROR field.                             */
  #define MSPI_INTENCLR_DMAINTERNALBUSERROR_Msk (0x1UL << MSPI_INTENCLR_DMAINTERNALBUSERROR_Pos) /*!< Bit mask of
                                                                            DMAINTERNALBUSERROR field.*/
  #define MSPI_INTENCLR_DMAINTERNALBUSERROR_Min (0x0UL) /*!< Min enumerator value of DMAINTERNALBUSERROR field.                */
  #define MSPI_INTENCLR_DMAINTERNALBUSERROR_Max (0x1UL) /*!< Max enumerator value of DMAINTERNALBUSERROR field.                */
  #define MSPI_INTENCLR_DMAINTERNALBUSERROR_Clear (0x1UL) /*!< Disable                                                         */
  #define MSPI_INTENCLR_DMAINTERNALBUSERROR_Disabled (0x0UL) /*!< Read: Disabled                                               */
  #define MSPI_INTENCLR_DMAINTERNALBUSERROR_Enabled (0x1UL) /*!< Read: Enabled                                                 */

/* DMAABORTED @Bit 12 : Write '1' to disable interrupt for event DMAABORTED */
  #define MSPI_INTENCLR_DMAABORTED_Pos (12UL)        /*!< Position of DMAABORTED field.                                        */
  #define MSPI_INTENCLR_DMAABORTED_Msk (0x1UL << MSPI_INTENCLR_DMAABORTED_Pos) /*!< Bit mask of DMAABORTED field.              */
  #define MSPI_INTENCLR_DMAABORTED_Min (0x0UL)       /*!< Min enumerator value of DMAABORTED field.                            */
  #define MSPI_INTENCLR_DMAABORTED_Max (0x1UL)       /*!< Max enumerator value of DMAABORTED field.                            */
  #define MSPI_INTENCLR_DMAABORTED_Clear (0x1UL)     /*!< Disable                                                              */
  #define MSPI_INTENCLR_DMAABORTED_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define MSPI_INTENCLR_DMAABORTED_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* IDLE @Bit 13 : Write '1' to disable interrupt for event IDLE */
  #define MSPI_INTENCLR_IDLE_Pos (13UL)              /*!< Position of IDLE field.                                              */
  #define MSPI_INTENCLR_IDLE_Msk (0x1UL << MSPI_INTENCLR_IDLE_Pos) /*!< Bit mask of IDLE field.                                */
  #define MSPI_INTENCLR_IDLE_Min (0x0UL)             /*!< Min enumerator value of IDLE field.                                  */
  #define MSPI_INTENCLR_IDLE_Max (0x1UL)             /*!< Max enumerator value of IDLE field.                                  */
  #define MSPI_INTENCLR_IDLE_Clear (0x1UL)           /*!< Disable                                                              */
  #define MSPI_INTENCLR_IDLE_Disabled (0x0UL)        /*!< Read: Disabled                                                       */
  #define MSPI_INTENCLR_IDLE_Enabled (0x1UL)         /*!< Read: Enabled                                                        */

/* OVERFLOW @Bit 14 : Write '1' to disable interrupt for event OVERFLOW */
  #define MSPI_INTENCLR_OVERFLOW_Pos (14UL)          /*!< Position of OVERFLOW field.                                          */
  #define MSPI_INTENCLR_OVERFLOW_Msk (0x1UL << MSPI_INTENCLR_OVERFLOW_Pos) /*!< Bit mask of OVERFLOW field.                    */
  #define MSPI_INTENCLR_OVERFLOW_Min (0x0UL)         /*!< Min enumerator value of OVERFLOW field.                              */
  #define MSPI_INTENCLR_OVERFLOW_Max (0x1UL)         /*!< Max enumerator value of OVERFLOW field.                              */
  #define MSPI_INTENCLR_OVERFLOW_Clear (0x1UL)       /*!< Disable                                                              */
  #define MSPI_INTENCLR_OVERFLOW_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define MSPI_INTENCLR_OVERFLOW_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* ACQUIRED @Bit 16 : Write '1' to disable interrupt for event ACQUIRED */
  #define MSPI_INTENCLR_ACQUIRED_Pos (16UL)          /*!< Position of ACQUIRED field.                                          */
  #define MSPI_INTENCLR_ACQUIRED_Msk (0x1UL << MSPI_INTENCLR_ACQUIRED_Pos) /*!< Bit mask of ACQUIRED field.                    */
  #define MSPI_INTENCLR_ACQUIRED_Min (0x0UL)         /*!< Min enumerator value of ACQUIRED field.                              */
  #define MSPI_INTENCLR_ACQUIRED_Max (0x1UL)         /*!< Max enumerator value of ACQUIRED field.                              */
  #define MSPI_INTENCLR_ACQUIRED_Clear (0x1UL)       /*!< Disable                                                              */
  #define MSPI_INTENCLR_ACQUIRED_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define MSPI_INTENCLR_ACQUIRED_Enabled (0x1UL)     /*!< Read: Enabled                                                        */


/* MSPI_INTPEND: Pending interrupts */
  #define MSPI_INTPEND_ResetValue (0x00000000UL)     /*!< Reset value of INTPEND register.                                     */

/* CORE @Bit 0 : Read pending status of interrupt for event CORE */
  #define MSPI_INTPEND_CORE_Pos (0UL)                /*!< Position of CORE field.                                              */
  #define MSPI_INTPEND_CORE_Msk (0x1UL << MSPI_INTPEND_CORE_Pos) /*!< Bit mask of CORE field.                                  */
  #define MSPI_INTPEND_CORE_Min (0x0UL)              /*!< Min enumerator value of CORE field.                                  */
  #define MSPI_INTPEND_CORE_Max (0x1UL)              /*!< Max enumerator value of CORE field.                                  */
  #define MSPI_INTPEND_CORE_NotPending (0x0UL)       /*!< Read: Not pending                                                    */
  #define MSPI_INTPEND_CORE_Pending (0x1UL)          /*!< Read: Pending                                                        */

/* DMADONELIST @Bit 1 : Read pending status of interrupt for event DMADONELIST */
  #define MSPI_INTPEND_DMADONELIST_Pos (1UL)         /*!< Position of DMADONELIST field.                                       */
  #define MSPI_INTPEND_DMADONELIST_Msk (0x1UL << MSPI_INTPEND_DMADONELIST_Pos) /*!< Bit mask of DMADONELIST field.             */
  #define MSPI_INTPEND_DMADONELIST_Min (0x0UL)       /*!< Min enumerator value of DMADONELIST field.                           */
  #define MSPI_INTPEND_DMADONELIST_Max (0x1UL)       /*!< Max enumerator value of DMADONELIST field.                           */
  #define MSPI_INTPEND_DMADONELIST_NotPending (0x0UL) /*!< Read: Not pending                                                   */
  #define MSPI_INTPEND_DMADONELIST_Pending (0x1UL)   /*!< Read: Pending                                                        */

/* DMADONELISTPART @Bit 2 : Read pending status of interrupt for event DMADONELISTPART */
  #define MSPI_INTPEND_DMADONELISTPART_Pos (2UL)     /*!< Position of DMADONELISTPART field.                                   */
  #define MSPI_INTPEND_DMADONELISTPART_Msk (0x1UL << MSPI_INTPEND_DMADONELISTPART_Pos) /*!< Bit mask of DMADONELISTPART field. */
  #define MSPI_INTPEND_DMADONELISTPART_Min (0x0UL)   /*!< Min enumerator value of DMADONELISTPART field.                       */
  #define MSPI_INTPEND_DMADONELISTPART_Max (0x1UL)   /*!< Max enumerator value of DMADONELISTPART field.                       */
  #define MSPI_INTPEND_DMADONELISTPART_NotPending (0x0UL) /*!< Read: Not pending                                               */
  #define MSPI_INTPEND_DMADONELISTPART_Pending (0x1UL) /*!< Read: Pending                                                      */

