NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* FORCEOFF @Bits 12..15 : Force pin direction to be input */
  #define MSPI_PINOECONTROL_FORCEOFF_Pos (12UL)      /*!< Position of FORCEOFF field.                                          */
  #define MSPI_PINOECONTROL_FORCEOFF_Msk (0xFUL << MSPI_PINOECONTROL_FORCEOFF_Pos) /*!< Bit mask of FORCEOFF field.            */
  #define MSPI_PINOECONTROL_FORCEOFF_Min (0x0UL)     /*!< Min enumerator value of FORCEOFF field.                              */
  #define MSPI_PINOECONTROL_FORCEOFF_Max (0xFUL)     /*!< Max enumerator value of FORCEOFF field.                              */
  #define MSPI_PINOECONTROL_FORCEOFF_EnableIO0 (0x1UL) /*!< Forcing off enabled output for IO0                                 */
  #define MSPI_PINOECONTROL_FORCEOFF_EnableIO1 (0x2UL) /*!< Forcing off enabled output for IO1                                 */
  #define MSPI_PINOECONTROL_FORCEOFF_EnableIO2 (0x4UL) /*!< Forcing off enabled output for IO2                                 */
  #define MSPI_PINOECONTROL_FORCEOFF_EnableIO3 (0x8UL) /*!< Forcing off enabled output for IO3                                 */
  #define MSPI_PINOECONTROL_FORCEOFF_EnableAll (0xFUL) /*!< Forcing off enabled output for all data lines                      */
  #define MSPI_PINOECONTROL_FORCEOFF_Disabled (0x0UL) /*!< Forcing off Output Enable is disabled                               */

/* TURNAROUNDON @Bits 24..31 : Time needed for pin output driver to turn on (in core clock cycles) */
  #define MSPI_PINOECONTROL_TURNAROUNDON_Pos (24UL)  /*!< Position of TURNAROUNDON field.                                      */
  #define MSPI_PINOECONTROL_TURNAROUNDON_Msk (0xFFUL << MSPI_PINOECONTROL_TURNAROUNDON_Pos) /*!< Bit mask of TURNAROUNDON
                                                                            field.*/
  #define MSPI_PINOECONTROL_TURNAROUNDON_Min (0x00UL) /*!< Min enumerator value of TURNAROUNDON field.                         */
  #define MSPI_PINOECONTROL_TURNAROUNDON_Max (0x00UL) /*!< Max enumerator value of TURNAROUNDON field.                         */
  #define MSPI_PINOECONTROL_TURNAROUNDON_Disabled (0x00UL) /*!< (unspecified)                                                  */


/* MSPI_TMOD: Transfer Mode of the MSPI when used as peripheral This register is exclusive to the 'peripheral' configuration */
  #define MSPI_TMOD_ResetValue (0x00000000UL)        /*!< Reset value of TMOD register.                                        */

/* TMOD @Bits 0..1 : (unspecified) */
  #define MSPI_TMOD_TMOD_Pos (0UL)                   /*!< Position of TMOD field.                                              */
  #define MSPI_TMOD_TMOD_Msk (0x3UL << MSPI_TMOD_TMOD_Pos) /*!< Bit mask of TMOD field.                                        */
  #define MSPI_TMOD_TMOD_Min (0x1UL)                 /*!< Min enumerator value of TMOD field.                                  */
  #define MSPI_TMOD_TMOD_Max (0x2UL)                 /*!< Max enumerator value of TMOD field.                                  */
  #define MSPI_TMOD_TMOD_TXONLY (0x1UL)              /*!< Transmit only mode; Or Write in enhanced SPI operating mode          */
  #define MSPI_TMOD_TMOD_RXONLY (0x2UL)              /*!< Receive only mode; Or Read in enhanced SPI operating mode            */


/* MSPI_ENDON: End the DMA if the MSPI meets any of the defined states This task is exclusive to the 'peripheral' configuration
                */

  #define MSPI_ENDON_ResetValue (0x00000003UL)       /*!< Reset value of ENDON register.                                       */

/* TRANSFERLENGHT @Bit 0 : End the DMA transaction when the transferlength has been met */
  #define MSPI_ENDON_TRANSFERLENGHT_Pos (0UL)        /*!< Position of TRANSFERLENGHT field.                                    */
  #define MSPI_ENDON_TRANSFERLENGHT_Msk (0x1UL << MSPI_ENDON_TRANSFERLENGHT_Pos) /*!< Bit mask of TRANSFERLENGHT field.        */

/* CHIPSELECT @Bit 1 : End the DMA transaction when chip select goes inactive */
  #define MSPI_ENDON_CHIPSELECT_Pos (1UL)            /*!< Position of CHIPSELECT field.                                        */
  #define MSPI_ENDON_CHIPSELECT_Msk (0x1UL << MSPI_ENDON_CHIPSELECT_Pos) /*!< Bit mask of CHIPSELECT field.                    */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           MVDMA                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* =============================================== Struct MVDMA_EVENTS_SOURCE ================================================ */
/**
  * @brief EVENTS_SOURCE [MVDMA_EVENTS_SOURCE] Peripheral events.
  */
typedef struct {
  __IOM uint32_t  BUSERROR;                          /*!< (@ 0x00000000) Event indicating that a bus error has been received on
                                                                         the Source channel.*/
  __IOM uint32_t  SELECTJOBDONE;                     /*!< (@ 0x00000004) Event indicating that a job on the Source channel with
                                                                         EVENT_ENABLE active has been processed.*/
} NRF_MVDMA_EVENTS_SOURCE_Type;                      /*!< Size = 8 (0x008)                                                     */

/* MVDMA_EVENTS_SOURCE_BUSERROR: Event indicating that a bus error has been received on the Source channel. */
  #define MVDMA_EVENTS_SOURCE_BUSERROR_ResetValue (0x00000000UL) /*!< Reset value of BUSERROR register.                        */

/* BUSERROR @Bit 0 : Event indicating that a bus error has been received on the Source channel. */
  #define MVDMA_EVENTS_SOURCE_BUSERROR_BUSERROR_Pos (0UL) /*!< Position of BUSERROR field.                                     */
  #define MVDMA_EVENTS_SOURCE_BUSERROR_BUSERROR_Msk (0x1UL << MVDMA_EVENTS_SOURCE_BUSERROR_BUSERROR_Pos) /*!< Bit mask of
                                                                            BUSERROR field.*/
  #define MVDMA_EVENTS_SOURCE_BUSERROR_BUSERROR_Min (0x0UL) /*!< Min enumerator value of BUSERROR field.                       */
  #define MVDMA_EVENTS_SOURCE_BUSERROR_BUSERROR_Max (0x1UL) /*!< Max enumerator value of BUSERROR field.                       */
  #define MVDMA_EVENTS_SOURCE_BUSERROR_BUSERROR_NotGenerated (0x0UL) /*!< Event not generated                                  */
  #define MVDMA_EVENTS_SOURCE_BUSERROR_BUSERROR_Generated (0x1UL) /*!< Event generated                                         */


/* MVDMA_EVENTS_SOURCE_SELECTJOBDONE: Event indicating that a job on the Source channel with EVENT_ENABLE active has been
                                       processed. */

  #define MVDMA_EVENTS_SOURCE_SELECTJOBDONE_ResetValue (0x00000000UL) /*!< Reset value of SELECTJOBDONE register.              */

/* SELECTJOBDONE @Bit 0 : Event indicating that a job on the Source channel with EVENT_ENABLE active has been processed. */
  #define MVDMA_EVENTS_SOURCE_SELECTJOBDONE_SELECTJOBDONE_Pos (0UL) /*!< Position of SELECTJOBDONE field.                      */
  #define MVDMA_EVENTS_SOURCE_SELECTJOBDONE_SELECTJOBDONE_Msk (0x1UL << MVDMA_EVENTS_SOURCE_SELECTJOBDONE_SELECTJOBDONE_Pos)
                                                                            /*!< Bit mask of SELECTJOBDONE field.*/
  #define MVDMA_EVENTS_SOURCE_SELECTJOBDONE_SELECTJOBDONE_Min (0x0UL) /*!< Min enumerator value of SELECTJOBDONE field.        */
  #define MVDMA_EVENTS_SOURCE_SELECTJOBDONE_SELECTJOBDONE_Max (0x1UL) /*!< Max enumerator value of SELECTJOBDONE field.        */
  #define MVDMA_EVENTS_SOURCE_SELECTJOBDONE_SELECTJOBDONE_NotGenerated (0x0UL) /*!< Event not generated                        */
  #define MVDMA_EVENTS_SOURCE_SELECTJOBDONE_SELECTJOBDONE_Generated (0x1UL) /*!< Event generated                               */



