NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* ================================================ Struct MVDMA_EVENTS_SINK ================================================= */
/**
  * @brief EVENTS_SINK [MVDMA_EVENTS_SINK] Peripheral events.
  */
typedef struct {
  __IOM uint32_t  BUSERROR;                          /*!< (@ 0x00000000) Event indicating that a bus error has been received on
                                                                         the Sink channel.*/
  __IOM uint32_t  SELECTJOBDONE;                     /*!< (@ 0x00000004) Event indicating that a job on the Sink channel with
                                                                         EVENT_ENABLE active has been processed.*/
} NRF_MVDMA_EVENTS_SINK_Type;                        /*!< Size = 8 (0x008)                                                     */

/* MVDMA_EVENTS_SINK_BUSERROR: Event indicating that a bus error has been received on the Sink channel. */
  #define MVDMA_EVENTS_SINK_BUSERROR_ResetValue (0x00000000UL) /*!< Reset value of BUSERROR register.                          */

/* BUSERROR @Bit 0 : Event indicating that a bus error has been received on the Sink channel. */
  #define MVDMA_EVENTS_SINK_BUSERROR_BUSERROR_Pos (0UL) /*!< Position of BUSERROR field.                                       */
  #define MVDMA_EVENTS_SINK_BUSERROR_BUSERROR_Msk (0x1UL << MVDMA_EVENTS_SINK_BUSERROR_BUSERROR_Pos) /*!< Bit mask of BUSERROR
                                                                            field.*/
  #define MVDMA_EVENTS_SINK_BUSERROR_BUSERROR_Min (0x0UL) /*!< Min enumerator value of BUSERROR field.                         */
  #define MVDMA_EVENTS_SINK_BUSERROR_BUSERROR_Max (0x1UL) /*!< Max enumerator value of BUSERROR field.                         */
  #define MVDMA_EVENTS_SINK_BUSERROR_BUSERROR_NotGenerated (0x0UL) /*!< Event not generated                                    */
  #define MVDMA_EVENTS_SINK_BUSERROR_BUSERROR_Generated (0x1UL) /*!< Event generated                                           */


/* MVDMA_EVENTS_SINK_SELECTJOBDONE: Event indicating that a job on the Sink channel with EVENT_ENABLE active has been processed.
                                     */

  #define MVDMA_EVENTS_SINK_SELECTJOBDONE_ResetValue (0x00000000UL) /*!< Reset value of SELECTJOBDONE register.                */

/* SELECTJOBDONE @Bit 0 : Event indicating that a job on the Sink channel with EVENT_ENABLE active has been processed. */
  #define MVDMA_EVENTS_SINK_SELECTJOBDONE_SELECTJOBDONE_Pos (0UL) /*!< Position of SELECTJOBDONE field.                        */
  #define MVDMA_EVENTS_SINK_SELECTJOBDONE_SELECTJOBDONE_Msk (0x1UL << MVDMA_EVENTS_SINK_SELECTJOBDONE_SELECTJOBDONE_Pos) /*!<
                                                                            Bit mask of SELECTJOBDONE field.*/
  #define MVDMA_EVENTS_SINK_SELECTJOBDONE_SELECTJOBDONE_Min (0x0UL) /*!< Min enumerator value of SELECTJOBDONE field.          */
  #define MVDMA_EVENTS_SINK_SELECTJOBDONE_SELECTJOBDONE_Max (0x1UL) /*!< Max enumerator value of SELECTJOBDONE field.          */
  #define MVDMA_EVENTS_SINK_SELECTJOBDONE_SELECTJOBDONE_NotGenerated (0x0UL) /*!< Event not generated                          */
  #define MVDMA_EVENTS_SINK_SELECTJOBDONE_SELECTJOBDONE_Generated (0x1UL) /*!< Event generated                                 */



/* =============================================== Struct MVDMA_PUBLISH_SOURCE =============================================== */
/**
  * @brief PUBLISH_SOURCE [MVDMA_PUBLISH_SOURCE] Publish configuration for events
  */
typedef struct {
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  SELECTJOBDONE;                     /*!< (@ 0x00000004) Publish configuration for event SOURCE.SELECTJOBDONE  */
} NRF_MVDMA_PUBLISH_SOURCE_Type;                     /*!< Size = 8 (0x008)                                                     */

/* MVDMA_PUBLISH_SOURCE_SELECTJOBDONE: Publish configuration for event SOURCE.SELECTJOBDONE */
  #define MVDMA_PUBLISH_SOURCE_SELECTJOBDONE_ResetValue (0x00000000UL) /*!< Reset value of SELECTJOBDONE register.             */

/* CHIDX @Bits 0..7 : DPPI channel that event SOURCE.SELECTJOBDONE will publish to */
  #define MVDMA_PUBLISH_SOURCE_SELECTJOBDONE_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                     */
  #define MVDMA_PUBLISH_SOURCE_SELECTJOBDONE_CHIDX_Msk (0xFFUL << MVDMA_PUBLISH_SOURCE_SELECTJOBDONE_CHIDX_Pos) /*!< Bit mask of
                                                                            CHIDX field.*/
  #define MVDMA_PUBLISH_SOURCE_SELECTJOBDONE_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                 */
  #define MVDMA_PUBLISH_SOURCE_SELECTJOBDONE_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                  */

/* EN @Bit 31 : (unspecified) */
  #define MVDMA_PUBLISH_SOURCE_SELECTJOBDONE_EN_Pos (31UL) /*!< Position of EN field.                                          */
  #define MVDMA_PUBLISH_SOURCE_SELECTJOBDONE_EN_Msk (0x1UL << MVDMA_PUBLISH_SOURCE_SELECTJOBDONE_EN_Pos) /*!< Bit mask of EN
                                                                            field.*/
  #define MVDMA_PUBLISH_SOURCE_SELECTJOBDONE_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                             */
  #define MVDMA_PUBLISH_SOURCE_SELECTJOBDONE_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                             */
  #define MVDMA_PUBLISH_SOURCE_SELECTJOBDONE_EN_Disabled (0x0UL) /*!< Disable publishing                                       */
  #define MVDMA_PUBLISH_SOURCE_SELECTJOBDONE_EN_Enabled (0x1UL) /*!< Enable publishing                                         */



/* ================================================ Struct MVDMA_PUBLISH_SINK ================================================ */
/**
  * @brief PUBLISH_SINK [MVDMA_PUBLISH_SINK] Publish configuration for events
  */
typedef struct {
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  SELECTJOBDONE;                     /*!< (@ 0x00000004) Publish configuration for event SINK.SELECTJOBDONE    */
} NRF_MVDMA_PUBLISH_SINK_Type;                       /*!< Size = 8 (0x008)                                                     */

/* MVDMA_PUBLISH_SINK_SELECTJOBDONE: Publish configuration for event SINK.SELECTJOBDONE */
  #define MVDMA_PUBLISH_SINK_SELECTJOBDONE_ResetValue (0x00000000UL) /*!< Reset value of SELECTJOBDONE register.               */

/* CHIDX @Bits 0..7 : DPPI channel that event SINK.SELECTJOBDONE will publish to */
  #define MVDMA_PUBLISH_SINK_SELECTJOBDONE_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                       */
  #define MVDMA_PUBLISH_SINK_SELECTJOBDONE_CHIDX_Msk (0xFFUL << MVDMA_PUBLISH_SINK_SELECTJOBDONE_CHIDX_Pos) /*!< Bit mask of
                                                                            CHIDX field.*/
  #define MVDMA_PUBLISH_SINK_SELECTJOBDONE_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                   */
  #define MVDMA_PUBLISH_SINK_SELECTJOBDONE_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                    */

/* EN @Bit 31 : (unspecified) */
  #define MVDMA_PUBLISH_SINK_SELECTJOBDONE_EN_Pos (31UL) /*!< Position of EN field.                                            */
  #define MVDMA_PUBLISH_SINK_SELECTJOBDONE_EN_Msk (0x1UL << MVDMA_PUBLISH_SINK_SELECTJOBDONE_EN_Pos) /*!< Bit mask of EN field.*/
  #define MVDMA_PUBLISH_SINK_SELECTJOBDONE_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                               */
  #define MVDMA_PUBLISH_SINK_SELECTJOBDONE_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                               */
  #define MVDMA_PUBLISH_SINK_SELECTJOBDONE_EN_Disabled (0x0UL) /*!< Disable publishing                                         */
  #define MVDMA_PUBLISH_SINK_SELECTJOBDONE_EN_Enabled (0x1UL) /*!< Enable publishing                                           */



