NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* TASKS_STOPTX @Bit 0 : Stops an issued transmission of a frame */
  #define NFCT_TASKS_STOPTX_TASKS_STOPTX_Pos (0UL)   /*!< Position of TASKS_STOPTX field.                                      */
  #define NFCT_TASKS_STOPTX_TASKS_STOPTX_Msk (0x1UL << NFCT_TASKS_STOPTX_TASKS_STOPTX_Pos) /*!< Bit mask of TASKS_STOPTX field.*/
  #define NFCT_TASKS_STOPTX_TASKS_STOPTX_Min (0x1UL) /*!< Min enumerator value of TASKS_STOPTX field.                          */
  #define NFCT_TASKS_STOPTX_TASKS_STOPTX_Max (0x1UL) /*!< Max enumerator value of TASKS_STOPTX field.                          */
  #define NFCT_TASKS_STOPTX_TASKS_STOPTX_Trigger (0x1UL) /*!< Trigger task                                                     */


/* NFCT_TASKS_ENABLERXDATA: Initializes the EasyDMA for receive. */
  #define NFCT_TASKS_ENABLERXDATA_ResetValue (0x00000000UL) /*!< Reset value of TASKS_ENABLERXDATA register.                   */

/* TASKS_ENABLERXDATA @Bit 0 : Initializes the EasyDMA for receive. */
  #define NFCT_TASKS_ENABLERXDATA_TASKS_ENABLERXDATA_Pos (0UL) /*!< Position of TASKS_ENABLERXDATA field.                      */
  #define NFCT_TASKS_ENABLERXDATA_TASKS_ENABLERXDATA_Msk (0x1UL << NFCT_TASKS_ENABLERXDATA_TASKS_ENABLERXDATA_Pos) /*!< Bit mask
                                                                            of TASKS_ENABLERXDATA field.*/
  #define NFCT_TASKS_ENABLERXDATA_TASKS_ENABLERXDATA_Min (0x1UL) /*!< Min enumerator value of TASKS_ENABLERXDATA field.        */
  #define NFCT_TASKS_ENABLERXDATA_TASKS_ENABLERXDATA_Max (0x1UL) /*!< Max enumerator value of TASKS_ENABLERXDATA field.        */
  #define NFCT_TASKS_ENABLERXDATA_TASKS_ENABLERXDATA_Trigger (0x1UL) /*!< Trigger task                                         */


/* NFCT_TASKS_GOIDLE: Force state machine to IDLE state */
  #define NFCT_TASKS_GOIDLE_ResetValue (0x00000000UL) /*!< Reset value of TASKS_GOIDLE register.                               */

/* TASKS_GOIDLE @Bit 0 : Force state machine to IDLE state */
  #define NFCT_TASKS_GOIDLE_TASKS_GOIDLE_Pos (0UL)   /*!< Position of TASKS_GOIDLE field.                                      */
  #define NFCT_TASKS_GOIDLE_TASKS_GOIDLE_Msk (0x1UL << NFCT_TASKS_GOIDLE_TASKS_GOIDLE_Pos) /*!< Bit mask of TASKS_GOIDLE field.*/
  #define NFCT_TASKS_GOIDLE_TASKS_GOIDLE_Min (0x1UL) /*!< Min enumerator value of TASKS_GOIDLE field.                          */
  #define NFCT_TASKS_GOIDLE_TASKS_GOIDLE_Max (0x1UL) /*!< Max enumerator value of TASKS_GOIDLE field.                          */
  #define NFCT_TASKS_GOIDLE_TASKS_GOIDLE_Trigger (0x1UL) /*!< Trigger task                                                     */


/* NFCT_TASKS_GOSLEEP: Force state machine to SLEEP_A state */
  #define NFCT_TASKS_GOSLEEP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_GOSLEEP register.                             */

/* TASKS_GOSLEEP @Bit 0 : Force state machine to SLEEP_A state */
  #define NFCT_TASKS_GOSLEEP_TASKS_GOSLEEP_Pos (0UL) /*!< Position of TASKS_GOSLEEP field.                                     */
  #define NFCT_TASKS_GOSLEEP_TASKS_GOSLEEP_Msk (0x1UL << NFCT_TASKS_GOSLEEP_TASKS_GOSLEEP_Pos) /*!< Bit mask of TASKS_GOSLEEP
                                                                            field.*/
  #define NFCT_TASKS_GOSLEEP_TASKS_GOSLEEP_Min (0x1UL) /*!< Min enumerator value of TASKS_GOSLEEP field.                       */
  #define NFCT_TASKS_GOSLEEP_TASKS_GOSLEEP_Max (0x1UL) /*!< Max enumerator value of TASKS_GOSLEEP field.                       */
  #define NFCT_TASKS_GOSLEEP_TASKS_GOSLEEP_Trigger (0x1UL) /*!< Trigger task                                                   */


/* NFCT_SUBSCRIBE_ACTIVATE: Subscribe configuration for task ACTIVATE */
  #define NFCT_SUBSCRIBE_ACTIVATE_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_ACTIVATE register.                   */

/* CHIDX @Bits 0..7 : DPPI channel that task ACTIVATE will subscribe to */
  #define NFCT_SUBSCRIBE_ACTIVATE_CHIDX_Pos (0UL)    /*!< Position of CHIDX field.                                             */
  #define NFCT_SUBSCRIBE_ACTIVATE_CHIDX_Msk (0xFFUL << NFCT_SUBSCRIBE_ACTIVATE_CHIDX_Pos) /*!< Bit mask of CHIDX field.        */
  #define NFCT_SUBSCRIBE_ACTIVATE_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                            */
  #define NFCT_SUBSCRIBE_ACTIVATE_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define NFCT_SUBSCRIBE_ACTIVATE_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define NFCT_SUBSCRIBE_ACTIVATE_EN_Msk (0x1UL << NFCT_SUBSCRIBE_ACTIVATE_EN_Pos) /*!< Bit mask of EN field.                  */
  #define NFCT_SUBSCRIBE_ACTIVATE_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define NFCT_SUBSCRIBE_ACTIVATE_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define NFCT_SUBSCRIBE_ACTIVATE_EN_Disabled (0x0UL) /*!< Disable subscription                                                */
  #define NFCT_SUBSCRIBE_ACTIVATE_EN_Enabled (0x1UL) /*!< Enable subscription                                                  */


/* NFCT_SUBSCRIBE_DISABLE: Subscribe configuration for task DISABLE */
  #define NFCT_SUBSCRIBE_DISABLE_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_DISABLE register.                     */

/* CHIDX @Bits 0..7 : DPPI channel that task DISABLE will subscribe to */
  #define NFCT_SUBSCRIBE_DISABLE_CHIDX_Pos (0UL)     /*!< Position of CHIDX field.                                             */
  #define NFCT_SUBSCRIBE_DISABLE_CHIDX_Msk (0xFFUL << NFCT_SUBSCRIBE_DISABLE_CHIDX_Pos) /*!< Bit mask of CHIDX field.          */
  #define NFCT_SUBSCRIBE_DISABLE_CHIDX_Min (0x00UL)  /*!< Min value of CHIDX field.                                            */
  #define NFCT_SUBSCRIBE_DISABLE_CHIDX_Max (0xFFUL)  /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define NFCT_SUBSCRIBE_DISABLE_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define NFCT_SUBSCRIBE_DISABLE_EN_Msk (0x1UL << NFCT_SUBSCRIBE_DISABLE_EN_Pos) /*!< Bit mask of EN field.                    */
  #define NFCT_SUBSCRIBE_DISABLE_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define NFCT_SUBSCRIBE_DISABLE_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define NFCT_SUBSCRIBE_DISABLE_EN_Disabled (0x0UL) /*!< Disable subscription                                                 */
  #define NFCT_SUBSCRIBE_DISABLE_EN_Enabled (0x1UL)  /*!< Enable subscription                                                  */


/* NFCT_SUBSCRIBE_SENSE: Subscribe configuration for task SENSE */
  #define NFCT_SUBSCRIBE_SENSE_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_SENSE register.                         */

