NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* NFCT_EVENTS_TXFRAMEEND: Marks the end of the last transmitted on-air symbol of a frame */
  #define NFCT_EVENTS_TXFRAMEEND_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_TXFRAMEEND register.                     */

/* EVENTS_TXFRAMEEND @Bit 0 : Marks the end of the last transmitted on-air symbol of a frame */
  #define NFCT_EVENTS_TXFRAMEEND_EVENTS_TXFRAMEEND_Pos (0UL) /*!< Position of EVENTS_TXFRAMEEND field.                         */
  #define NFCT_EVENTS_TXFRAMEEND_EVENTS_TXFRAMEEND_Msk (0x1UL << NFCT_EVENTS_TXFRAMEEND_EVENTS_TXFRAMEEND_Pos) /*!< Bit mask of
                                                                            EVENTS_TXFRAMEEND field.*/
  #define NFCT_EVENTS_TXFRAMEEND_EVENTS_TXFRAMEEND_Min (0x0UL) /*!< Min enumerator value of EVENTS_TXFRAMEEND field.           */
  #define NFCT_EVENTS_TXFRAMEEND_EVENTS_TXFRAMEEND_Max (0x1UL) /*!< Max enumerator value of EVENTS_TXFRAMEEND field.           */
  #define NFCT_EVENTS_TXFRAMEEND_EVENTS_TXFRAMEEND_NotGenerated (0x0UL) /*!< Event not generated                               */
  #define NFCT_EVENTS_TXFRAMEEND_EVENTS_TXFRAMEEND_Generated (0x1UL) /*!< Event generated                                      */


/* NFCT_EVENTS_RXFRAMESTART: Marks the end of the first symbol of a received frame */
  #define NFCT_EVENTS_RXFRAMESTART_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_RXFRAMESTART register.                 */

/* EVENTS_RXFRAMESTART @Bit 0 : Marks the end of the first symbol of a received frame */
  #define NFCT_EVENTS_RXFRAMESTART_EVENTS_RXFRAMESTART_Pos (0UL) /*!< Position of EVENTS_RXFRAMESTART field.                   */
  #define NFCT_EVENTS_RXFRAMESTART_EVENTS_RXFRAMESTART_Msk (0x1UL << NFCT_EVENTS_RXFRAMESTART_EVENTS_RXFRAMESTART_Pos) /*!< Bit
                                                                            mask of EVENTS_RXFRAMESTART field.*/
  #define NFCT_EVENTS_RXFRAMESTART_EVENTS_RXFRAMESTART_Min (0x0UL) /*!< Min enumerator value of EVENTS_RXFRAMESTART field.     */
  #define NFCT_EVENTS_RXFRAMESTART_EVENTS_RXFRAMESTART_Max (0x1UL) /*!< Max enumerator value of EVENTS_RXFRAMESTART field.     */
  #define NFCT_EVENTS_RXFRAMESTART_EVENTS_RXFRAMESTART_NotGenerated (0x0UL) /*!< Event not generated                           */
  #define NFCT_EVENTS_RXFRAMESTART_EVENTS_RXFRAMESTART_Generated (0x1UL) /*!< Event generated                                  */


/* NFCT_EVENTS_RXFRAMEEND: Received data has been checked (CRC, parity) and transferred to RAM, and EasyDMA has ended accessing
                            the RX buffer */

  #define NFCT_EVENTS_RXFRAMEEND_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_RXFRAMEEND register.                     */

/* EVENTS_RXFRAMEEND @Bit 0 : Received data has been checked (CRC, parity) and transferred to RAM, and EasyDMA has ended
                              accessing the RX buffer */

  #define NFCT_EVENTS_RXFRAMEEND_EVENTS_RXFRAMEEND_Pos (0UL) /*!< Position of EVENTS_RXFRAMEEND field.                         */
  #define NFCT_EVENTS_RXFRAMEEND_EVENTS_RXFRAMEEND_Msk (0x1UL << NFCT_EVENTS_RXFRAMEEND_EVENTS_RXFRAMEEND_Pos) /*!< Bit mask of
                                                                            EVENTS_RXFRAMEEND field.*/
  #define NFCT_EVENTS_RXFRAMEEND_EVENTS_RXFRAMEEND_Min (0x0UL) /*!< Min enumerator value of EVENTS_RXFRAMEEND field.           */
  #define NFCT_EVENTS_RXFRAMEEND_EVENTS_RXFRAMEEND_Max (0x1UL) /*!< Max enumerator value of EVENTS_RXFRAMEEND field.           */
  #define NFCT_EVENTS_RXFRAMEEND_EVENTS_RXFRAMEEND_NotGenerated (0x0UL) /*!< Event not generated                               */
  #define NFCT_EVENTS_RXFRAMEEND_EVENTS_RXFRAMEEND_Generated (0x1UL) /*!< Event generated                                      */


/* NFCT_EVENTS_ERROR: NFC error reported. The ERRORSTATUS register contains details on the source of the error. */
  #define NFCT_EVENTS_ERROR_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_ERROR register.                               */

/* EVENTS_ERROR @Bit 0 : NFC error reported. The ERRORSTATUS register contains details on the source of the error. */
  #define NFCT_EVENTS_ERROR_EVENTS_ERROR_Pos (0UL)   /*!< Position of EVENTS_ERROR field.                                      */
  #define NFCT_EVENTS_ERROR_EVENTS_ERROR_Msk (0x1UL << NFCT_EVENTS_ERROR_EVENTS_ERROR_Pos) /*!< Bit mask of EVENTS_ERROR field.*/
  #define NFCT_EVENTS_ERROR_EVENTS_ERROR_Min (0x0UL) /*!< Min enumerator value of EVENTS_ERROR field.                          */
  #define NFCT_EVENTS_ERROR_EVENTS_ERROR_Max (0x1UL) /*!< Max enumerator value of EVENTS_ERROR field.                          */
  #define NFCT_EVENTS_ERROR_EVENTS_ERROR_NotGenerated (0x0UL) /*!< Event not generated                                         */
  #define NFCT_EVENTS_ERROR_EVENTS_ERROR_Generated (0x1UL) /*!< Event generated                                                */


/* NFCT_EVENTS_RXERROR: NFC RX frame error reported. The FRAMESTATUS.RX register contains details on the source of the error. */
  #define NFCT_EVENTS_RXERROR_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_RXERROR register.                           */

/* EVENTS_RXERROR @Bit 0 : NFC RX frame error reported. The FRAMESTATUS.RX register contains details on the source of the error.
                           */

  #define NFCT_EVENTS_RXERROR_EVENTS_RXERROR_Pos (0UL) /*!< Position of EVENTS_RXERROR field.                                  */
  #define NFCT_EVENTS_RXERROR_EVENTS_RXERROR_Msk (0x1UL << NFCT_EVENTS_RXERROR_EVENTS_RXERROR_Pos) /*!< Bit mask of
                                                                            EVENTS_RXERROR field.*/
  #define NFCT_EVENTS_RXERROR_EVENTS_RXERROR_Min (0x0UL) /*!< Min enumerator value of EVENTS_RXERROR field.                    */
  #define NFCT_EVENTS_RXERROR_EVENTS_RXERROR_Max (0x1UL) /*!< Max enumerator value of EVENTS_RXERROR field.                    */
  #define NFCT_EVENTS_RXERROR_EVENTS_RXERROR_NotGenerated (0x0UL) /*!< Event not generated                                     */
  #define NFCT_EVENTS_RXERROR_EVENTS_RXERROR_Generated (0x1UL) /*!< Event generated                                            */


/* NFCT_EVENTS_ENDRX: RX buffer (as defined by PACKETPTR and MAXLEN) in Data RAM full. */
  #define NFCT_EVENTS_ENDRX_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_ENDRX register.                               */

/* EVENTS_ENDRX @Bit 0 : RX buffer (as defined by PACKETPTR and MAXLEN) in Data RAM full. */
  #define NFCT_EVENTS_ENDRX_EVENTS_ENDRX_Pos (0UL)   /*!< Position of EVENTS_ENDRX field.                                      */
  #define NFCT_EVENTS_ENDRX_EVENTS_ENDRX_Msk (0x1UL << NFCT_EVENTS_ENDRX_EVENTS_ENDRX_Pos) /*!< Bit mask of EVENTS_ENDRX field.*/
  #define NFCT_EVENTS_ENDRX_EVENTS_ENDRX_Min (0x0UL) /*!< Min enumerator value of EVENTS_ENDRX field.                          */
  #define NFCT_EVENTS_ENDRX_EVENTS_ENDRX_Max (0x1UL) /*!< Max enumerator value of EVENTS_ENDRX field.                          */
  #define NFCT_EVENTS_ENDRX_EVENTS_ENDRX_NotGenerated (0x0UL) /*!< Event not generated                                         */
  #define NFCT_EVENTS_ENDRX_EVENTS_ENDRX_Generated (0x1UL) /*!< Event generated                                                */


/* NFCT_EVENTS_ENDTX: Transmission of data in RAM has ended, and EasyDMA has ended accessing the TX buffer */
  #define NFCT_EVENTS_ENDTX_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_ENDTX register.                               */

/* EVENTS_ENDTX @Bit 0 : Transmission of data in RAM has ended, and EasyDMA has ended accessing the TX buffer */
  #define NFCT_EVENTS_ENDTX_EVENTS_ENDTX_Pos (0UL)   /*!< Position of EVENTS_ENDTX field.                                      */
  #define NFCT_EVENTS_ENDTX_EVENTS_ENDTX_Msk (0x1UL << NFCT_EVENTS_ENDTX_EVENTS_ENDTX_Pos) /*!< Bit mask of EVENTS_ENDTX field.*/
  #define NFCT_EVENTS_ENDTX_EVENTS_ENDTX_Min (0x0UL) /*!< Min enumerator value of EVENTS_ENDTX field.                          */
  #define NFCT_EVENTS_ENDTX_EVENTS_ENDTX_Max (0x1UL) /*!< Max enumerator value of EVENTS_ENDTX field.                          */
  #define NFCT_EVENTS_ENDTX_EVENTS_ENDTX_NotGenerated (0x0UL) /*!< Event not generated                                         */
  #define NFCT_EVENTS_ENDTX_EVENTS_ENDTX_Generated (0x1UL) /*!< Event generated                                                */


/* NFCT_EVENTS_AUTOCOLRESSTARTED: Auto collision resolution process has started */
  #define NFCT_EVENTS_AUTOCOLRESSTARTED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_AUTOCOLRESSTARTED register.       */

