NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* TXFRAMESTART @Bit 3 : Enable or disable interrupt for event TXFRAMESTART */
  #define NFCT_INTEN_TXFRAMESTART_Pos (3UL)          /*!< Position of TXFRAMESTART field.                                      */
  #define NFCT_INTEN_TXFRAMESTART_Msk (0x1UL << NFCT_INTEN_TXFRAMESTART_Pos) /*!< Bit mask of TXFRAMESTART field.              */
  #define NFCT_INTEN_TXFRAMESTART_Min (0x0UL)        /*!< Min enumerator value of TXFRAMESTART field.                          */
  #define NFCT_INTEN_TXFRAMESTART_Max (0x1UL)        /*!< Max enumerator value of TXFRAMESTART field.                          */
  #define NFCT_INTEN_TXFRAMESTART_Disabled (0x0UL)   /*!< Disable                                                              */
  #define NFCT_INTEN_TXFRAMESTART_Enabled (0x1UL)    /*!< Enable                                                               */

/* TXFRAMEEND @Bit 4 : Enable or disable interrupt for event TXFRAMEEND */
  #define NFCT_INTEN_TXFRAMEEND_Pos (4UL)            /*!< Position of TXFRAMEEND field.                                        */
  #define NFCT_INTEN_TXFRAMEEND_Msk (0x1UL << NFCT_INTEN_TXFRAMEEND_Pos) /*!< Bit mask of TXFRAMEEND field.                    */
  #define NFCT_INTEN_TXFRAMEEND_Min (0x0UL)          /*!< Min enumerator value of TXFRAMEEND field.                            */
  #define NFCT_INTEN_TXFRAMEEND_Max (0x1UL)          /*!< Max enumerator value of TXFRAMEEND field.                            */
  #define NFCT_INTEN_TXFRAMEEND_Disabled (0x0UL)     /*!< Disable                                                              */
  #define NFCT_INTEN_TXFRAMEEND_Enabled (0x1UL)      /*!< Enable                                                               */

/* RXFRAMESTART @Bit 5 : Enable or disable interrupt for event RXFRAMESTART */
  #define NFCT_INTEN_RXFRAMESTART_Pos (5UL)          /*!< Position of RXFRAMESTART field.                                      */
  #define NFCT_INTEN_RXFRAMESTART_Msk (0x1UL << NFCT_INTEN_RXFRAMESTART_Pos) /*!< Bit mask of RXFRAMESTART field.              */
  #define NFCT_INTEN_RXFRAMESTART_Min (0x0UL)        /*!< Min enumerator value of RXFRAMESTART field.                          */
  #define NFCT_INTEN_RXFRAMESTART_Max (0x1UL)        /*!< Max enumerator value of RXFRAMESTART field.                          */
  #define NFCT_INTEN_RXFRAMESTART_Disabled (0x0UL)   /*!< Disable                                                              */
  #define NFCT_INTEN_RXFRAMESTART_Enabled (0x1UL)    /*!< Enable                                                               */

/* RXFRAMEEND @Bit 6 : Enable or disable interrupt for event RXFRAMEEND */
  #define NFCT_INTEN_RXFRAMEEND_Pos (6UL)            /*!< Position of RXFRAMEEND field.                                        */
  #define NFCT_INTEN_RXFRAMEEND_Msk (0x1UL << NFCT_INTEN_RXFRAMEEND_Pos) /*!< Bit mask of RXFRAMEEND field.                    */
  #define NFCT_INTEN_RXFRAMEEND_Min (0x0UL)          /*!< Min enumerator value of RXFRAMEEND field.                            */
  #define NFCT_INTEN_RXFRAMEEND_Max (0x1UL)          /*!< Max enumerator value of RXFRAMEEND field.                            */
  #define NFCT_INTEN_RXFRAMEEND_Disabled (0x0UL)     /*!< Disable                                                              */
  #define NFCT_INTEN_RXFRAMEEND_Enabled (0x1UL)      /*!< Enable                                                               */

/* ERROR @Bit 7 : Enable or disable interrupt for event ERROR */
  #define NFCT_INTEN_ERROR_Pos (7UL)                 /*!< Position of ERROR field.                                             */
  #define NFCT_INTEN_ERROR_Msk (0x1UL << NFCT_INTEN_ERROR_Pos) /*!< Bit mask of ERROR field.                                   */
  #define NFCT_INTEN_ERROR_Min (0x0UL)               /*!< Min enumerator value of ERROR field.                                 */
  #define NFCT_INTEN_ERROR_Max (0x1UL)               /*!< Max enumerator value of ERROR field.                                 */
  #define NFCT_INTEN_ERROR_Disabled (0x0UL)          /*!< Disable                                                              */
  #define NFCT_INTEN_ERROR_Enabled (0x1UL)           /*!< Enable                                                               */

/* RXERROR @Bit 10 : Enable or disable interrupt for event RXERROR */
  #define NFCT_INTEN_RXERROR_Pos (10UL)              /*!< Position of RXERROR field.                                           */
  #define NFCT_INTEN_RXERROR_Msk (0x1UL << NFCT_INTEN_RXERROR_Pos) /*!< Bit mask of RXERROR field.                             */
  #define NFCT_INTEN_RXERROR_Min (0x0UL)             /*!< Min enumerator value of RXERROR field.                               */
  #define NFCT_INTEN_RXERROR_Max (0x1UL)             /*!< Max enumerator value of RXERROR field.                               */
  #define NFCT_INTEN_RXERROR_Disabled (0x0UL)        /*!< Disable                                                              */
  #define NFCT_INTEN_RXERROR_Enabled (0x1UL)         /*!< Enable                                                               */

/* ENDRX @Bit 11 : Enable or disable interrupt for event ENDRX */
  #define NFCT_INTEN_ENDRX_Pos (11UL)                /*!< Position of ENDRX field.                                             */
  #define NFCT_INTEN_ENDRX_Msk (0x1UL << NFCT_INTEN_ENDRX_Pos) /*!< Bit mask of ENDRX field.                                   */
  #define NFCT_INTEN_ENDRX_Min (0x0UL)               /*!< Min enumerator value of ENDRX field.                                 */
  #define NFCT_INTEN_ENDRX_Max (0x1UL)               /*!< Max enumerator value of ENDRX field.                                 */
  #define NFCT_INTEN_ENDRX_Disabled (0x0UL)          /*!< Disable                                                              */
  #define NFCT_INTEN_ENDRX_Enabled (0x1UL)           /*!< Enable                                                               */

/* ENDTX @Bit 12 : Enable or disable interrupt for event ENDTX */
  #define NFCT_INTEN_ENDTX_Pos (12UL)                /*!< Position of ENDTX field.                                             */
  #define NFCT_INTEN_ENDTX_Msk (0x1UL << NFCT_INTEN_ENDTX_Pos) /*!< Bit mask of ENDTX field.                                   */
  #define NFCT_INTEN_ENDTX_Min (0x0UL)               /*!< Min enumerator value of ENDTX field.                                 */
  #define NFCT_INTEN_ENDTX_Max (0x1UL)               /*!< Max enumerator value of ENDTX field.                                 */
  #define NFCT_INTEN_ENDTX_Disabled (0x0UL)          /*!< Disable                                                              */
  #define NFCT_INTEN_ENDTX_Enabled (0x1UL)           /*!< Enable                                                               */

