NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* ================================================= Struct OSCILLATORS_PLL ================================================== */
/**
  * @brief PLL [OSCILLATORS_PLL] Oscillator control
  */
typedef struct {
  __IOM uint32_t  FREQ;                              /*!< (@ 0x00000000) Set speed of MCU power domain, including CPU.         */
  __IM  uint32_t  CURRENTFREQ;                       /*!< (@ 0x00000004) Current speed of MCU power domain, including CPU      */
} NRF_OSCILLATORS_PLL_Type;                          /*!< Size = 8 (0x008)                                                     */

/* OSCILLATORS_PLL_FREQ: Set speed of MCU power domain, including CPU. */
  #define OSCILLATORS_PLL_FREQ_ResetValue (0x00000004UL) /*!< Reset value of FREQ register.                                    */

/* FREQ @Bits 0..2 : Select CPU speed */
  #define OSCILLATORS_PLL_FREQ_FREQ_Pos (0UL)        /*!< Position of FREQ field.                                              */
  #define OSCILLATORS_PLL_FREQ_FREQ_Msk (0x7UL << OSCILLATORS_PLL_FREQ_FREQ_Pos) /*!< Bit mask of FREQ field.                  */
  #define OSCILLATORS_PLL_FREQ_FREQ_Min (0x0UL)      /*!< Min enumerator value of FREQ field.                                  */
  #define OSCILLATORS_PLL_FREQ_FREQ_Max (0x4UL)      /*!< Max enumerator value of FREQ field.                                  */
  #define OSCILLATORS_PLL_FREQ_FREQ_CK256M (0x0UL)   /*!< 256 MHz                                                              */
  #define OSCILLATORS_PLL_FREQ_FREQ_CK192M (0x1UL)   /*!< 192 MHz                                                              */
  #define OSCILLATORS_PLL_FREQ_FREQ_CK128M (0x2UL)   /*!< 128 MHz                                                              */
  #define OSCILLATORS_PLL_FREQ_FREQ_CK96M (0x3UL)    /*!< 96 MHz                                                               */
  #define OSCILLATORS_PLL_FREQ_FREQ_CK64M (0x4UL)    /*!< 64 MHz                                                               */


/* OSCILLATORS_PLL_CURRENTFREQ: Current speed of MCU power domain, including CPU */
  #define OSCILLATORS_PLL_CURRENTFREQ_ResetValue (0x00000004UL) /*!< Reset value of CURRENTFREQ register.                      */

/* CURRENTFREQ @Bits 0..2 : Select CPU speed */
  #define OSCILLATORS_PLL_CURRENTFREQ_CURRENTFREQ_Pos (0UL) /*!< Position of CURRENTFREQ field.                                */
  #define OSCILLATORS_PLL_CURRENTFREQ_CURRENTFREQ_Msk (0x7UL << OSCILLATORS_PLL_CURRENTFREQ_CURRENTFREQ_Pos) /*!< Bit mask of
                                                                            CURRENTFREQ field.*/
  #define OSCILLATORS_PLL_CURRENTFREQ_CURRENTFREQ_Min (0x0UL) /*!< Min enumerator value of CURRENTFREQ field.                  */
  #define OSCILLATORS_PLL_CURRENTFREQ_CURRENTFREQ_Max (0x4UL) /*!< Max enumerator value of CURRENTFREQ field.                  */
  #define OSCILLATORS_PLL_CURRENTFREQ_CURRENTFREQ_CK256M (0x0UL) /*!< 256 MHz                                                  */
  #define OSCILLATORS_PLL_CURRENTFREQ_CURRENTFREQ_CK192M (0x1UL) /*!< 192 MHz                                                  */
  #define OSCILLATORS_PLL_CURRENTFREQ_CURRENTFREQ_CK128M (0x2UL) /*!< 128 MHz                                                  */
  #define OSCILLATORS_PLL_CURRENTFREQ_CURRENTFREQ_CK96M (0x3UL) /*!< 96 MHz                                                    */
  #define OSCILLATORS_PLL_CURRENTFREQ_CURRENTFREQ_CK64M (0x4UL) /*!< 64 MHz                                                    */


/* =================================================== Struct OSCILLATORS ==================================================== */
/**
  * @brief Oscillator control
  */
  typedef struct {                                   /*!< OSCILLATORS Structure                                                */
    __IM uint32_t RESERVED[512];
    __IOM NRF_OSCILLATORS_PLL_Type PLL;              /*!< (@ 0x00000800) Oscillator control                                    */
  } NRF_OSCILLATORS_Type;                            /*!< Size = 2056 (0x808)                                                  */

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          OSCRFR                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ====================================================== Struct OSCRFR ====================================================== */
/**
  * @brief OSCRFR peripheral
  */
  typedef struct {                                   /*!< OSCRFR Structure                                                     */
    __IM uint32_t RESERVED;
  } NRF_OSCRFR_Type;                                 /*!< Size = 4 (0x004)                                                     */

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                        PCGCMASTER                                        ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ==================================================== Struct PCGCMASTER ==================================================== */
/**
  * @brief PCGC Master
  */
  typedef struct {                                   /*!< PCGCMASTER Structure                                                 */
    __IM uint32_t RESERVED[56];
    __IOM uint32_t SETPWRCONTHRESHOLDBASE[3];        /*!< (@ 0x000000E0) Set power consumption threshold base for power source /
                                                                         regulator n*/
    __IM uint32_t RESERVED1[5];
    __IOM uint32_t SETPOWERCONSUMPTIONBASE[2];       /*!< (@ 0x00000100) Set power consumption base for power/clock pair n     */
    __IM uint32_t RESERVED2[702];
    __IOM uint32_t UNLOCKBACKDOORS;                  /*!< (@ 0x00000C00) Unlock backdoors                                      */
    __IOM uint32_t ENABLEPOWERREGFORCE;              /*!< (@ 0x00000C04) Enable power reg force                                */
    __IOM uint32_t POWERREGFORCE;                    /*!< (@ 0x00000C08) Force reg                                             */
    __IM uint32_t RESERVED3;
    __IOM uint32_t MASTERFORCEREG[1];                /*!< (@ 0x00000C10) Force reg                                             */
    __IM uint32_t RESERVED4[59];
    __IOM uint32_t CLOCKFORCEREG[5];                 /*!< (@ 0x00000D00) Force clock n                                         */
  } NRF_PCGCMASTER_Type;                             /*!< Size = 3348 (0xD14)                                                  */

/* PCGCMASTER_SETPWRCONTHRESHOLDBASE: Set power consumption threshold base for power source / regulator n */
  #define PCGCMASTER_SETPWRCONTHRESHOLDBASE_MaxCount (3UL) /*!< Max size of SETPWRCONTHRESHOLDBASE[3] array.                   */
  #define PCGCMASTER_SETPWRCONTHRESHOLDBASE_MaxIndex (2UL) /*!< Max index of SETPWRCONTHRESHOLDBASE[3] array.                  */
  #define PCGCMASTER_SETPWRCONTHRESHOLDBASE_MinIndex (0UL) /*!< Min index of SETPWRCONTHRESHOLDBASE[3] array.                  */
  #define PCGCMASTER_SETPWRCONTHRESHOLDBASE_ResetValue (0x00000000UL) /*!< Reset value of SETPWRCONTHRESHOLDBASE[3] register.  */

/* SETPWRCONTHRESHOLDBASE @Bits 0..3 : SETPWRCONTHRESHOLDBASE */
  #define PCGCMASTER_SETPWRCONTHRESHOLDBASE_SETPWRCONTHRESHOLDBASE_Pos (0UL) /*!< Position of SETPWRCONTHRESHOLDBASE field.    */
  #define PCGCMASTER_SETPWRCONTHRESHOLDBASE_SETPWRCONTHRESHOLDBASE_Msk (0xFUL << PCGCMASTER_SETPWRCONTHRESHOLDBASE_SETPWRCONTHRESHOLDBASE_Pos)
                                                                            /*!< Bit mask of SETPWRCONTHRESHOLDBASE field.*/


