NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* ==================================================== Struct PDM_FILTER ==================================================== */
/**
  * @brief FILTER [PDM_FILTER] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CTRL;                              /*!< (@ 0x00000000) Aditional PDM configurability                         */
  __IOM uint32_t  HPPOLE;                            /*!< (@ 0x00000004) Settings for the high-pass filter                     */
  __IOM uint32_t  HPDISABLE;                         /*!< (@ 0x00000008) High pass filter disable                              */
  __IOM uint32_t  SOFTMUTE;                          /*!< (@ 0x0000000C) Soft mute function                                    */
  __IOM uint32_t  SOFTCYCLES;                        /*!< (@ 0x00000010) Soft mute settings                                    */
  __IOM uint32_t  SAMPLEDELAY;                       /*!< (@ 0x00000014) Input Data Sampling with Number of ckFilterL (double
                                                                         frequency of PDM_CLK) Clock Cycle Delay.
                                                                         Optionally,input sample point can be delayed
                                                                         independently on left and right channels using
                                                                         FILTER:CTRL[20:19] bits*/
} NRF_PDM_FILTER_Type;                               /*!< Size = 24 (0x018)                                                    */

/* PDM_FILTER_CTRL: Aditional PDM configurability */
  #define PDM_FILTER_CTRL_ResetValue (0x4EE0D200UL)  /*!< Reset value of CTRL register.                                        */

/* OVERRIDERIGHTSOFTMUTE @Bit 6 : Override soft mute enable for right channel */
  #define PDM_FILTER_CTRL_OVERRIDERIGHTSOFTMUTE_Pos (6UL) /*!< Position of OVERRIDERIGHTSOFTMUTE field.                        */
  #define PDM_FILTER_CTRL_OVERRIDERIGHTSOFTMUTE_Msk (0x1UL << PDM_FILTER_CTRL_OVERRIDERIGHTSOFTMUTE_Pos) /*!< Bit mask of
                                                                            OVERRIDERIGHTSOFTMUTE field.*/
  #define PDM_FILTER_CTRL_OVERRIDERIGHTSOFTMUTE_Min (0x0UL) /*!< Min enumerator value of OVERRIDERIGHTSOFTMUTE field.          */
  #define PDM_FILTER_CTRL_OVERRIDERIGHTSOFTMUTE_Max (0x1UL) /*!< Max enumerator value of OVERRIDERIGHTSOFTMUTE field.          */
  #define PDM_FILTER_CTRL_OVERRIDERIGHTSOFTMUTE_Disable (0x0UL) /*!< No action                                                 */
  #define PDM_FILTER_CTRL_OVERRIDERIGHTSOFTMUTE_Enable (0x1UL) /*!< override and disable soft mute                             */

/* OVERRIDELEFTSOFTMUTE @Bit 7 : Override soft mute enable for left channel */
  #define PDM_FILTER_CTRL_OVERRIDELEFTSOFTMUTE_Pos (7UL) /*!< Position of OVERRIDELEFTSOFTMUTE field.                          */
  #define PDM_FILTER_CTRL_OVERRIDELEFTSOFTMUTE_Msk (0x1UL << PDM_FILTER_CTRL_OVERRIDELEFTSOFTMUTE_Pos) /*!< Bit mask of
                                                                            OVERRIDELEFTSOFTMUTE field.*/
  #define PDM_FILTER_CTRL_OVERRIDELEFTSOFTMUTE_Min (0x0UL) /*!< Min enumerator value of OVERRIDELEFTSOFTMUTE field.            */
  #define PDM_FILTER_CTRL_OVERRIDELEFTSOFTMUTE_Max (0x1UL) /*!< Max enumerator value of OVERRIDELEFTSOFTMUTE field.            */
  #define PDM_FILTER_CTRL_OVERRIDELEFTSOFTMUTE_Disable (0x0UL) /*!< No action                                                  */
  #define PDM_FILTER_CTRL_OVERRIDELEFTSOFTMUTE_Enable (0x1UL) /*!< override and disable soft mute                              */

/* GAINADD0P25 @Bit 8 : Add +0.25dB to the gain stage */
  #define PDM_FILTER_CTRL_GAINADD0P25_Pos (8UL)      /*!< Position of GAINADD0P25 field.                                       */
  #define PDM_FILTER_CTRL_GAINADD0P25_Msk (0x1UL << PDM_FILTER_CTRL_GAINADD0P25_Pos) /*!< Bit mask of GAINADD0P25 field.       */
  #define PDM_FILTER_CTRL_GAINADD0P25_Min (0x0UL)    /*!< Min enumerator value of GAINADD0P25 field.                           */
  #define PDM_FILTER_CTRL_GAINADD0P25_Max (0x1UL)    /*!< Max enumerator value of GAINADD0P25 field.                           */
  #define PDM_FILTER_CTRL_GAINADD0P25_Disable (0x0UL) /*!< Nothing added                                                       */
  #define PDM_FILTER_CTRL_GAINADD0P25_Enable (0x1UL) /*!< +0.25dB added                                                        */

/* MINORSTEP025CUSTOM @Bit 9 : Compensates Gain with +0.25dB */
  #define PDM_FILTER_CTRL_MINORSTEP025CUSTOM_Pos (9UL) /*!< Position of MINORSTEP025CUSTOM field.                              */
  #define PDM_FILTER_CTRL_MINORSTEP025CUSTOM_Msk (0x1UL << PDM_FILTER_CTRL_MINORSTEP025CUSTOM_Pos) /*!< Bit mask of
                                                                            MINORSTEP025CUSTOM field.*/
  #define PDM_FILTER_CTRL_MINORSTEP025CUSTOM_Min (0x0UL) /*!< Min enumerator value of MINORSTEP025CUSTOM field.                */
  #define PDM_FILTER_CTRL_MINORSTEP025CUSTOM_Max (0x1UL) /*!< Max enumerator value of MINORSTEP025CUSTOM field.                */
  #define PDM_FILTER_CTRL_MINORSTEP025CUSTOM_Disable (0x0UL) /*!< Nothing added                                                */
  #define PDM_FILTER_CTRL_MINORSTEP025CUSTOM_Enable (0x1UL) /*!< +0.25dB added                                                 */

/* MINORSTEP050CUSTOM @Bits 10..13 : Compensates Gain with +0.5dB steps */
  #define PDM_FILTER_CTRL_MINORSTEP050CUSTOM_Pos (10UL) /*!< Position of MINORSTEP050CUSTOM field.                             */
  #define PDM_FILTER_CTRL_MINORSTEP050CUSTOM_Msk (0xFUL << PDM_FILTER_CTRL_MINORSTEP050CUSTOM_Pos) /*!< Bit mask of
                                                                            MINORSTEP050CUSTOM field.*/
  #define PDM_FILTER_CTRL_MINORSTEP050CUSTOM_Min (0x0UL) /*!< Min value of MINORSTEP050CUSTOM field.                           */
  #define PDM_FILTER_CTRL_MINORSTEP050CUSTOM_Max (0xCUL) /*!< Max size of MINORSTEP050CUSTOM field.                            */

