NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* SRC @Bit 0 : Master clock source selection */
  #define PDM_CLKSELECT_SRC_Pos (0UL)                /*!< Position of SRC field.                                               */
  #define PDM_CLKSELECT_SRC_Msk (0x1UL << PDM_CLKSELECT_SRC_Pos) /*!< Bit mask of SRC field.                                   */
  #define PDM_CLKSELECT_SRC_Min (0x0UL)              /*!< Min enumerator value of SRC field.                                   */
  #define PDM_CLKSELECT_SRC_Max (0x1UL)              /*!< Max enumerator value of SRC field.                                   */
  #define PDM_CLKSELECT_SRC_PCLK32M (0x0UL)          /*!< 32 MHz peripheral clock                                              */
  #define PDM_CLKSELECT_SRC_ACLK (0x1UL)             /*!< Audio PLL clock                                                      */


/* PDM_PRESCALER: The prescaler is used to set the PDM frequency */
  #define PDM_PRESCALER_ResetValue (0x00000004UL)    /*!< Reset value of PRESCALER register.                                   */

/* DIVISOR @Bits 0..7 : Core clock to PDM divisor */
  #define PDM_PRESCALER_DIVISOR_Pos (0UL)            /*!< Position of DIVISOR field.                                           */
  #define PDM_PRESCALER_DIVISOR_Msk (0xFFUL << PDM_PRESCALER_DIVISOR_Pos) /*!< Bit mask of DIVISOR field.                      */
  #define PDM_PRESCALER_DIVISOR_Min (0x04UL)         /*!< Min value of DIVISOR field.                                          */
  #define PDM_PRESCALER_DIVISOR_Max (0x7EUL)         /*!< Max size of DIVISOR field.                                           */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           POWER                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ====================================================== Struct POWER ======================================================= */
/**
  * @brief Power control
  */
  typedef struct {                                   /*!< POWER Structure                                                      */
    __IM uint32_t RESERVED[12];
    __OM uint32_t TASKS_CONSTLAT;                    /*!< (@ 0x00000030) Enable Constant Latency mode                          */
    __OM uint32_t TASKS_LOWPWR;                      /*!< (@ 0x00000034) Enable Low-power mode (variable latency)              */
    __IM uint32_t RESERVED1[30];
    __IOM uint32_t SUBSCRIBE_CONSTLAT;               /*!< (@ 0x000000B0) Subscribe configuration for task CONSTLAT             */
    __IOM uint32_t SUBSCRIBE_LOWPWR;                 /*!< (@ 0x000000B4) Subscribe configuration for task LOWPWR               */
    __IM uint32_t RESERVED2[31];
    __IOM uint32_t EVENTS_SLEEPENTER;                /*!< (@ 0x00000134) CPU entered WFI/WFE sleep                             */
    __IOM uint32_t EVENTS_SLEEPEXIT;                 /*!< (@ 0x00000138) CPU exited WFI/WFE sleep                              */
    __IM uint32_t RESERVED3[30];
    __IOM uint32_t PUBLISH_SLEEPENTER;               /*!< (@ 0x000001B4) Publish configuration for event SLEEPENTER            */
    __IOM uint32_t PUBLISH_SLEEPEXIT;                /*!< (@ 0x000001B8) Publish configuration for event SLEEPEXIT             */
    __IM uint32_t RESERVED4[81];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t RESERVED5[125];
    __IOM uint32_t GPREGRET[2];                      /*!< (@ 0x00000500) General purpose retention register                    */
    __IM uint32_t RESERVED6[6];
    __IM uint32_t CONSTLATSTAT;                      /*!< (@ 0x00000520) Status of constant latency                            */
  } NRF_POWER_Type;                                  /*!< Size = 1316 (0x524)                                                  */

/* POWER_TASKS_CONSTLAT: Enable Constant Latency mode */
  #define POWER_TASKS_CONSTLAT_ResetValue (0x00000000UL) /*!< Reset value of TASKS_CONSTLAT register.                          */

/* TASKS_CONSTLAT @Bit 0 : Enable Constant Latency mode */
  #define POWER_TASKS_CONSTLAT_TASKS_CONSTLAT_Pos (0UL) /*!< Position of TASKS_CONSTLAT field.                                 */
  #define POWER_TASKS_CONSTLAT_TASKS_CONSTLAT_Msk (0x1UL << POWER_TASKS_CONSTLAT_TASKS_CONSTLAT_Pos) /*!< Bit mask of
                                                                            TASKS_CONSTLAT field.*/
  #define POWER_TASKS_CONSTLAT_TASKS_CONSTLAT_Min (0x1UL) /*!< Min enumerator value of TASKS_CONSTLAT field.                   */
  #define POWER_TASKS_CONSTLAT_TASKS_CONSTLAT_Max (0x1UL) /*!< Max enumerator value of TASKS_CONSTLAT field.                   */
  #define POWER_TASKS_CONSTLAT_TASKS_CONSTLAT_Trigger (0x1UL) /*!< Trigger task                                                */


/* POWER_TASKS_LOWPWR: Enable Low-power mode (variable latency) */
  #define POWER_TASKS_LOWPWR_ResetValue (0x00000000UL) /*!< Reset value of TASKS_LOWPWR register.                              */

/* TASKS_LOWPWR @Bit 0 : Enable Low-power mode (variable latency) */
  #define POWER_TASKS_LOWPWR_TASKS_LOWPWR_Pos (0UL)  /*!< Position of TASKS_LOWPWR field.                                      */
  #define POWER_TASKS_LOWPWR_TASKS_LOWPWR_Msk (0x1UL << POWER_TASKS_LOWPWR_TASKS_LOWPWR_Pos) /*!< Bit mask of TASKS_LOWPWR
                                                                            field.*/
  #define POWER_TASKS_LOWPWR_TASKS_LOWPWR_Min (0x1UL) /*!< Min enumerator value of TASKS_LOWPWR field.                         */
  #define POWER_TASKS_LOWPWR_TASKS_LOWPWR_Max (0x1UL) /*!< Max enumerator value of TASKS_LOWPWR field.                         */
  #define POWER_TASKS_LOWPWR_TASKS_LOWPWR_Trigger (0x1UL) /*!< Trigger task                                                    */


/* POWER_SUBSCRIBE_CONSTLAT: Subscribe configuration for task CONSTLAT */
  #define POWER_SUBSCRIBE_CONSTLAT_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_CONSTLAT register.                  */

