NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* REPORTRDY_RDCLRACC @Bit 2 : Shortcut between event REPORTRDY and task RDCLRACC */
  #define QDEC_SHORTS_REPORTRDY_RDCLRACC_Pos (2UL)   /*!< Position of REPORTRDY_RDCLRACC field.                                */
  #define QDEC_SHORTS_REPORTRDY_RDCLRACC_Msk (0x1UL << QDEC_SHORTS_REPORTRDY_RDCLRACC_Pos) /*!< Bit mask of REPORTRDY_RDCLRACC
                                                                            field.*/
  #define QDEC_SHORTS_REPORTRDY_RDCLRACC_Min (0x0UL) /*!< Min enumerator value of REPORTRDY_RDCLRACC field.                    */
  #define QDEC_SHORTS_REPORTRDY_RDCLRACC_Max (0x1UL) /*!< Max enumerator value of REPORTRDY_RDCLRACC field.                    */
  #define QDEC_SHORTS_REPORTRDY_RDCLRACC_Disabled (0x0UL) /*!< Disable shortcut                                                */
  #define QDEC_SHORTS_REPORTRDY_RDCLRACC_Enabled (0x1UL) /*!< Enable shortcut                                                  */

/* REPORTRDY_STOP @Bit 3 : Shortcut between event REPORTRDY and task STOP */
  #define QDEC_SHORTS_REPORTRDY_STOP_Pos (3UL)       /*!< Position of REPORTRDY_STOP field.                                    */
  #define QDEC_SHORTS_REPORTRDY_STOP_Msk (0x1UL << QDEC_SHORTS_REPORTRDY_STOP_Pos) /*!< Bit mask of REPORTRDY_STOP field.      */
  #define QDEC_SHORTS_REPORTRDY_STOP_Min (0x0UL)     /*!< Min enumerator value of REPORTRDY_STOP field.                        */
  #define QDEC_SHORTS_REPORTRDY_STOP_Max (0x1UL)     /*!< Max enumerator value of REPORTRDY_STOP field.                        */
  #define QDEC_SHORTS_REPORTRDY_STOP_Disabled (0x0UL) /*!< Disable shortcut                                                    */
  #define QDEC_SHORTS_REPORTRDY_STOP_Enabled (0x1UL) /*!< Enable shortcut                                                      */

/* DBLRDY_RDCLRDBL @Bit 4 : Shortcut between event DBLRDY and task RDCLRDBL */
  #define QDEC_SHORTS_DBLRDY_RDCLRDBL_Pos (4UL)      /*!< Position of DBLRDY_RDCLRDBL field.                                   */
  #define QDEC_SHORTS_DBLRDY_RDCLRDBL_Msk (0x1UL << QDEC_SHORTS_DBLRDY_RDCLRDBL_Pos) /*!< Bit mask of DBLRDY_RDCLRDBL field.   */
  #define QDEC_SHORTS_DBLRDY_RDCLRDBL_Min (0x0UL)    /*!< Min enumerator value of DBLRDY_RDCLRDBL field.                       */
  #define QDEC_SHORTS_DBLRDY_RDCLRDBL_Max (0x1UL)    /*!< Max enumerator value of DBLRDY_RDCLRDBL field.                       */
  #define QDEC_SHORTS_DBLRDY_RDCLRDBL_Disabled (0x0UL) /*!< Disable shortcut                                                   */
  #define QDEC_SHORTS_DBLRDY_RDCLRDBL_Enabled (0x1UL) /*!< Enable shortcut                                                     */

/* DBLRDY_STOP @Bit 5 : Shortcut between event DBLRDY and task STOP */
  #define QDEC_SHORTS_DBLRDY_STOP_Pos (5UL)          /*!< Position of DBLRDY_STOP field.                                       */
  #define QDEC_SHORTS_DBLRDY_STOP_Msk (0x1UL << QDEC_SHORTS_DBLRDY_STOP_Pos) /*!< Bit mask of DBLRDY_STOP field.               */
  #define QDEC_SHORTS_DBLRDY_STOP_Min (0x0UL)        /*!< Min enumerator value of DBLRDY_STOP field.                           */
  #define QDEC_SHORTS_DBLRDY_STOP_Max (0x1UL)        /*!< Max enumerator value of DBLRDY_STOP field.                           */
  #define QDEC_SHORTS_DBLRDY_STOP_Disabled (0x0UL)   /*!< Disable shortcut                                                     */
  #define QDEC_SHORTS_DBLRDY_STOP_Enabled (0x1UL)    /*!< Enable shortcut                                                      */

/* SAMPLERDY_READCLRACC @Bit 6 : Shortcut between event SAMPLERDY and task READCLRACC */
  #define QDEC_SHORTS_SAMPLERDY_READCLRACC_Pos (6UL) /*!< Position of SAMPLERDY_READCLRACC field.                              */
  #define QDEC_SHORTS_SAMPLERDY_READCLRACC_Msk (0x1UL << QDEC_SHORTS_SAMPLERDY_READCLRACC_Pos) /*!< Bit mask of
                                                                            SAMPLERDY_READCLRACC field.*/
  #define QDEC_SHORTS_SAMPLERDY_READCLRACC_Min (0x0UL) /*!< Min enumerator value of SAMPLERDY_READCLRACC field.                */
  #define QDEC_SHORTS_SAMPLERDY_READCLRACC_Max (0x1UL) /*!< Max enumerator value of SAMPLERDY_READCLRACC field.                */
  #define QDEC_SHORTS_SAMPLERDY_READCLRACC_Disabled (0x0UL) /*!< Disable shortcut                                              */
  #define QDEC_SHORTS_SAMPLERDY_READCLRACC_Enabled (0x1UL) /*!< Enable shortcut                                                */


/* QDEC_INTEN: Enable or disable interrupt */
  #define QDEC_INTEN_ResetValue (0x00000000UL)       /*!< Reset value of INTEN register.                                       */

/* SAMPLERDY @Bit 0 : Enable or disable interrupt for event SAMPLERDY */
  #define QDEC_INTEN_SAMPLERDY_Pos (0UL)             /*!< Position of SAMPLERDY field.                                         */
  #define QDEC_INTEN_SAMPLERDY_Msk (0x1UL << QDEC_INTEN_SAMPLERDY_Pos) /*!< Bit mask of SAMPLERDY field.                       */
  #define QDEC_INTEN_SAMPLERDY_Min (0x0UL)           /*!< Min enumerator value of SAMPLERDY field.                             */
  #define QDEC_INTEN_SAMPLERDY_Max (0x1UL)           /*!< Max enumerator value of SAMPLERDY field.                             */
  #define QDEC_INTEN_SAMPLERDY_Disabled (0x0UL)      /*!< Disable                                                              */
  #define QDEC_INTEN_SAMPLERDY_Enabled (0x1UL)       /*!< Enable                                                               */

/* REPORTRDY @Bit 1 : Enable or disable interrupt for event REPORTRDY */
  #define QDEC_INTEN_REPORTRDY_Pos (1UL)             /*!< Position of REPORTRDY field.                                         */
  #define QDEC_INTEN_REPORTRDY_Msk (0x1UL << QDEC_INTEN_REPORTRDY_Pos) /*!< Bit mask of REPORTRDY field.                       */
  #define QDEC_INTEN_REPORTRDY_Min (0x0UL)           /*!< Min enumerator value of REPORTRDY field.                             */
  #define QDEC_INTEN_REPORTRDY_Max (0x1UL)           /*!< Max enumerator value of REPORTRDY field.                             */
  #define QDEC_INTEN_REPORTRDY_Disabled (0x0UL)      /*!< Disable                                                              */
  #define QDEC_INTEN_REPORTRDY_Enabled (0x1UL)       /*!< Enable                                                               */

/* ACCOF @Bit 2 : Enable or disable interrupt for event ACCOF */
  #define QDEC_INTEN_ACCOF_Pos (2UL)                 /*!< Position of ACCOF field.                                             */
  #define QDEC_INTEN_ACCOF_Msk (0x1UL << QDEC_INTEN_ACCOF_Pos) /*!< Bit mask of ACCOF field.                                   */
  #define QDEC_INTEN_ACCOF_Min (0x0UL)               /*!< Min enumerator value of ACCOF field.                                 */
  #define QDEC_INTEN_ACCOF_Max (0x1UL)               /*!< Max enumerator value of ACCOF field.                                 */
  #define QDEC_INTEN_ACCOF_Disabled (0x0UL)          /*!< Disable                                                              */
  #define QDEC_INTEN_ACCOF_Enabled (0x1UL)           /*!< Enable                                                               */

/* DBLRDY @Bit 3 : Enable or disable interrupt for event DBLRDY */
  #define QDEC_INTEN_DBLRDY_Pos (3UL)                /*!< Position of DBLRDY field.                                            */
  #define QDEC_INTEN_DBLRDY_Msk (0x1UL << QDEC_INTEN_DBLRDY_Pos) /*!< Bit mask of DBLRDY field.                                */
  #define QDEC_INTEN_DBLRDY_Min (0x0UL)              /*!< Min enumerator value of DBLRDY field.                                */
  #define QDEC_INTEN_DBLRDY_Max (0x1UL)              /*!< Max enumerator value of DBLRDY field.                                */
  #define QDEC_INTEN_DBLRDY_Disabled (0x0UL)         /*!< Disable                                                              */
  #define QDEC_INTEN_DBLRDY_Enabled (0x1UL)          /*!< Enable                                                               */

