NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* STOPPED @Bit 4 : Enable or disable interrupt for event STOPPED */
  #define QDEC_INTEN_STOPPED_Pos (4UL)               /*!< Position of STOPPED field.                                           */
  #define QDEC_INTEN_STOPPED_Msk (0x1UL << QDEC_INTEN_STOPPED_Pos) /*!< Bit mask of STOPPED field.                             */
  #define QDEC_INTEN_STOPPED_Min (0x0UL)             /*!< Min enumerator value of STOPPED field.                               */
  #define QDEC_INTEN_STOPPED_Max (0x1UL)             /*!< Max enumerator value of STOPPED field.                               */
  #define QDEC_INTEN_STOPPED_Disabled (0x0UL)        /*!< Disable                                                              */
  #define QDEC_INTEN_STOPPED_Enabled (0x1UL)         /*!< Enable                                                               */


/* QDEC_INTENSET: Enable interrupt */
  #define QDEC_INTENSET_ResetValue (0x00000000UL)    /*!< Reset value of INTENSET register.                                    */

/* SAMPLERDY @Bit 0 : Write '1' to enable interrupt for event SAMPLERDY */
  #define QDEC_INTENSET_SAMPLERDY_Pos (0UL)          /*!< Position of SAMPLERDY field.                                         */
  #define QDEC_INTENSET_SAMPLERDY_Msk (0x1UL << QDEC_INTENSET_SAMPLERDY_Pos) /*!< Bit mask of SAMPLERDY field.                 */
  #define QDEC_INTENSET_SAMPLERDY_Min (0x0UL)        /*!< Min enumerator value of SAMPLERDY field.                             */
  #define QDEC_INTENSET_SAMPLERDY_Max (0x1UL)        /*!< Max enumerator value of SAMPLERDY field.                             */
  #define QDEC_INTENSET_SAMPLERDY_Set (0x1UL)        /*!< Enable                                                               */
  #define QDEC_INTENSET_SAMPLERDY_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define QDEC_INTENSET_SAMPLERDY_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* REPORTRDY @Bit 1 : Write '1' to enable interrupt for event REPORTRDY */
  #define QDEC_INTENSET_REPORTRDY_Pos (1UL)          /*!< Position of REPORTRDY field.                                         */
  #define QDEC_INTENSET_REPORTRDY_Msk (0x1UL << QDEC_INTENSET_REPORTRDY_Pos) /*!< Bit mask of REPORTRDY field.                 */
  #define QDEC_INTENSET_REPORTRDY_Min (0x0UL)        /*!< Min enumerator value of REPORTRDY field.                             */
  #define QDEC_INTENSET_REPORTRDY_Max (0x1UL)        /*!< Max enumerator value of REPORTRDY field.                             */
  #define QDEC_INTENSET_REPORTRDY_Set (0x1UL)        /*!< Enable                                                               */
  #define QDEC_INTENSET_REPORTRDY_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define QDEC_INTENSET_REPORTRDY_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* ACCOF @Bit 2 : Write '1' to enable interrupt for event ACCOF */
  #define QDEC_INTENSET_ACCOF_Pos (2UL)              /*!< Position of ACCOF field.                                             */
  #define QDEC_INTENSET_ACCOF_Msk (0x1UL << QDEC_INTENSET_ACCOF_Pos) /*!< Bit mask of ACCOF field.                             */
  #define QDEC_INTENSET_ACCOF_Min (0x0UL)            /*!< Min enumerator value of ACCOF field.                                 */
  #define QDEC_INTENSET_ACCOF_Max (0x1UL)            /*!< Max enumerator value of ACCOF field.                                 */
  #define QDEC_INTENSET_ACCOF_Set (0x1UL)            /*!< Enable                                                               */
  #define QDEC_INTENSET_ACCOF_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define QDEC_INTENSET_ACCOF_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* DBLRDY @Bit 3 : Write '1' to enable interrupt for event DBLRDY */
  #define QDEC_INTENSET_DBLRDY_Pos (3UL)             /*!< Position of DBLRDY field.                                            */
  #define QDEC_INTENSET_DBLRDY_Msk (0x1UL << QDEC_INTENSET_DBLRDY_Pos) /*!< Bit mask of DBLRDY field.                          */
  #define QDEC_INTENSET_DBLRDY_Min (0x0UL)           /*!< Min enumerator value of DBLRDY field.                                */
  #define QDEC_INTENSET_DBLRDY_Max (0x1UL)           /*!< Max enumerator value of DBLRDY field.                                */
  #define QDEC_INTENSET_DBLRDY_Set (0x1UL)           /*!< Enable                                                               */
  #define QDEC_INTENSET_DBLRDY_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define QDEC_INTENSET_DBLRDY_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* STOPPED @Bit 4 : Write '1' to enable interrupt for event STOPPED */
  #define QDEC_INTENSET_STOPPED_Pos (4UL)            /*!< Position of STOPPED field.                                           */
  #define QDEC_INTENSET_STOPPED_Msk (0x1UL << QDEC_INTENSET_STOPPED_Pos) /*!< Bit mask of STOPPED field.                       */
  #define QDEC_INTENSET_STOPPED_Min (0x0UL)          /*!< Min enumerator value of STOPPED field.                               */
  #define QDEC_INTENSET_STOPPED_Max (0x1UL)          /*!< Max enumerator value of STOPPED field.                               */
  #define QDEC_INTENSET_STOPPED_Set (0x1UL)          /*!< Enable                                                               */
  #define QDEC_INTENSET_STOPPED_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define QDEC_INTENSET_STOPPED_Enabled (0x1UL)      /*!< Read: Enabled                                                        */


/* QDEC_INTENCLR: Disable interrupt */
  #define QDEC_INTENCLR_ResetValue (0x00000000UL)    /*!< Reset value of INTENCLR register.                                    */

/* SAMPLERDY @Bit 0 : Write '1' to disable interrupt for event SAMPLERDY */
  #define QDEC_INTENCLR_SAMPLERDY_Pos (0UL)          /*!< Position of SAMPLERDY field.                                         */
  #define QDEC_INTENCLR_SAMPLERDY_Msk (0x1UL << QDEC_INTENCLR_SAMPLERDY_Pos) /*!< Bit mask of SAMPLERDY field.                 */
  #define QDEC_INTENCLR_SAMPLERDY_Min (0x0UL)        /*!< Min enumerator value of SAMPLERDY field.                             */
  #define QDEC_INTENCLR_SAMPLERDY_Max (0x1UL)        /*!< Max enumerator value of SAMPLERDY field.                             */
  #define QDEC_INTENCLR_SAMPLERDY_Clear (0x1UL)      /*!< Disable                                                              */
  #define QDEC_INTENCLR_SAMPLERDY_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define QDEC_INTENCLR_SAMPLERDY_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* REPORTRDY @Bit 1 : Write '1' to disable interrupt for event REPORTRDY */
  #define QDEC_INTENCLR_REPORTRDY_Pos (1UL)          /*!< Position of REPORTRDY field.                                         */
  #define QDEC_INTENCLR_REPORTRDY_Msk (0x1UL << QDEC_INTENCLR_REPORTRDY_Pos) /*!< Bit mask of REPORTRDY field.                 */
  #define QDEC_INTENCLR_REPORTRDY_Min (0x0UL)        /*!< Min enumerator value of REPORTRDY field.                             */
  #define QDEC_INTENCLR_REPORTRDY_Max (0x1UL)        /*!< Max enumerator value of REPORTRDY field.                             */
  #define QDEC_INTENCLR_REPORTRDY_Clear (0x1UL)      /*!< Disable                                                              */
  #define QDEC_INTENCLR_REPORTRDY_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define QDEC_INTENCLR_REPORTRDY_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

