NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* CTEINLINERXMODE2US @Bits 13..15 : Spacing between samples for the samples in the SWITCHING period when CTEINLINEMODE is set */
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_Pos (13UL) /*!< Position of CTEINLINERXMODE2US field.                         */
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_Msk (0x7UL << RADIO_CTEINLINECONF_CTEINLINERXMODE2US_Pos) /*!< Bit mask of
                                                                            CTEINLINERXMODE2US field.*/
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_Min (0x1UL) /*!< Min enumerator value of CTEINLINERXMODE2US field.            */
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_Max (0x6UL) /*!< Max enumerator value of CTEINLINERXMODE2US field.            */
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_4us (0x1UL) /*!< 4us                                                          */
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_2us (0x2UL) /*!< 2us                                                          */
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_1us (0x3UL) /*!< 1us                                                          */
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_500ns (0x4UL) /*!< 0.5us                                                      */
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_250ns (0x5UL) /*!< 0.25us                                                     */
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_125ns (0x6UL) /*!< 0.125us                                                    */

/* S0CONF @Bits 16..23 : S0 bit pattern to match */
  #define RADIO_CTEINLINECONF_S0CONF_Pos (16UL)      /*!< Position of S0CONF field.                                            */
  #define RADIO_CTEINLINECONF_S0CONF_Msk (0xFFUL << RADIO_CTEINLINECONF_S0CONF_Pos) /*!< Bit mask of S0CONF field.             */

/* S0MASK @Bits 24..31 : S0 bit mask to set which bit to match */
  #define RADIO_CTEINLINECONF_S0MASK_Pos (24UL)      /*!< Position of S0MASK field.                                            */
  #define RADIO_CTEINLINECONF_S0MASK_Msk (0xFFUL << RADIO_CTEINLINECONF_S0MASK_Pos) /*!< Bit mask of S0MASK field.             */


/* RADIO_PACKETPTR: Packet pointer */
  #define RADIO_PACKETPTR_ResetValue (0x00000000UL)  /*!< Reset value of PACKETPTR register.                                   */

/* PTR @Bits 0..31 : Data pointer */
  #define RADIO_PACKETPTR_PTR_Pos (0UL)              /*!< Position of PTR field.                                               */
  #define RADIO_PACKETPTR_PTR_Msk (0xFFFFFFFFUL << RADIO_PACKETPTR_PTR_Pos) /*!< Bit mask of PTR field.                        */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                        REGULATORS                                        ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ==================================================== Struct REGULATORS ==================================================== */
/**
  * @brief Voltage regulators
  */
  typedef struct {                                   /*!< REGULATORS Structure                                                 */
    __IM uint32_t RESERVED[320];
    __OM uint32_t SYSTEMOFF;                         /*!< (@ 0x00000500) System OFF register                                   */
    __IM uint32_t RESERVED1[39];
    __IOM uint32_t MRAMRECOVERY;                     /*!< (@ 0x000005A0) MRAM snapshot and recovery trigger register           */
  } NRF_REGULATORS_Type;                             /*!< Size = 1444 (0x5A4)                                                  */

/* REGULATORS_SYSTEMOFF: System OFF register */
  #define REGULATORS_SYSTEMOFF_ResetValue (0x00000000UL) /*!< Reset value of SYSTEMOFF register.                               */

/* SYSTEMOFF @Bit 0 : Enable System OFF mode */
  #define REGULATORS_SYSTEMOFF_SYSTEMOFF_Pos (0UL)   /*!< Position of SYSTEMOFF field.                                         */
  #define REGULATORS_SYSTEMOFF_SYSTEMOFF_Msk (0x1UL << REGULATORS_SYSTEMOFF_SYSTEMOFF_Pos) /*!< Bit mask of SYSTEMOFF field.   */
  #define REGULATORS_SYSTEMOFF_SYSTEMOFF_Min (0x1UL) /*!< Min enumerator value of SYSTEMOFF field.                             */
  #define REGULATORS_SYSTEMOFF_SYSTEMOFF_Max (0x1UL) /*!< Max enumerator value of SYSTEMOFF field.                             */
  #define REGULATORS_SYSTEMOFF_SYSTEMOFF_Enter (0x1UL) /*!< Enable System OFF mode                                             */


/* REGULATORS_MRAMRECOVERY: MRAM snapshot and recovery trigger register */
  #define REGULATORS_MRAMRECOVERY_ResetValue (0x00000000UL) /*!< Reset value of MRAMRECOVERY register.                         */

/* TAKESNAPSHOT @Bits 0..2 : Firmware sets this bit to request ROM to take an MRAM snapshot during the next boot. */
  #define REGULATORS_MRAMRECOVERY_TAKESNAPSHOT_Pos (0UL) /*!< Position of TAKESNAPSHOT field.                                  */
  #define REGULATORS_MRAMRECOVERY_TAKESNAPSHOT_Msk (0x7UL << REGULATORS_MRAMRECOVERY_TAKESNAPSHOT_Pos) /*!< Bit mask of
                                                                            TAKESNAPSHOT field.*/
  #define REGULATORS_MRAMRECOVERY_TAKESNAPSHOT_Min (0x0UL) /*!< Min enumerator value of TAKESNAPSHOT field.                    */
  #define REGULATORS_MRAMRECOVERY_TAKESNAPSHOT_Max (0x7UL) /*!< Max enumerator value of TAKESNAPSHOT field.                    */
  #define REGULATORS_MRAMRECOVERY_TAKESNAPSHOT_donothing (0x0UL) /*!< Do nothing (default).                                    */
  #define REGULATORS_MRAMRECOVERY_TAKESNAPSHOT_takesnapshot (0x1UL) /*!< Trigger snapshot generation on the next boot.         */
  #define REGULATORS_MRAMRECOVERY_TAKESNAPSHOT_success (0x2UL) /*!< Indicates successful snapshot generation on previous boot. */
  #define REGULATORS_MRAMRECOVERY_TAKESNAPSHOT_nomoresnapshots (0x6UL) /*!< Error during snapshot generation - there is no
                                                                            remaining space in FUSE array to secure another
                                                                            snapshot.*/
  #define REGULATORS_MRAMRECOVERY_TAKESNAPSHOT_error (0x7UL) /*!< Unspecified error during snapshot generation.                */

/* RECOVERMRAM @Bit 3 : Firmware sets this bit to request ROM to recover from snapshot during the next boot. */
  #define REGULATORS_MRAMRECOVERY_RECOVERMRAM_Pos (3UL) /*!< Position of RECOVERMRAM field.                                    */
  #define REGULATORS_MRAMRECOVERY_RECOVERMRAM_Msk (0x1UL << REGULATORS_MRAMRECOVERY_RECOVERMRAM_Pos) /*!< Bit mask of
                                                                            RECOVERMRAM field.*/

/* BOOTCOUNT @Bits 4..7 : Boot counter for MRAM recovery triggering in the presence of a boot loop. Firmware must clear this to
                          zero on a successful boot. */

