NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* LOCKUP @Bit 7 : Reset from CPU lockup detected */
  #define RESET_RESETREAS_LOCKUP_Pos (7UL)           /*!< Position of LOCKUP field.                                            */
  #define RESET_RESETREAS_LOCKUP_Msk (0x1UL << RESET_RESETREAS_LOCKUP_Pos) /*!< Bit mask of LOCKUP field.                      */
  #define RESET_RESETREAS_LOCKUP_Min (0x0UL)         /*!< Min enumerator value of LOCKUP field.                                */
  #define RESET_RESETREAS_LOCKUP_Max (0x1UL)         /*!< Max enumerator value of LOCKUP field.                                */
  #define RESET_RESETREAS_LOCKUP_NotDetected (0x0UL) /*!< Not detected                                                         */
  #define RESET_RESETREAS_LOCKUP_Detected (0x1UL)    /*!< Detected                                                             */

/* OFF @Bit 8 : Reset due to wake-up from System OFF mode when wake-up is triggered by DETECT signal from GPIO */
  #define RESET_RESETREAS_OFF_Pos (8UL)              /*!< Position of OFF field.                                               */
  #define RESET_RESETREAS_OFF_Msk (0x1UL << RESET_RESETREAS_OFF_Pos) /*!< Bit mask of OFF field.                               */
  #define RESET_RESETREAS_OFF_Min (0x0UL)            /*!< Min enumerator value of OFF field.                                   */
  #define RESET_RESETREAS_OFF_Max (0x1UL)            /*!< Max enumerator value of OFF field.                                   */
  #define RESET_RESETREAS_OFF_NotDetected (0x0UL)    /*!< Not detected                                                         */
  #define RESET_RESETREAS_OFF_Detected (0x1UL)       /*!< Detected                                                             */

/* LPCOMP @Bit 9 : Reset due to wake-up from System OFF mode when wake-up is triggered by ANADETECT signal from LPCOMP */
  #define RESET_RESETREAS_LPCOMP_Pos (9UL)           /*!< Position of LPCOMP field.                                            */
  #define RESET_RESETREAS_LPCOMP_Msk (0x1UL << RESET_RESETREAS_LPCOMP_Pos) /*!< Bit mask of LPCOMP field.                      */
  #define RESET_RESETREAS_LPCOMP_Min (0x0UL)         /*!< Min enumerator value of LPCOMP field.                                */
  #define RESET_RESETREAS_LPCOMP_Max (0x1UL)         /*!< Max enumerator value of LPCOMP field.                                */
  #define RESET_RESETREAS_LPCOMP_NotDetected (0x0UL) /*!< Not detected                                                         */
  #define RESET_RESETREAS_LPCOMP_Detected (0x1UL)    /*!< Detected                                                             */

/* DIF @Bit 10 : Reset triggered by Debug Interface */
  #define RESET_RESETREAS_DIF_Pos (10UL)             /*!< Position of DIF field.                                               */
  #define RESET_RESETREAS_DIF_Msk (0x1UL << RESET_RESETREAS_DIF_Pos) /*!< Bit mask of DIF field.                               */
  #define RESET_RESETREAS_DIF_Min (0x0UL)            /*!< Min enumerator value of DIF field.                                   */
  #define RESET_RESETREAS_DIF_Max (0x1UL)            /*!< Max enumerator value of DIF field.                                   */
  #define RESET_RESETREAS_DIF_NotDetected (0x0UL)    /*!< Not detected                                                         */
  #define RESET_RESETREAS_DIF_Detected (0x1UL)       /*!< Detected                                                             */

/* GRTC @Bit 11 : Reset due to wake-up from GRTC */
  #define RESET_RESETREAS_GRTC_Pos (11UL)            /*!< Position of GRTC field.                                              */
  #define RESET_RESETREAS_GRTC_Msk (0x1UL << RESET_RESETREAS_GRTC_Pos) /*!< Bit mask of GRTC field.                            */
  #define RESET_RESETREAS_GRTC_Min (0x0UL)           /*!< Min enumerator value of GRTC field.                                  */
  #define RESET_RESETREAS_GRTC_Max (0x1UL)           /*!< Max enumerator value of GRTC field.                                  */
  #define RESET_RESETREAS_GRTC_NotDetected (0x0UL)   /*!< Not detected                                                         */
  #define RESET_RESETREAS_GRTC_Detected (0x1UL)      /*!< Detected                                                             */

/* NFC @Bit 12 : Reset after wake-up from System OFF mode due to NFC field being detected */
  #define RESET_RESETREAS_NFC_Pos (12UL)             /*!< Position of NFC field.                                               */
  #define RESET_RESETREAS_NFC_Msk (0x1UL << RESET_RESETREAS_NFC_Pos) /*!< Bit mask of NFC field.                               */
  #define RESET_RESETREAS_NFC_Min (0x0UL)            /*!< Min enumerator value of NFC field.                                   */
  #define RESET_RESETREAS_NFC_Max (0x1UL)            /*!< Max enumerator value of NFC field.                                   */
  #define RESET_RESETREAS_NFC_NotDetected (0x0UL)    /*!< Not detected                                                         */
  #define RESET_RESETREAS_NFC_Detected (0x1UL)       /*!< Detected                                                             */

/* SECTAMPER @Bit 13 : Reset due to illegal tampering of the device */
  #define RESET_RESETREAS_SECTAMPER_Pos (13UL)       /*!< Position of SECTAMPER field.                                         */
  #define RESET_RESETREAS_SECTAMPER_Msk (0x1UL << RESET_RESETREAS_SECTAMPER_Pos) /*!< Bit mask of SECTAMPER field.             */
  #define RESET_RESETREAS_SECTAMPER_Min (0x0UL)      /*!< Min enumerator value of SECTAMPER field.                             */
  #define RESET_RESETREAS_SECTAMPER_Max (0x1UL)      /*!< Max enumerator value of SECTAMPER field.                             */
  #define RESET_RESETREAS_SECTAMPER_NotDetected (0x0UL) /*!< Not detected                                                      */
  #define RESET_RESETREAS_SECTAMPER_Detected (0x1UL) /*!< Detected                                                             */

/* VBUS @Bit 14 : Reset after wake-up from System OFF mode due to VBUS rising into valid range */
  #define RESET_RESETREAS_VBUS_Pos (14UL)            /*!< Position of VBUS field.                                              */
  #define RESET_RESETREAS_VBUS_Msk (0x1UL << RESET_RESETREAS_VBUS_Pos) /*!< Bit mask of VBUS field.                            */
  #define RESET_RESETREAS_VBUS_Min (0x0UL)           /*!< Min enumerator value of VBUS field.                                  */
  #define RESET_RESETREAS_VBUS_Max (0x1UL)           /*!< Max enumerator value of VBUS field.                                  */
  #define RESET_RESETREAS_VBUS_NotDetected (0x0UL)   /*!< Not detected                                                         */
  #define RESET_RESETREAS_VBUS_Detected (0x1UL)      /*!< Detected                                                             */

/* LMAC @Bit 16 : Reset from Wi-Fi LMAC watchdog */
  #define RESET_RESETREAS_LMAC_Pos (16UL)            /*!< Position of LMAC field.                                              */
  #define RESET_RESETREAS_LMAC_Msk (0x1UL << RESET_RESETREAS_LMAC_Pos) /*!< Bit mask of LMAC field.                            */
  #define RESET_RESETREAS_LMAC_Min (0x0UL)           /*!< Min enumerator value of LMAC field.                                  */
  #define RESET_RESETREAS_LMAC_Max (0x1UL)           /*!< Max enumerator value of LMAC field.                                  */
  #define RESET_RESETREAS_LMAC_NotDetected (0x0UL)   /*!< Not detected                                                         */
  #define RESET_RESETREAS_LMAC_Detected (0x1UL)      /*!< Detected                                                             */

/* UMAC @Bit 17 : Reset from Wi-Fi UMAC watchdog */
  #define RESET_RESETREAS_UMAC_Pos (17UL)            /*!< Position of UMAC field.                                              */
  #define RESET_RESETREAS_UMAC_Msk (0x1UL << RESET_RESETREAS_UMAC_Pos) /*!< Bit mask of UMAC field.                            */
  #define RESET_RESETREAS_UMAC_Min (0x0UL)           /*!< Min enumerator value of UMAC field.                                  */
  #define RESET_RESETREAS_UMAC_Max (0x1UL)           /*!< Max enumerator value of UMAC field.                                  */
  #define RESET_RESETREAS_UMAC_NotDetected (0x0UL)   /*!< Not detected                                                         */
  #define RESET_RESETREAS_UMAC_Detected (0x1UL)      /*!< Detected                                                             */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           SAADC                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

