NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* ================================================= Struct SAADC_EVENTS_CH ================================================== */
/**
  * @brief EVENTS_CH [SAADC_EVENTS_CH] Peripheral events.
  */
typedef struct {
  __IOM uint32_t  LIMITH;                            /*!< (@ 0x00000000) Last results is above CH[n].LIMIT.HIGH                */
  __IOM uint32_t  LIMITL;                            /*!< (@ 0x00000004) Last results is below CH[n].LIMIT.LOW                 */
} NRF_SAADC_EVENTS_CH_Type;                          /*!< Size = 8 (0x008)                                                     */
  #define SAADC_EVENTS_CH_MaxCount (8UL)             /*!< Size of EVENTS_CH[8] array.                                          */
  #define SAADC_EVENTS_CH_MaxIndex (7UL)             /*!< Max index of EVENTS_CH[8] array.                                     */
  #define SAADC_EVENTS_CH_MinIndex (0UL)             /*!< Min index of EVENTS_CH[8] array.                                     */

/* SAADC_EVENTS_CH_LIMITH: Last results is above CH[n].LIMIT.HIGH */
  #define SAADC_EVENTS_CH_LIMITH_ResetValue (0x00000000UL) /*!< Reset value of LIMITH register.                                */

/* LIMITH @Bit 0 : Last results is above CH[n].LIMIT.HIGH */
  #define SAADC_EVENTS_CH_LIMITH_LIMITH_Pos (0UL)    /*!< Position of LIMITH field.                                            */
  #define SAADC_EVENTS_CH_LIMITH_LIMITH_Msk (0x1UL << SAADC_EVENTS_CH_LIMITH_LIMITH_Pos) /*!< Bit mask of LIMITH field.        */
  #define SAADC_EVENTS_CH_LIMITH_LIMITH_Min (0x0UL)  /*!< Min enumerator value of LIMITH field.                                */
  #define SAADC_EVENTS_CH_LIMITH_LIMITH_Max (0x1UL)  /*!< Max enumerator value of LIMITH field.                                */
  #define SAADC_EVENTS_CH_LIMITH_LIMITH_NotGenerated (0x0UL) /*!< Event not generated                                          */
  #define SAADC_EVENTS_CH_LIMITH_LIMITH_Generated (0x1UL) /*!< Event generated                                                 */


/* SAADC_EVENTS_CH_LIMITL: Last results is below CH[n].LIMIT.LOW */
  #define SAADC_EVENTS_CH_LIMITL_ResetValue (0x00000000UL) /*!< Reset value of LIMITL register.                                */

/* LIMITL @Bit 0 : Last results is below CH[n].LIMIT.LOW */
  #define SAADC_EVENTS_CH_LIMITL_LIMITL_Pos (0UL)    /*!< Position of LIMITL field.                                            */
  #define SAADC_EVENTS_CH_LIMITL_LIMITL_Msk (0x1UL << SAADC_EVENTS_CH_LIMITL_LIMITL_Pos) /*!< Bit mask of LIMITL field.        */
  #define SAADC_EVENTS_CH_LIMITL_LIMITL_Min (0x0UL)  /*!< Min enumerator value of LIMITL field.                                */
  #define SAADC_EVENTS_CH_LIMITL_LIMITL_Max (0x1UL)  /*!< Max enumerator value of LIMITL field.                                */
  #define SAADC_EVENTS_CH_LIMITL_LIMITL_NotGenerated (0x0UL) /*!< Event not generated                                          */
  #define SAADC_EVENTS_CH_LIMITL_LIMITL_Generated (0x1UL) /*!< Event generated                                                 */



/* ================================================= Struct SAADC_PUBLISH_CH ================================================= */
/**
  * @brief PUBLISH_CH [SAADC_PUBLISH_CH] Publish configuration for events
  */
typedef struct {
  __IOM uint32_t  LIMITH;                            /*!< (@ 0x00000000) Publish configuration for event CH[n].LIMITH          */
  __IOM uint32_t  LIMITL;                            /*!< (@ 0x00000004) Publish configuration for event CH[n].LIMITL          */
} NRF_SAADC_PUBLISH_CH_Type;                         /*!< Size = 8 (0x008)                                                     */
  #define SAADC_PUBLISH_CH_MaxCount (8UL)            /*!< Size of PUBLISH_CH[8] array.                                         */
  #define SAADC_PUBLISH_CH_MaxIndex (7UL)            /*!< Max index of PUBLISH_CH[8] array.                                    */
  #define SAADC_PUBLISH_CH_MinIndex (0UL)            /*!< Min index of PUBLISH_CH[8] array.                                    */

/* SAADC_PUBLISH_CH_LIMITH: Publish configuration for event CH[n].LIMITH */
  #define SAADC_PUBLISH_CH_LIMITH_ResetValue (0x00000000UL) /*!< Reset value of LIMITH register.                               */

/* CHIDX @Bits 0..7 : DPPI channel that event CH[n].LIMITH will publish to */
  #define SAADC_PUBLISH_CH_LIMITH_CHIDX_Pos (0UL)    /*!< Position of CHIDX field.                                             */
  #define SAADC_PUBLISH_CH_LIMITH_CHIDX_Msk (0xFFUL << SAADC_PUBLISH_CH_LIMITH_CHIDX_Pos) /*!< Bit mask of CHIDX field.        */
  #define SAADC_PUBLISH_CH_LIMITH_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                            */
  #define SAADC_PUBLISH_CH_LIMITH_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define SAADC_PUBLISH_CH_LIMITH_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define SAADC_PUBLISH_CH_LIMITH_EN_Msk (0x1UL << SAADC_PUBLISH_CH_LIMITH_EN_Pos) /*!< Bit mask of EN field.                  */
  #define SAADC_PUBLISH_CH_LIMITH_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define SAADC_PUBLISH_CH_LIMITH_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define SAADC_PUBLISH_CH_LIMITH_EN_Disabled (0x0UL) /*!< Disable publishing                                                  */
  #define SAADC_PUBLISH_CH_LIMITH_EN_Enabled (0x1UL) /*!< Enable publishing                                                    */


/* SAADC_PUBLISH_CH_LIMITL: Publish configuration for event CH[n].LIMITL */
  #define SAADC_PUBLISH_CH_LIMITL_ResetValue (0x00000000UL) /*!< Reset value of LIMITL register.                               */

/* CHIDX @Bits 0..7 : DPPI channel that event CH[n].LIMITL will publish to */
  #define SAADC_PUBLISH_CH_LIMITL_CHIDX_Pos (0UL)    /*!< Position of CHIDX field.                                             */
  #define SAADC_PUBLISH_CH_LIMITL_CHIDX_Msk (0xFFUL << SAADC_PUBLISH_CH_LIMITL_CHIDX_Pos) /*!< Bit mask of CHIDX field.        */
  #define SAADC_PUBLISH_CH_LIMITL_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                            */
  #define SAADC_PUBLISH_CH_LIMITL_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define SAADC_PUBLISH_CH_LIMITL_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define SAADC_PUBLISH_CH_LIMITL_EN_Msk (0x1UL << SAADC_PUBLISH_CH_LIMITL_EN_Pos) /*!< Bit mask of EN field.                  */
  #define SAADC_PUBLISH_CH_LIMITL_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define SAADC_PUBLISH_CH_LIMITL_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define SAADC_PUBLISH_CH_LIMITL_EN_Disabled (0x0UL) /*!< Disable publishing                                                  */
  #define SAADC_PUBLISH_CH_LIMITL_EN_Enabled (0x1UL) /*!< Enable publishing                                                    */



/* ==================================================== Struct SAADC_TRIM ==================================================== */
/**
  * @brief TRIM [SAADC_TRIM] (unspecified)
  */
typedef struct {
  __IOM uint32_t  LINCALCOEFF[6];                    /*!< (@ 0x00000000) Linearity calibration coefficient                     */
} NRF_SAADC_TRIM_Type;                               /*!< Size = 24 (0x018)                                                    */

/* SAADC_TRIM_LINCALCOEFF: Linearity calibration coefficient */
  #define SAADC_TRIM_LINCALCOEFF_MaxCount (6UL)      /*!< Max size of LINCALCOEFF[6] array.                                    */
  #define SAADC_TRIM_LINCALCOEFF_MaxIndex (5UL)      /*!< Max index of LINCALCOEFF[6] array.                                   */
  #define SAADC_TRIM_LINCALCOEFF_MinIndex (0UL)      /*!< Min index of LINCALCOEFF[6] array.                                   */
  #define SAADC_TRIM_LINCALCOEFF_ResetValue (0x00000000UL) /*!< Reset value of LINCALCOEFF[6] register.                        */

/* VAL @Bits 0..15 : value */
  #define SAADC_TRIM_LINCALCOEFF_VAL_Pos (0UL)       /*!< Position of VAL field.                                               */
  #define SAADC_TRIM_LINCALCOEFF_VAL_Msk (0xFFFFUL << SAADC_TRIM_LINCALCOEFF_VAL_Pos) /*!< Bit mask of VAL field.              */
  #define SAADC_TRIM_LINCALCOEFF_VAL_Min (0x0000UL)  /*!< Min value of VAL field.                                              */
  #define SAADC_TRIM_LINCALCOEFF_VAL_Max (0xFFFFUL)  /*!< Max size of VAL field.                                               */



