NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* ===================================================== Struct SAADC_CH ===================================================== */
/**
  * @brief CH [SAADC_CH] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PSELP;                             /*!< (@ 0x00000000) Input positive pin selection for CH[n]                */
  __IOM uint32_t  PSELN;                             /*!< (@ 0x00000004) Input negative pin selection for CH[n]                */
  __IOM uint32_t  CONFIG;                            /*!< (@ 0x00000008) Input configuration for CH[n]                         */
  __IOM uint32_t  LIMIT;                             /*!< (@ 0x0000000C) High/low limits for event monitoring a channel        */
} NRF_SAADC_CH_Type;                                 /*!< Size = 16 (0x010)                                                    */
  #define SAADC_CH_MaxCount (8UL)                    /*!< Size of CH[8] array.                                                 */
  #define SAADC_CH_MaxIndex (7UL)                    /*!< Max index of CH[8] array.                                            */
  #define SAADC_CH_MinIndex (0UL)                    /*!< Min index of CH[8] array.                                            */

/* SAADC_CH_PSELP: Input positive pin selection for CH[n] */
  #define SAADC_CH_PSELP_ResetValue (0x00000000UL)   /*!< Reset value of PSELP register.                                       */

/* PIN @Bits 0..4 : GPIO pin selection. */
  #define SAADC_CH_PSELP_PIN_Pos (0UL)               /*!< Position of PIN field.                                               */
  #define SAADC_CH_PSELP_PIN_Msk (0x1FUL << SAADC_CH_PSELP_PIN_Pos) /*!< Bit mask of PIN field.                                */

/* PORT @Bits 8..11 : GPIO port selection */
  #define SAADC_CH_PSELP_PORT_Pos (8UL)              /*!< Position of PORT field.                                              */
  #define SAADC_CH_PSELP_PORT_Msk (0xFUL << SAADC_CH_PSELP_PORT_Pos) /*!< Bit mask of PORT field.                              */

/* INTERNAL @Bits 12..13 : Internal input selection for analog positive input when CH[n].PSELP.CONNECT = Internal */
  #define SAADC_CH_PSELP_INTERNAL_Pos (12UL)         /*!< Position of INTERNAL field.                                          */
  #define SAADC_CH_PSELP_INTERNAL_Msk (0x3UL << SAADC_CH_PSELP_INTERNAL_Pos) /*!< Bit mask of INTERNAL field.                  */
  #define SAADC_CH_PSELP_INTERNAL_Min (0x0UL)        /*!< Min enumerator value of INTERNAL field.                              */
  #define SAADC_CH_PSELP_INTERNAL_Max (0x3UL)        /*!< Max enumerator value of INTERNAL field.                              */
  #define SAADC_CH_PSELP_INTERNAL_Internal0 (0x0UL)  /*!< Reserved for future use                                              */
  #define SAADC_CH_PSELP_INTERNAL_Internal1 (0x1UL)  /*!< Reserved for future use                                              */
  #define SAADC_CH_PSELP_INTERNAL_Internal2 (0x2UL)  /*!< Reserved for future use                                              */
  #define SAADC_CH_PSELP_INTERNAL_Internal3 (0x3UL)  /*!< Reserved for future use                                              */

/* TEST @Bits 16..17 : Test input selection for Analog positive input when CH[n].PSELP.CONNECT = Test */
  #define SAADC_CH_PSELP_TEST_Pos (16UL)             /*!< Position of TEST field.                                              */
  #define SAADC_CH_PSELP_TEST_Msk (0x3UL << SAADC_CH_PSELP_TEST_Pos) /*!< Bit mask of TEST field.                              */
  #define SAADC_CH_PSELP_TEST_Min (0x2UL)            /*!< Min enumerator value of TEST field.                                  */
  #define SAADC_CH_PSELP_TEST_Max (0x2UL)            /*!< Max enumerator value of TEST field.                                  */
  #define SAADC_CH_PSELP_TEST_AVSS (0x2UL)           /*!< Connected to analog ground (AVSS)                                    */

/* CONNECT @Bits 30..31 : Connection */
  #define SAADC_CH_PSELP_CONNECT_Pos (30UL)          /*!< Position of CONNECT field.                                           */
  #define SAADC_CH_PSELP_CONNECT_Msk (0x3UL << SAADC_CH_PSELP_CONNECT_Pos) /*!< Bit mask of CONNECT field.                     */
  #define SAADC_CH_PSELP_CONNECT_Min (0x0UL)         /*!< Min enumerator value of CONNECT field.                               */
  #define SAADC_CH_PSELP_CONNECT_Max (0x3UL)         /*!< Max enumerator value of CONNECT field.                               */
  #define SAADC_CH_PSELP_CONNECT_NC (0x0UL)          /*!< Not connected                                                        */
  #define SAADC_CH_PSELP_CONNECT_AnalogInput (0x1UL) /*!< Select analog input                                                  */
  #define SAADC_CH_PSELP_CONNECT_Internal (0x2UL)    /*!< Selects internal inputs.                                             */
  #define SAADC_CH_PSELP_CONNECT_Test (0x3UL)        /*!< Selects test inputs.                                                 */


/* SAADC_CH_PSELN: Input negative pin selection for CH[n] */
  #define SAADC_CH_PSELN_ResetValue (0x00000000UL)   /*!< Reset value of PSELN register.                                       */

/* PIN @Bits 0..4 : GPIO pin selection. */
  #define SAADC_CH_PSELN_PIN_Pos (0UL)               /*!< Position of PIN field.                                               */
  #define SAADC_CH_PSELN_PIN_Msk (0x1FUL << SAADC_CH_PSELN_PIN_Pos) /*!< Bit mask of PIN field.                                */

/* PORT @Bits 8..11 : GPIO Port selection */
  #define SAADC_CH_PSELN_PORT_Pos (8UL)              /*!< Position of PORT field.                                              */
  #define SAADC_CH_PSELN_PORT_Msk (0xFUL << SAADC_CH_PSELN_PORT_Pos) /*!< Bit mask of PORT field.                              */

/* INTERNAL @Bits 12..13 : Internal input selection for analog negative input when CH[n].PSELN.CONNECT = Internal */
  #define SAADC_CH_PSELN_INTERNAL_Pos (12UL)         /*!< Position of INTERNAL field.                                          */
  #define SAADC_CH_PSELN_INTERNAL_Msk (0x3UL << SAADC_CH_PSELN_INTERNAL_Pos) /*!< Bit mask of INTERNAL field.                  */
  #define SAADC_CH_PSELN_INTERNAL_Min (0x0UL)        /*!< Min enumerator value of INTERNAL field.                              */
  #define SAADC_CH_PSELN_INTERNAL_Max (0x3UL)        /*!< Max enumerator value of INTERNAL field.                              */
  #define SAADC_CH_PSELN_INTERNAL_Internal0 (0x0UL)  /*!< Reserved for future use                                              */
  #define SAADC_CH_PSELN_INTERNAL_Internal1 (0x1UL)  /*!< Reserved for future use                                              */
  #define SAADC_CH_PSELN_INTERNAL_Internal2 (0x2UL)  /*!< Connected to VBAT_5V0                                                */
  #define SAADC_CH_PSELN_INTERNAL_Internal3 (0x3UL)  /*!< Reserved for future use                                              */

