NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* MODE @Bit 0 : Mode configuration */
  #define TDM_CONFIG_MODE_MODE_Pos (0UL)             /*!< Position of MODE field.                                              */
  #define TDM_CONFIG_MODE_MODE_Msk (0x1UL << TDM_CONFIG_MODE_MODE_Pos) /*!< Bit mask of MODE field.                            */
  #define TDM_CONFIG_MODE_MODE_Min (0x0UL)           /*!< Min enumerator value of MODE field.                                  */
  #define TDM_CONFIG_MODE_MODE_Max (0x1UL)           /*!< Max enumerator value of MODE field.                                  */
  #define TDM_CONFIG_MODE_MODE_Master (0x0UL)        /*!< Master mode. SCK and FSYNC are created internally and output on
                                                          PSEL.SCK and PSEL.FSYNC.*/
  #define TDM_CONFIG_MODE_MODE_Slave (0x1UL)         /*!< Slave mode. SCK and FSYNC are received on PSEL.SCK and PSEL.FSYNC.   */


/* TDM_CONFIG_RXTXEN: Reception (RX) and transmission (TX) enable. */
  #define TDM_CONFIG_RXTXEN_ResetValue (0x00000000UL) /*!< Reset value of RXTXEN register.                                     */

/* RXTXEN @Bits 0..1 : Enable reception or transmission. */
  #define TDM_CONFIG_RXTXEN_RXTXEN_Pos (0UL)         /*!< Position of RXTXEN field.                                            */
  #define TDM_CONFIG_RXTXEN_RXTXEN_Msk (0x3UL << TDM_CONFIG_RXTXEN_RXTXEN_Pos) /*!< Bit mask of RXTXEN field.                  */
  #define TDM_CONFIG_RXTXEN_RXTXEN_Min (0x0UL)       /*!< Min enumerator value of RXTXEN field.                                */
  #define TDM_CONFIG_RXTXEN_RXTXEN_Max (0x2UL)       /*!< Max enumerator value of RXTXEN field.                                */
  #define TDM_CONFIG_RXTXEN_RXTXEN_Duplex (0x0UL)    /*!< Enable both reception and transmission. Data will be written to the
                                                          RXD.PTR address and data transmitted from the TXD.PTR address.*/
  #define TDM_CONFIG_RXTXEN_RXTXEN_Rx (0x1UL)        /*!< Enable reception, disable transmission. Data will be written to the
                                                          RXD.PTR address.*/
  #define TDM_CONFIG_RXTXEN_RXTXEN_Tx (0x2UL)        /*!< Enable transmission, disable reception. Data will be transmitted from
                                                          the TXD.PTR address.*/


/* TDM_CONFIG_SWIDTH: Sample and word width configuration. */
  #define TDM_CONFIG_SWIDTH_ResetValue (0x00000001UL) /*!< Reset value of SWIDTH register.                                     */

/* SWIDTH @Bits 0..2 : Sample and word width */
  #define TDM_CONFIG_SWIDTH_SWIDTH_Pos (0UL)         /*!< Position of SWIDTH field.                                            */
  #define TDM_CONFIG_SWIDTH_SWIDTH_Msk (0x7UL << TDM_CONFIG_SWIDTH_SWIDTH_Pos) /*!< Bit mask of SWIDTH field.                  */
  #define TDM_CONFIG_SWIDTH_SWIDTH_Min (0x0UL)       /*!< Min enumerator value of SWIDTH field.                                */
  #define TDM_CONFIG_SWIDTH_SWIDTH_Max (0x7UL)       /*!< Max enumerator value of SWIDTH field.                                */
  #define TDM_CONFIG_SWIDTH_SWIDTH_8Bit (0x0UL)      /*!< 8 bit sample in an 8-bit word.                                       */
  #define TDM_CONFIG_SWIDTH_SWIDTH_16Bit (0x1UL)     /*!< 16 bit sample in a 16-bit word.                                      */
  #define TDM_CONFIG_SWIDTH_SWIDTH_24Bit (0x2UL)     /*!< 24 bit sample in a 24-bit word.                                      */
  #define TDM_CONFIG_SWIDTH_SWIDTH_32Bit (0x3UL)     /*!< 32 bit sample in a 32-bit word.                                      */
  #define TDM_CONFIG_SWIDTH_SWIDTH_8BitIn16 (0x4UL)  /*!< 8 bit sample in a 16-bit word.                                       */
  #define TDM_CONFIG_SWIDTH_SWIDTH_8BitIn32 (0x5UL)  /*!< 8 bit sample in a 32-bit word.                                       */
  #define TDM_CONFIG_SWIDTH_SWIDTH_16BitIn32 (0x6UL) /*!< 16 bit sample in a 32-bit word.                                      */
  #define TDM_CONFIG_SWIDTH_SWIDTH_24BitIn32 (0x7UL) /*!< 24 bit sample in a 32-bit word.                                      */


/* TDM_CONFIG_ALIGN: Alignment of sample within the audio data word. */
  #define TDM_CONFIG_ALIGN_ResetValue (0x00000000UL) /*!< Reset value of ALIGN register.                                       */

/* ALIGN @Bit 0 : Alignment of sample within the audio data word. */
  #define TDM_CONFIG_ALIGN_ALIGN_Pos (0UL)           /*!< Position of ALIGN field.                                             */
  #define TDM_CONFIG_ALIGN_ALIGN_Msk (0x1UL << TDM_CONFIG_ALIGN_ALIGN_Pos) /*!< Bit mask of ALIGN field.                       */
  #define TDM_CONFIG_ALIGN_ALIGN_Min (0x0UL)         /*!< Min enumerator value of ALIGN field.                                 */
  #define TDM_CONFIG_ALIGN_ALIGN_Max (0x1UL)         /*!< Max enumerator value of ALIGN field.                                 */
  #define TDM_CONFIG_ALIGN_ALIGN_Left (0x0UL)        /*!< Left-aligned.                                                        */
  #define TDM_CONFIG_ALIGN_ALIGN_Right (0x1UL)       /*!< Right-aligned.                                                       */


/* TDM_CONFIG_ORS: Over-read sample: Extra sample(s) to be transmitted after TXD.MAXCNT bytes have been transmitted. */
  #define TDM_CONFIG_ORS_ResetValue (0x00000000UL)   /*!< Reset value of ORS register.                                         */

/* ORS @Bits 0..31 : Data to transmit after TXD.MAXCNT bytes have been transmitted. */
  #define TDM_CONFIG_ORS_ORS_Pos (0UL)               /*!< Position of ORS field.                                               */
  #define TDM_CONFIG_ORS_ORS_Msk (0xFFFFFFFFUL << TDM_CONFIG_ORS_ORS_Pos) /*!< Bit mask of ORS field.                          */



/* ===================================================== Struct TDM_PSEL ===================================================== */
/**
  * @brief PSEL [TDM_PSEL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  MCK;                               /*!< (@ 0x00000000) Pin select for MCK signal                             */
  __IOM uint32_t  SCK;                               /*!< (@ 0x00000004) Pin select for SCK signal                             */
  __IOM uint32_t  FSYNC;                             /*!< (@ 0x00000008) Pin select for FSYNC signal                           */
  __IOM uint32_t  SDIN;                              /*!< (@ 0x0000000C) Pin select for SDIN signal                            */
  __IOM uint32_t  SDOUT;                             /*!< (@ 0x00000010) Pin select for SDOUT signal                           */
} NRF_TDM_PSEL_Type;                                 /*!< Size = 20 (0x014)                                                    */

/* TDM_PSEL_MCK: Pin select for MCK signal */
  #define TDM_PSEL_MCK_ResetValue (0xFFFFFFFFUL)     /*!< Reset value of MCK register.                                         */

/* PIN @Bits 0..4 : Pin number */
  #define TDM_PSEL_MCK_PIN_Pos (0UL)                 /*!< Position of PIN field.                                               */
  #define TDM_PSEL_MCK_PIN_Msk (0x1FUL << TDM_PSEL_MCK_PIN_Pos) /*!< Bit mask of PIN field.                                    */
  #define TDM_PSEL_MCK_PIN_Min (0x00UL)              /*!< Min value of PIN field.                                              */
  #define TDM_PSEL_MCK_PIN_Max (0x1FUL)              /*!< Max size of PIN field.                                               */

/* PORT @Bits 5..7 : Port number */
  #define TDM_PSEL_MCK_PORT_Pos (5UL)                /*!< Position of PORT field.                                              */
  #define TDM_PSEL_MCK_PORT_Msk (0x7UL << TDM_PSEL_MCK_PORT_Pos) /*!< Bit mask of PORT field.                                  */
  #define TDM_PSEL_MCK_PORT_Min (0x0UL)              /*!< Min value of PORT field.                                             */
  #define TDM_PSEL_MCK_PORT_Max (0x7UL)              /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define TDM_PSEL_MCK_CONNECT_Pos (31UL)            /*!< Position of CONNECT field.                                           */
  #define TDM_PSEL_MCK_CONNECT_Msk (0x1UL << TDM_PSEL_MCK_CONNECT_Pos) /*!< Bit mask of CONNECT field.                         */
  #define TDM_PSEL_MCK_CONNECT_Min (0x0UL)           /*!< Min enumerator value of CONNECT field.                               */
  #define TDM_PSEL_MCK_CONNECT_Max (0x1UL)           /*!< Max enumerator value of CONNECT field.                               */
  #define TDM_PSEL_MCK_CONNECT_Disconnected (0x1UL)  /*!< Disconnect                                                           */
  #define TDM_PSEL_MCK_CONNECT_Connected (0x0UL)     /*!< Connect                                                              */


