NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* TDM_PSEL_SCK: Pin select for SCK signal */
  #define TDM_PSEL_SCK_ResetValue (0xFFFFFFFFUL)     /*!< Reset value of SCK register.                                         */

/* PIN @Bits 0..4 : Pin number */
  #define TDM_PSEL_SCK_PIN_Pos (0UL)                 /*!< Position of PIN field.                                               */
  #define TDM_PSEL_SCK_PIN_Msk (0x1FUL << TDM_PSEL_SCK_PIN_Pos) /*!< Bit mask of PIN field.                                    */
  #define TDM_PSEL_SCK_PIN_Min (0x00UL)              /*!< Min value of PIN field.                                              */
  #define TDM_PSEL_SCK_PIN_Max (0x1FUL)              /*!< Max size of PIN field.                                               */

/* PORT @Bits 5..7 : Port number */
  #define TDM_PSEL_SCK_PORT_Pos (5UL)                /*!< Position of PORT field.                                              */
  #define TDM_PSEL_SCK_PORT_Msk (0x7UL << TDM_PSEL_SCK_PORT_Pos) /*!< Bit mask of PORT field.                                  */
  #define TDM_PSEL_SCK_PORT_Min (0x0UL)              /*!< Min value of PORT field.                                             */
  #define TDM_PSEL_SCK_PORT_Max (0x7UL)              /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define TDM_PSEL_SCK_CONNECT_Pos (31UL)            /*!< Position of CONNECT field.                                           */
  #define TDM_PSEL_SCK_CONNECT_Msk (0x1UL << TDM_PSEL_SCK_CONNECT_Pos) /*!< Bit mask of CONNECT field.                         */
  #define TDM_PSEL_SCK_CONNECT_Min (0x0UL)           /*!< Min enumerator value of CONNECT field.                               */
  #define TDM_PSEL_SCK_CONNECT_Max (0x1UL)           /*!< Max enumerator value of CONNECT field.                               */
  #define TDM_PSEL_SCK_CONNECT_Disconnected (0x1UL)  /*!< Disconnect                                                           */
  #define TDM_PSEL_SCK_CONNECT_Connected (0x0UL)     /*!< Connect                                                              */


/* TDM_PSEL_FSYNC: Pin select for FSYNC signal */
  #define TDM_PSEL_FSYNC_ResetValue (0xFFFFFFFFUL)   /*!< Reset value of FSYNC register.                                       */

/* PIN @Bits 0..4 : Pin number */
  #define TDM_PSEL_FSYNC_PIN_Pos (0UL)               /*!< Position of PIN field.                                               */
  #define TDM_PSEL_FSYNC_PIN_Msk (0x1FUL << TDM_PSEL_FSYNC_PIN_Pos) /*!< Bit mask of PIN field.                                */
  #define TDM_PSEL_FSYNC_PIN_Min (0x00UL)            /*!< Min value of PIN field.                                              */
  #define TDM_PSEL_FSYNC_PIN_Max (0x1FUL)            /*!< Max size of PIN field.                                               */

/* PORT @Bits 5..7 : Port number */
  #define TDM_PSEL_FSYNC_PORT_Pos (5UL)              /*!< Position of PORT field.                                              */
  #define TDM_PSEL_FSYNC_PORT_Msk (0x7UL << TDM_PSEL_FSYNC_PORT_Pos) /*!< Bit mask of PORT field.                              */
  #define TDM_PSEL_FSYNC_PORT_Min (0x0UL)            /*!< Min value of PORT field.                                             */
  #define TDM_PSEL_FSYNC_PORT_Max (0x7UL)            /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define TDM_PSEL_FSYNC_CONNECT_Pos (31UL)          /*!< Position of CONNECT field.                                           */
  #define TDM_PSEL_FSYNC_CONNECT_Msk (0x1UL << TDM_PSEL_FSYNC_CONNECT_Pos) /*!< Bit mask of CONNECT field.                     */
  #define TDM_PSEL_FSYNC_CONNECT_Min (0x0UL)         /*!< Min enumerator value of CONNECT field.                               */
  #define TDM_PSEL_FSYNC_CONNECT_Max (0x1UL)         /*!< Max enumerator value of CONNECT field.                               */
  #define TDM_PSEL_FSYNC_CONNECT_Disconnected (0x1UL) /*!< Disconnect                                                          */
  #define TDM_PSEL_FSYNC_CONNECT_Connected (0x0UL)   /*!< Connect                                                              */


/* TDM_PSEL_SDIN: Pin select for SDIN signal */
  #define TDM_PSEL_SDIN_ResetValue (0xFFFFFFFFUL)    /*!< Reset value of SDIN register.                                        */

/* PIN @Bits 0..4 : Pin number */
  #define TDM_PSEL_SDIN_PIN_Pos (0UL)                /*!< Position of PIN field.                                               */
  #define TDM_PSEL_SDIN_PIN_Msk (0x1FUL << TDM_PSEL_SDIN_PIN_Pos) /*!< Bit mask of PIN field.                                  */
  #define TDM_PSEL_SDIN_PIN_Min (0x00UL)             /*!< Min value of PIN field.                                              */
  #define TDM_PSEL_SDIN_PIN_Max (0x1FUL)             /*!< Max size of PIN field.                                               */

/* PORT @Bits 5..7 : Port number */
  #define TDM_PSEL_SDIN_PORT_Pos (5UL)               /*!< Position of PORT field.                                              */
  #define TDM_PSEL_SDIN_PORT_Msk (0x7UL << TDM_PSEL_SDIN_PORT_Pos) /*!< Bit mask of PORT field.                                */
  #define TDM_PSEL_SDIN_PORT_Min (0x0UL)             /*!< Min value of PORT field.                                             */
  #define TDM_PSEL_SDIN_PORT_Max (0x7UL)             /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define TDM_PSEL_SDIN_CONNECT_Pos (31UL)           /*!< Position of CONNECT field.                                           */
  #define TDM_PSEL_SDIN_CONNECT_Msk (0x1UL << TDM_PSEL_SDIN_CONNECT_Pos) /*!< Bit mask of CONNECT field.                       */
  #define TDM_PSEL_SDIN_CONNECT_Min (0x0UL)          /*!< Min enumerator value of CONNECT field.                               */
  #define TDM_PSEL_SDIN_CONNECT_Max (0x1UL)          /*!< Max enumerator value of CONNECT field.                               */
  #define TDM_PSEL_SDIN_CONNECT_Disconnected (0x1UL) /*!< Disconnect                                                           */
  #define TDM_PSEL_SDIN_CONNECT_Connected (0x0UL)    /*!< Connect                                                              */


/* TDM_PSEL_SDOUT: Pin select for SDOUT signal */
  #define TDM_PSEL_SDOUT_ResetValue (0xFFFFFFFFUL)   /*!< Reset value of SDOUT register.                                       */

/* PIN @Bits 0..4 : Pin number */
  #define TDM_PSEL_SDOUT_PIN_Pos (0UL)               /*!< Position of PIN field.                                               */
  #define TDM_PSEL_SDOUT_PIN_Msk (0x1FUL << TDM_PSEL_SDOUT_PIN_Pos) /*!< Bit mask of PIN field.                                */
  #define TDM_PSEL_SDOUT_PIN_Min (0x00UL)            /*!< Min value of PIN field.                                              */
  #define TDM_PSEL_SDOUT_PIN_Max (0x1FUL)            /*!< Max size of PIN field.                                               */

/* PORT @Bits 5..7 : Port number */
  #define TDM_PSEL_SDOUT_PORT_Pos (5UL)              /*!< Position of PORT field.                                              */
  #define TDM_PSEL_SDOUT_PORT_Msk (0x7UL << TDM_PSEL_SDOUT_PORT_Pos) /*!< Bit mask of PORT field.                              */
  #define TDM_PSEL_SDOUT_PORT_Min (0x0UL)            /*!< Min value of PORT field.                                             */
  #define TDM_PSEL_SDOUT_PORT_Max (0x7UL)            /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define TDM_PSEL_SDOUT_CONNECT_Pos (31UL)          /*!< Position of CONNECT field.                                           */
  #define TDM_PSEL_SDOUT_CONNECT_Msk (0x1UL << TDM_PSEL_SDOUT_CONNECT_Pos) /*!< Bit mask of CONNECT field.                     */
  #define TDM_PSEL_SDOUT_CONNECT_Min (0x0UL)         /*!< Min enumerator value of CONNECT field.                               */
  #define TDM_PSEL_SDOUT_CONNECT_Max (0x1UL)         /*!< Max enumerator value of CONNECT field.                               */
  #define TDM_PSEL_SDOUT_CONNECT_Disconnected (0x1UL) /*!< Disconnect                                                          */
  #define TDM_PSEL_SDOUT_CONNECT_Connected (0x0UL)   /*!< Connect                                                              */



/* ===================================================== Struct TDM_RXD ====================================================== */
/**
  * @brief RXD [TDM_RXD] (unspecified)
  */
typedef struct {
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  PTR;                               /*!< (@ 0x00000004) RAM buffer start address                              */
  __IOM uint32_t  MAXCNT;                            /*!< (@ 0x00000008) Maximum number of bytes in channel buffer             */
  __IM  uint32_t  AMOUNT;                            /*!< (@ 0x0000000C) Number of bytes transferred in the last transaction,
                                                                         updated after the END event.*/
  __IM  uint32_t  CURRENTAMOUNT;                     /*!< (@ 0x00000010) Number of bytes transferred in the current transaction*/
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  MODE;                              /*!< (@ 0x00000018) Configure EasyDMA mode                                */
  __IOM uint32_t  TERMINATEONBUSERROR;               /*!< (@ 0x0000001C) Terminate the transaction if a BUSERROR event is
                                                                         detected.*/
  __IM  uint32_t  BUSERRORADDRESS;                   /*!< (@ 0x00000020) Address of transaction that generated the last BUSERROR
                                                                         event.*/
} NRF_TDM_RXD_Type;                                  /*!< Size = 36 (0x024)                                                    */

/* TDM_RXD_PTR: RAM buffer start address */
  #define TDM_RXD_PTR_ResetValue (0x20000000UL)      /*!< Reset value of PTR register.                                         */

/* PTR @Bits 0..31 : RAM buffer start address for this EasyDMA channel. This address is a word aligned Data RAM address. */
  #define TDM_RXD_PTR_PTR_Pos (0UL)                  /*!< Position of PTR field.                                               */
  #define TDM_RXD_PTR_PTR_Msk (0xFFFFFFFFUL << TDM_RXD_PTR_PTR_Pos) /*!< Bit mask of PTR field.                                */


/* TDM_RXD_MAXCNT: Maximum number of bytes in channel buffer */
  #define TDM_RXD_MAXCNT_ResetValue (0x00000000UL)   /*!< Reset value of MAXCNT register.                                      */

/* MAXCNT @Bits 0..13 : Maximum number of bytes in channel buffer */
  #define TDM_RXD_MAXCNT_MAXCNT_Pos (0UL)            /*!< Position of MAXCNT field.                                            */
  #define TDM_RXD_MAXCNT_MAXCNT_Msk (0x3FFFUL << TDM_RXD_MAXCNT_MAXCNT_Pos) /*!< Bit mask of MAXCNT field.                     */
  #define TDM_RXD_MAXCNT_MAXCNT_Min (0x0001UL)       /*!< Min value of MAXCNT field.                                           */
  #define TDM_RXD_MAXCNT_MAXCNT_Max (0x3FFFUL)       /*!< Max size of MAXCNT field.                                            */


/* TDM_RXD_AMOUNT: Number of bytes transferred in the last transaction, updated after the END event. */
  #define TDM_RXD_AMOUNT_ResetValue (0x00000000UL)   /*!< Reset value of AMOUNT register.                                      */

