NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* COMPARE4 @Bit 20 : Write '1' to disable interrupt for event COMPARE[4] */
  #define TIMER_INTENCLR_COMPARE4_Pos (20UL)         /*!< Position of COMPARE4 field.                                          */
  #define TIMER_INTENCLR_COMPARE4_Msk (0x1UL << TIMER_INTENCLR_COMPARE4_Pos) /*!< Bit mask of COMPARE4 field.                  */
  #define TIMER_INTENCLR_COMPARE4_Min (0x0UL)        /*!< Min enumerator value of COMPARE4 field.                              */
  #define TIMER_INTENCLR_COMPARE4_Max (0x1UL)        /*!< Max enumerator value of COMPARE4 field.                              */
  #define TIMER_INTENCLR_COMPARE4_Clear (0x1UL)      /*!< Disable                                                              */
  #define TIMER_INTENCLR_COMPARE4_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define TIMER_INTENCLR_COMPARE4_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* COMPARE5 @Bit 21 : Write '1' to disable interrupt for event COMPARE[5] */
  #define TIMER_INTENCLR_COMPARE5_Pos (21UL)         /*!< Position of COMPARE5 field.                                          */
  #define TIMER_INTENCLR_COMPARE5_Msk (0x1UL << TIMER_INTENCLR_COMPARE5_Pos) /*!< Bit mask of COMPARE5 field.                  */
  #define TIMER_INTENCLR_COMPARE5_Min (0x0UL)        /*!< Min enumerator value of COMPARE5 field.                              */
  #define TIMER_INTENCLR_COMPARE5_Max (0x1UL)        /*!< Max enumerator value of COMPARE5 field.                              */
  #define TIMER_INTENCLR_COMPARE5_Clear (0x1UL)      /*!< Disable                                                              */
  #define TIMER_INTENCLR_COMPARE5_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define TIMER_INTENCLR_COMPARE5_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* COMPARE6 @Bit 22 : Write '1' to disable interrupt for event COMPARE[6] */
  #define TIMER_INTENCLR_COMPARE6_Pos (22UL)         /*!< Position of COMPARE6 field.                                          */
  #define TIMER_INTENCLR_COMPARE6_Msk (0x1UL << TIMER_INTENCLR_COMPARE6_Pos) /*!< Bit mask of COMPARE6 field.                  */
  #define TIMER_INTENCLR_COMPARE6_Min (0x0UL)        /*!< Min enumerator value of COMPARE6 field.                              */
  #define TIMER_INTENCLR_COMPARE6_Max (0x1UL)        /*!< Max enumerator value of COMPARE6 field.                              */
  #define TIMER_INTENCLR_COMPARE6_Clear (0x1UL)      /*!< Disable                                                              */
  #define TIMER_INTENCLR_COMPARE6_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define TIMER_INTENCLR_COMPARE6_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* COMPARE7 @Bit 23 : Write '1' to disable interrupt for event COMPARE[7] */
  #define TIMER_INTENCLR_COMPARE7_Pos (23UL)         /*!< Position of COMPARE7 field.                                          */
  #define TIMER_INTENCLR_COMPARE7_Msk (0x1UL << TIMER_INTENCLR_COMPARE7_Pos) /*!< Bit mask of COMPARE7 field.                  */
  #define TIMER_INTENCLR_COMPARE7_Min (0x0UL)        /*!< Min enumerator value of COMPARE7 field.                              */
  #define TIMER_INTENCLR_COMPARE7_Max (0x1UL)        /*!< Max enumerator value of COMPARE7 field.                              */
  #define TIMER_INTENCLR_COMPARE7_Clear (0x1UL)      /*!< Disable                                                              */
  #define TIMER_INTENCLR_COMPARE7_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define TIMER_INTENCLR_COMPARE7_Enabled (0x1UL)    /*!< Read: Enabled                                                        */


/* TIMER_INTPEND: Pending interrupts */
  #define TIMER_INTPEND_ResetValue (0x00000000UL)    /*!< Reset value of INTPEND register.                                     */

/* COMPARE0 @Bit 16 : Read pending status of interrupt for event COMPARE[0] */
  #define TIMER_INTPEND_COMPARE0_Pos (16UL)          /*!< Position of COMPARE0 field.                                          */
  #define TIMER_INTPEND_COMPARE0_Msk (0x1UL << TIMER_INTPEND_COMPARE0_Pos) /*!< Bit mask of COMPARE0 field.                    */
  #define TIMER_INTPEND_COMPARE0_Min (0x0UL)         /*!< Min enumerator value of COMPARE0 field.                              */
  #define TIMER_INTPEND_COMPARE0_Max (0x1UL)         /*!< Max enumerator value of COMPARE0 field.                              */
  #define TIMER_INTPEND_COMPARE0_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define TIMER_INTPEND_COMPARE0_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* COMPARE1 @Bit 17 : Read pending status of interrupt for event COMPARE[1] */
  #define TIMER_INTPEND_COMPARE1_Pos (17UL)          /*!< Position of COMPARE1 field.                                          */
  #define TIMER_INTPEND_COMPARE1_Msk (0x1UL << TIMER_INTPEND_COMPARE1_Pos) /*!< Bit mask of COMPARE1 field.                    */
  #define TIMER_INTPEND_COMPARE1_Min (0x0UL)         /*!< Min enumerator value of COMPARE1 field.                              */
  #define TIMER_INTPEND_COMPARE1_Max (0x1UL)         /*!< Max enumerator value of COMPARE1 field.                              */
  #define TIMER_INTPEND_COMPARE1_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define TIMER_INTPEND_COMPARE1_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* COMPARE2 @Bit 18 : Read pending status of interrupt for event COMPARE[2] */
  #define TIMER_INTPEND_COMPARE2_Pos (18UL)          /*!< Position of COMPARE2 field.                                          */
  #define TIMER_INTPEND_COMPARE2_Msk (0x1UL << TIMER_INTPEND_COMPARE2_Pos) /*!< Bit mask of COMPARE2 field.                    */
  #define TIMER_INTPEND_COMPARE2_Min (0x0UL)         /*!< Min enumerator value of COMPARE2 field.                              */
  #define TIMER_INTPEND_COMPARE2_Max (0x1UL)         /*!< Max enumerator value of COMPARE2 field.                              */
  #define TIMER_INTPEND_COMPARE2_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define TIMER_INTPEND_COMPARE2_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* COMPARE3 @Bit 19 : Read pending status of interrupt for event COMPARE[3] */
  #define TIMER_INTPEND_COMPARE3_Pos (19UL)          /*!< Position of COMPARE3 field.                                          */
  #define TIMER_INTPEND_COMPARE3_Msk (0x1UL << TIMER_INTPEND_COMPARE3_Pos) /*!< Bit mask of COMPARE3 field.                    */
  #define TIMER_INTPEND_COMPARE3_Min (0x0UL)         /*!< Min enumerator value of COMPARE3 field.                              */
  #define TIMER_INTPEND_COMPARE3_Max (0x1UL)         /*!< Max enumerator value of COMPARE3 field.                              */
  #define TIMER_INTPEND_COMPARE3_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define TIMER_INTPEND_COMPARE3_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* COMPARE4 @Bit 20 : Read pending status of interrupt for event COMPARE[4] */
  #define TIMER_INTPEND_COMPARE4_Pos (20UL)          /*!< Position of COMPARE4 field.                                          */
  #define TIMER_INTPEND_COMPARE4_Msk (0x1UL << TIMER_INTPEND_COMPARE4_Pos) /*!< Bit mask of COMPARE4 field.                    */
  #define TIMER_INTPEND_COMPARE4_Min (0x0UL)         /*!< Min enumerator value of COMPARE4 field.                              */
  #define TIMER_INTPEND_COMPARE4_Max (0x1UL)         /*!< Max enumerator value of COMPARE4 field.                              */
  #define TIMER_INTPEND_COMPARE4_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define TIMER_INTPEND_COMPARE4_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* COMPARE5 @Bit 21 : Read pending status of interrupt for event COMPARE[5] */
  #define TIMER_INTPEND_COMPARE5_Pos (21UL)          /*!< Position of COMPARE5 field.                                          */
  #define TIMER_INTPEND_COMPARE5_Msk (0x1UL << TIMER_INTPEND_COMPARE5_Pos) /*!< Bit mask of COMPARE5 field.                    */
  #define TIMER_INTPEND_COMPARE5_Min (0x0UL)         /*!< Min enumerator value of COMPARE5 field.                              */
  #define TIMER_INTPEND_COMPARE5_Max (0x1UL)         /*!< Max enumerator value of COMPARE5 field.                              */
  #define TIMER_INTPEND_COMPARE5_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define TIMER_INTPEND_COMPARE5_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* COMPARE6 @Bit 22 : Read pending status of interrupt for event COMPARE[6] */
  #define TIMER_INTPEND_COMPARE6_Pos (22UL)          /*!< Position of COMPARE6 field.                                          */
  #define TIMER_INTPEND_COMPARE6_Msk (0x1UL << TIMER_INTPEND_COMPARE6_Pos) /*!< Bit mask of COMPARE6 field.                    */
  #define TIMER_INTPEND_COMPARE6_Min (0x0UL)         /*!< Min enumerator value of COMPARE6 field.                              */
  #define TIMER_INTPEND_COMPARE6_Max (0x1UL)         /*!< Max enumerator value of COMPARE6 field.                              */
  #define TIMER_INTPEND_COMPARE6_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define TIMER_INTPEND_COMPARE6_Pending (0x1UL)     /*!< Read: Pending                                                        */

