NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* COMPARE7 @Bit 23 : Read pending status of interrupt for event COMPARE[7] */
  #define TIMER_INTPEND_COMPARE7_Pos (23UL)          /*!< Position of COMPARE7 field.                                          */
  #define TIMER_INTPEND_COMPARE7_Msk (0x1UL << TIMER_INTPEND_COMPARE7_Pos) /*!< Bit mask of COMPARE7 field.                    */
  #define TIMER_INTPEND_COMPARE7_Min (0x0UL)         /*!< Min enumerator value of COMPARE7 field.                              */
  #define TIMER_INTPEND_COMPARE7_Max (0x1UL)         /*!< Max enumerator value of COMPARE7 field.                              */
  #define TIMER_INTPEND_COMPARE7_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define TIMER_INTPEND_COMPARE7_Pending (0x1UL)     /*!< Read: Pending                                                        */


/* TIMER_MODE: Timer mode selection */
  #define TIMER_MODE_ResetValue (0x00000000UL)       /*!< Reset value of MODE register.                                        */

/* MODE @Bits 0..1 : Timer mode */
  #define TIMER_MODE_MODE_Pos (0UL)                  /*!< Position of MODE field.                                              */
  #define TIMER_MODE_MODE_Msk (0x3UL << TIMER_MODE_MODE_Pos) /*!< Bit mask of MODE field.                                      */
  #define TIMER_MODE_MODE_Min (0x0UL)                /*!< Min enumerator value of MODE field.                                  */
  #define TIMER_MODE_MODE_Max (0x2UL)                /*!< Max enumerator value of MODE field.                                  */
  #define TIMER_MODE_MODE_Timer (0x0UL)              /*!< Select Timer mode                                                    */
  #define TIMER_MODE_MODE_Counter (0x1UL)            /*!< Select Counter mode                                                  */
  #define TIMER_MODE_MODE_LowPowerCounter (0x2UL)    /*!< Select Low Power Counter mode                                        */


/* TIMER_BITMODE: Configure the number of bits used by the TIMER */
  #define TIMER_BITMODE_ResetValue (0x00000000UL)    /*!< Reset value of BITMODE register.                                     */

/* BITMODE @Bits 0..1 : Timer bit width */
  #define TIMER_BITMODE_BITMODE_Pos (0UL)            /*!< Position of BITMODE field.                                           */
  #define TIMER_BITMODE_BITMODE_Msk (0x3UL << TIMER_BITMODE_BITMODE_Pos) /*!< Bit mask of BITMODE field.                       */
  #define TIMER_BITMODE_BITMODE_Min (0x0UL)          /*!< Min enumerator value of BITMODE field.                               */
  #define TIMER_BITMODE_BITMODE_Max (0x3UL)          /*!< Max enumerator value of BITMODE field.                               */
  #define TIMER_BITMODE_BITMODE_16Bit (0x0UL)        /*!< 16 bit timer bit width                                               */
  #define TIMER_BITMODE_BITMODE_08Bit (0x1UL)        /*!< 8 bit timer bit width                                                */
  #define TIMER_BITMODE_BITMODE_24Bit (0x2UL)        /*!< 24 bit timer bit width                                               */
  #define TIMER_BITMODE_BITMODE_32Bit (0x3UL)        /*!< 32 bit timer bit width                                               */


/* TIMER_PRESCALER: Timer prescaler register */
  #define TIMER_PRESCALER_ResetValue (0x00000004UL)  /*!< Reset value of PRESCALER register.                                   */

/* PRESCALER @Bits 0..3 : Prescaler value */
  #define TIMER_PRESCALER_PRESCALER_Pos (0UL)        /*!< Position of PRESCALER field.                                         */
  #define TIMER_PRESCALER_PRESCALER_Msk (0xFUL << TIMER_PRESCALER_PRESCALER_Pos) /*!< Bit mask of PRESCALER field.             */
  #define TIMER_PRESCALER_PRESCALER_Min (0x0UL)      /*!< Min value of PRESCALER field.                                        */
  #define TIMER_PRESCALER_PRESCALER_Max (0x9UL)      /*!< Max size of PRESCALER field.                                         */


/* TIMER_CC: Capture/Compare register n */
  #define TIMER_CC_MaxCount (8UL)                    /*!< Max size of CC[8] array.                                             */
  #define TIMER_CC_MaxIndex (7UL)                    /*!< Max index of CC[8] array.                                            */
  #define TIMER_CC_MinIndex (0UL)                    /*!< Min index of CC[8] array.                                            */
  #define TIMER_CC_ResetValue (0x00000000UL)         /*!< Reset value of CC[8] register.                                       */

/* CC @Bits 0..31 : Capture/Compare value */
  #define TIMER_CC_CC_Pos (0UL)                      /*!< Position of CC field.                                                */
  #define TIMER_CC_CC_Msk (0xFFFFFFFFUL << TIMER_CC_CC_Pos) /*!< Bit mask of CC field.                                         */


/* TIMER_ONESHOTEN: Enable one-shot operation for Capture/Compare channel n */
  #define TIMER_ONESHOTEN_MaxCount (8UL)             /*!< Max size of ONESHOTEN[8] array.                                      */
  #define TIMER_ONESHOTEN_MaxIndex (7UL)             /*!< Max index of ONESHOTEN[8] array.                                     */
  #define TIMER_ONESHOTEN_MinIndex (0UL)             /*!< Min index of ONESHOTEN[8] array.                                     */
  #define TIMER_ONESHOTEN_ResetValue (0x00000000UL)  /*!< Reset value of ONESHOTEN[8] register.                                */

/* ONESHOTEN @Bit 0 : Enable one-shot operation */
  #define TIMER_ONESHOTEN_ONESHOTEN_Pos (0UL)        /*!< Position of ONESHOTEN field.                                         */
  #define TIMER_ONESHOTEN_ONESHOTEN_Msk (0x1UL << TIMER_ONESHOTEN_ONESHOTEN_Pos) /*!< Bit mask of ONESHOTEN field.             */
  #define TIMER_ONESHOTEN_ONESHOTEN_Min (0x0UL)      /*!< Min enumerator value of ONESHOTEN field.                             */
  #define TIMER_ONESHOTEN_ONESHOTEN_Max (0x1UL)      /*!< Max enumerator value of ONESHOTEN field.                             */
  #define TIMER_ONESHOTEN_ONESHOTEN_Disable (0x0UL)  /*!< Disable one-shot operation                                           */
  #define TIMER_ONESHOTEN_ONESHOTEN_Enable (0x1UL)   /*!< Enable one-shot operation                                            */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           TPIU                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct TPIU ======================================================= */
/**
  * @brief Trace Port Interface Unit
  */
  typedef struct {                                   /*!< TPIU Structure                                                       */
    __IM uint32_t RESERVED;
  } NRF_TPIU_Type;                                   /*!< Size = 4 (0x004)                                                     */

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           TWIM                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================ Struct TWIM_TASKS_DMA_RX ================================================= */
/**
  * @brief RX [TWIM_TASKS_DMA_RX] Peripheral tasks.
  */
typedef struct {
  __OM  uint32_t  START;                             /*!< (@ 0x00000000) Starts operation using easyDMA to load the values. See
                                                                         peripheral description for operation using easyDMA.*/
  __OM  uint32_t  STOP;                              /*!< (@ 0x00000004) Stops operation using easyDMA. This does not trigger an
                                                                         END event.*/
  __OM  uint32_t  ENABLEMATCH[4];                    /*!< (@ 0x00000008) Enables the MATCH[n] event by setting the ENABLE[n] bit
                                                                         in the CONFIG register.*/
  __OM  uint32_t  DISABLEMATCH[4];                   /*!< (@ 0x00000018) Disables the MATCH[n] event by clearing the ENABLE[n]
                                                                         bit in the CONFIG register.*/
} NRF_TWIM_TASKS_DMA_RX_Type;                        /*!< Size = 40 (0x028)                                                    */

