NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* DMARXEND @Bit 19 : Write '1' to enable interrupt for event DMARXEND */
  #define TWIM_INTENSET_DMARXEND_Pos (19UL)          /*!< Position of DMARXEND field.                                          */
  #define TWIM_INTENSET_DMARXEND_Msk (0x1UL << TWIM_INTENSET_DMARXEND_Pos) /*!< Bit mask of DMARXEND field.                    */
  #define TWIM_INTENSET_DMARXEND_Min (0x0UL)         /*!< Min enumerator value of DMARXEND field.                              */
  #define TWIM_INTENSET_DMARXEND_Max (0x1UL)         /*!< Max enumerator value of DMARXEND field.                              */
  #define TWIM_INTENSET_DMARXEND_Set (0x1UL)         /*!< Enable                                                               */
  #define TWIM_INTENSET_DMARXEND_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define TWIM_INTENSET_DMARXEND_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* DMARXREADY @Bit 20 : Write '1' to enable interrupt for event DMARXREADY */
  #define TWIM_INTENSET_DMARXREADY_Pos (20UL)        /*!< Position of DMARXREADY field.                                        */
  #define TWIM_INTENSET_DMARXREADY_Msk (0x1UL << TWIM_INTENSET_DMARXREADY_Pos) /*!< Bit mask of DMARXREADY field.              */
  #define TWIM_INTENSET_DMARXREADY_Min (0x0UL)       /*!< Min enumerator value of DMARXREADY field.                            */
  #define TWIM_INTENSET_DMARXREADY_Max (0x1UL)       /*!< Max enumerator value of DMARXREADY field.                            */
  #define TWIM_INTENSET_DMARXREADY_Set (0x1UL)       /*!< Enable                                                               */
  #define TWIM_INTENSET_DMARXREADY_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define TWIM_INTENSET_DMARXREADY_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* DMARXBUSERROR @Bit 21 : Write '1' to enable interrupt for event DMARXBUSERROR */
  #define TWIM_INTENSET_DMARXBUSERROR_Pos (21UL)     /*!< Position of DMARXBUSERROR field.                                     */
  #define TWIM_INTENSET_DMARXBUSERROR_Msk (0x1UL << TWIM_INTENSET_DMARXBUSERROR_Pos) /*!< Bit mask of DMARXBUSERROR field.     */
  #define TWIM_INTENSET_DMARXBUSERROR_Min (0x0UL)    /*!< Min enumerator value of DMARXBUSERROR field.                         */
  #define TWIM_INTENSET_DMARXBUSERROR_Max (0x1UL)    /*!< Max enumerator value of DMARXBUSERROR field.                         */
  #define TWIM_INTENSET_DMARXBUSERROR_Set (0x1UL)    /*!< Enable                                                               */
  #define TWIM_INTENSET_DMARXBUSERROR_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define TWIM_INTENSET_DMARXBUSERROR_Enabled (0x1UL) /*!< Read: Enabled                                                       */

/* DMARXMATCH0 @Bit 22 : Write '1' to enable interrupt for event DMARXMATCH[0] */
  #define TWIM_INTENSET_DMARXMATCH0_Pos (22UL)       /*!< Position of DMARXMATCH0 field.                                       */
  #define TWIM_INTENSET_DMARXMATCH0_Msk (0x1UL << TWIM_INTENSET_DMARXMATCH0_Pos) /*!< Bit mask of DMARXMATCH0 field.           */
  #define TWIM_INTENSET_DMARXMATCH0_Min (0x0UL)      /*!< Min enumerator value of DMARXMATCH0 field.                           */
  #define TWIM_INTENSET_DMARXMATCH0_Max (0x1UL)      /*!< Max enumerator value of DMARXMATCH0 field.                           */
  #define TWIM_INTENSET_DMARXMATCH0_Set (0x1UL)      /*!< Enable                                                               */
  #define TWIM_INTENSET_DMARXMATCH0_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define TWIM_INTENSET_DMARXMATCH0_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* DMARXMATCH1 @Bit 23 : Write '1' to enable interrupt for event DMARXMATCH[1] */
  #define TWIM_INTENSET_DMARXMATCH1_Pos (23UL)       /*!< Position of DMARXMATCH1 field.                                       */
  #define TWIM_INTENSET_DMARXMATCH1_Msk (0x1UL << TWIM_INTENSET_DMARXMATCH1_Pos) /*!< Bit mask of DMARXMATCH1 field.           */
  #define TWIM_INTENSET_DMARXMATCH1_Min (0x0UL)      /*!< Min enumerator value of DMARXMATCH1 field.                           */
  #define TWIM_INTENSET_DMARXMATCH1_Max (0x1UL)      /*!< Max enumerator value of DMARXMATCH1 field.                           */
  #define TWIM_INTENSET_DMARXMATCH1_Set (0x1UL)      /*!< Enable                                                               */
  #define TWIM_INTENSET_DMARXMATCH1_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define TWIM_INTENSET_DMARXMATCH1_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* DMARXMATCH2 @Bit 24 : Write '1' to enable interrupt for event DMARXMATCH[2] */
  #define TWIM_INTENSET_DMARXMATCH2_Pos (24UL)       /*!< Position of DMARXMATCH2 field.                                       */
  #define TWIM_INTENSET_DMARXMATCH2_Msk (0x1UL << TWIM_INTENSET_DMARXMATCH2_Pos) /*!< Bit mask of DMARXMATCH2 field.           */
  #define TWIM_INTENSET_DMARXMATCH2_Min (0x0UL)      /*!< Min enumerator value of DMARXMATCH2 field.                           */
  #define TWIM_INTENSET_DMARXMATCH2_Max (0x1UL)      /*!< Max enumerator value of DMARXMATCH2 field.                           */
  #define TWIM_INTENSET_DMARXMATCH2_Set (0x1UL)      /*!< Enable                                                               */
  #define TWIM_INTENSET_DMARXMATCH2_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define TWIM_INTENSET_DMARXMATCH2_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* DMARXMATCH3 @Bit 25 : Write '1' to enable interrupt for event DMARXMATCH[3] */
  #define TWIM_INTENSET_DMARXMATCH3_Pos (25UL)       /*!< Position of DMARXMATCH3 field.                                       */
  #define TWIM_INTENSET_DMARXMATCH3_Msk (0x1UL << TWIM_INTENSET_DMARXMATCH3_Pos) /*!< Bit mask of DMARXMATCH3 field.           */
  #define TWIM_INTENSET_DMARXMATCH3_Min (0x0UL)      /*!< Min enumerator value of DMARXMATCH3 field.                           */
  #define TWIM_INTENSET_DMARXMATCH3_Max (0x1UL)      /*!< Max enumerator value of DMARXMATCH3 field.                           */
  #define TWIM_INTENSET_DMARXMATCH3_Set (0x1UL)      /*!< Enable                                                               */
  #define TWIM_INTENSET_DMARXMATCH3_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define TWIM_INTENSET_DMARXMATCH3_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* DMATXEND @Bit 26 : Write '1' to enable interrupt for event DMATXEND */
  #define TWIM_INTENSET_DMATXEND_Pos (26UL)          /*!< Position of DMATXEND field.                                          */
  #define TWIM_INTENSET_DMATXEND_Msk (0x1UL << TWIM_INTENSET_DMATXEND_Pos) /*!< Bit mask of DMATXEND field.                    */
  #define TWIM_INTENSET_DMATXEND_Min (0x0UL)         /*!< Min enumerator value of DMATXEND field.                              */
  #define TWIM_INTENSET_DMATXEND_Max (0x1UL)         /*!< Max enumerator value of DMATXEND field.                              */
  #define TWIM_INTENSET_DMATXEND_Set (0x1UL)         /*!< Enable                                                               */
  #define TWIM_INTENSET_DMATXEND_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define TWIM_INTENSET_DMATXEND_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* DMATXREADY @Bit 27 : Write '1' to enable interrupt for event DMATXREADY */
  #define TWIM_INTENSET_DMATXREADY_Pos (27UL)        /*!< Position of DMATXREADY field.                                        */
  #define TWIM_INTENSET_DMATXREADY_Msk (0x1UL << TWIM_INTENSET_DMATXREADY_Pos) /*!< Bit mask of DMATXREADY field.              */
  #define TWIM_INTENSET_DMATXREADY_Min (0x0UL)       /*!< Min enumerator value of DMATXREADY field.                            */
  #define TWIM_INTENSET_DMATXREADY_Max (0x1UL)       /*!< Max enumerator value of DMATXREADY field.                            */
  #define TWIM_INTENSET_DMATXREADY_Set (0x1UL)       /*!< Enable                                                               */
  #define TWIM_INTENSET_DMATXREADY_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define TWIM_INTENSET_DMATXREADY_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* DMATXBUSERROR @Bit 28 : Write '1' to enable interrupt for event DMATXBUSERROR */
  #define TWIM_INTENSET_DMATXBUSERROR_Pos (28UL)     /*!< Position of DMATXBUSERROR field.                                     */
  #define TWIM_INTENSET_DMATXBUSERROR_Msk (0x1UL << TWIM_INTENSET_DMATXBUSERROR_Pos) /*!< Bit mask of DMATXBUSERROR field.     */
  #define TWIM_INTENSET_DMATXBUSERROR_Min (0x0UL)    /*!< Min enumerator value of DMATXBUSERROR field.                         */
  #define TWIM_INTENSET_DMATXBUSERROR_Max (0x1UL)    /*!< Max enumerator value of DMATXBUSERROR field.                         */
  #define TWIM_INTENSET_DMATXBUSERROR_Set (0x1UL)    /*!< Enable                                                               */
  #define TWIM_INTENSET_DMATXBUSERROR_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define TWIM_INTENSET_DMATXBUSERROR_Enabled (0x1UL) /*!< Read: Enabled                                                       */


/* TWIM_INTENCLR: Disable interrupt */
  #define TWIM_INTENCLR_ResetValue (0x00000000UL)    /*!< Reset value of INTENCLR register.                                    */

/* STOPPED @Bit 1 : Write '1' to disable interrupt for event STOPPED */
  #define TWIM_INTENCLR_STOPPED_Pos (1UL)            /*!< Position of STOPPED field.                                           */
  #define TWIM_INTENCLR_STOPPED_Msk (0x1UL << TWIM_INTENCLR_STOPPED_Pos) /*!< Bit mask of STOPPED field.                       */
  #define TWIM_INTENCLR_STOPPED_Min (0x0UL)          /*!< Min enumerator value of STOPPED field.                               */
  #define TWIM_INTENCLR_STOPPED_Max (0x1UL)          /*!< Max enumerator value of STOPPED field.                               */
  #define TWIM_INTENCLR_STOPPED_Clear (0x1UL)        /*!< Disable                                                              */
  #define TWIM_INTENCLR_STOPPED_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define TWIM_INTENCLR_STOPPED_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* ERROR @Bit 5 : Write '1' to disable interrupt for event ERROR */
  #define TWIM_INTENCLR_ERROR_Pos (5UL)              /*!< Position of ERROR field.                                             */
  #define TWIM_INTENCLR_ERROR_Msk (0x1UL << TWIM_INTENCLR_ERROR_Pos) /*!< Bit mask of ERROR field.                             */
  #define TWIM_INTENCLR_ERROR_Min (0x0UL)            /*!< Min enumerator value of ERROR field.                                 */
  #define TWIM_INTENCLR_ERROR_Max (0x1UL)            /*!< Max enumerator value of ERROR field.                                 */
  #define TWIM_INTENCLR_ERROR_Clear (0x1UL)          /*!< Disable                                                              */
  #define TWIM_INTENCLR_ERROR_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define TWIM_INTENCLR_ERROR_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

