NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* DMARXREADY @Bit 20 : Write '1' to disable interrupt for event DMARXREADY */
  #define UARTE_INTENCLR_DMARXREADY_Pos (20UL)       /*!< Position of DMARXREADY field.                                        */
  #define UARTE_INTENCLR_DMARXREADY_Msk (0x1UL << UARTE_INTENCLR_DMARXREADY_Pos) /*!< Bit mask of DMARXREADY field.            */
  #define UARTE_INTENCLR_DMARXREADY_Min (0x0UL)      /*!< Min enumerator value of DMARXREADY field.                            */
  #define UARTE_INTENCLR_DMARXREADY_Max (0x1UL)      /*!< Max enumerator value of DMARXREADY field.                            */
  #define UARTE_INTENCLR_DMARXREADY_Clear (0x1UL)    /*!< Disable                                                              */
  #define UARTE_INTENCLR_DMARXREADY_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define UARTE_INTENCLR_DMARXREADY_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* DMARXBUSERROR @Bit 21 : Write '1' to disable interrupt for event DMARXBUSERROR */
  #define UARTE_INTENCLR_DMARXBUSERROR_Pos (21UL)    /*!< Position of DMARXBUSERROR field.                                     */
  #define UARTE_INTENCLR_DMARXBUSERROR_Msk (0x1UL << UARTE_INTENCLR_DMARXBUSERROR_Pos) /*!< Bit mask of DMARXBUSERROR field.   */
  #define UARTE_INTENCLR_DMARXBUSERROR_Min (0x0UL)   /*!< Min enumerator value of DMARXBUSERROR field.                         */
  #define UARTE_INTENCLR_DMARXBUSERROR_Max (0x1UL)   /*!< Max enumerator value of DMARXBUSERROR field.                         */
  #define UARTE_INTENCLR_DMARXBUSERROR_Clear (0x1UL) /*!< Disable                                                              */
  #define UARTE_INTENCLR_DMARXBUSERROR_Disabled (0x0UL) /*!< Read: Disabled                                                    */
  #define UARTE_INTENCLR_DMARXBUSERROR_Enabled (0x1UL) /*!< Read: Enabled                                                      */

/* DMARXMATCH0 @Bit 22 : Write '1' to disable interrupt for event DMARXMATCH[0] */
  #define UARTE_INTENCLR_DMARXMATCH0_Pos (22UL)      /*!< Position of DMARXMATCH0 field.                                       */
  #define UARTE_INTENCLR_DMARXMATCH0_Msk (0x1UL << UARTE_INTENCLR_DMARXMATCH0_Pos) /*!< Bit mask of DMARXMATCH0 field.         */
  #define UARTE_INTENCLR_DMARXMATCH0_Min (0x0UL)     /*!< Min enumerator value of DMARXMATCH0 field.                           */
  #define UARTE_INTENCLR_DMARXMATCH0_Max (0x1UL)     /*!< Max enumerator value of DMARXMATCH0 field.                           */
  #define UARTE_INTENCLR_DMARXMATCH0_Clear (0x1UL)   /*!< Disable                                                              */
  #define UARTE_INTENCLR_DMARXMATCH0_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define UARTE_INTENCLR_DMARXMATCH0_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* DMARXMATCH1 @Bit 23 : Write '1' to disable interrupt for event DMARXMATCH[1] */
  #define UARTE_INTENCLR_DMARXMATCH1_Pos (23UL)      /*!< Position of DMARXMATCH1 field.                                       */
  #define UARTE_INTENCLR_DMARXMATCH1_Msk (0x1UL << UARTE_INTENCLR_DMARXMATCH1_Pos) /*!< Bit mask of DMARXMATCH1 field.         */
  #define UARTE_INTENCLR_DMARXMATCH1_Min (0x0UL)     /*!< Min enumerator value of DMARXMATCH1 field.                           */
  #define UARTE_INTENCLR_DMARXMATCH1_Max (0x1UL)     /*!< Max enumerator value of DMARXMATCH1 field.                           */
  #define UARTE_INTENCLR_DMARXMATCH1_Clear (0x1UL)   /*!< Disable                                                              */
  #define UARTE_INTENCLR_DMARXMATCH1_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define UARTE_INTENCLR_DMARXMATCH1_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* DMARXMATCH2 @Bit 24 : Write '1' to disable interrupt for event DMARXMATCH[2] */
  #define UARTE_INTENCLR_DMARXMATCH2_Pos (24UL)      /*!< Position of DMARXMATCH2 field.                                       */
  #define UARTE_INTENCLR_DMARXMATCH2_Msk (0x1UL << UARTE_INTENCLR_DMARXMATCH2_Pos) /*!< Bit mask of DMARXMATCH2 field.         */
  #define UARTE_INTENCLR_DMARXMATCH2_Min (0x0UL)     /*!< Min enumerator value of DMARXMATCH2 field.                           */
  #define UARTE_INTENCLR_DMARXMATCH2_Max (0x1UL)     /*!< Max enumerator value of DMARXMATCH2 field.                           */
  #define UARTE_INTENCLR_DMARXMATCH2_Clear (0x1UL)   /*!< Disable                                                              */
  #define UARTE_INTENCLR_DMARXMATCH2_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define UARTE_INTENCLR_DMARXMATCH2_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* DMARXMATCH3 @Bit 25 : Write '1' to disable interrupt for event DMARXMATCH[3] */
  #define UARTE_INTENCLR_DMARXMATCH3_Pos (25UL)      /*!< Position of DMARXMATCH3 field.                                       */
  #define UARTE_INTENCLR_DMARXMATCH3_Msk (0x1UL << UARTE_INTENCLR_DMARXMATCH3_Pos) /*!< Bit mask of DMARXMATCH3 field.         */
  #define UARTE_INTENCLR_DMARXMATCH3_Min (0x0UL)     /*!< Min enumerator value of DMARXMATCH3 field.                           */
  #define UARTE_INTENCLR_DMARXMATCH3_Max (0x1UL)     /*!< Max enumerator value of DMARXMATCH3 field.                           */
  #define UARTE_INTENCLR_DMARXMATCH3_Clear (0x1UL)   /*!< Disable                                                              */
  #define UARTE_INTENCLR_DMARXMATCH3_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define UARTE_INTENCLR_DMARXMATCH3_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* DMATXEND @Bit 26 : Write '1' to disable interrupt for event DMATXEND */
  #define UARTE_INTENCLR_DMATXEND_Pos (26UL)         /*!< Position of DMATXEND field.                                          */
  #define UARTE_INTENCLR_DMATXEND_Msk (0x1UL << UARTE_INTENCLR_DMATXEND_Pos) /*!< Bit mask of DMATXEND field.                  */
  #define UARTE_INTENCLR_DMATXEND_Min (0x0UL)        /*!< Min enumerator value of DMATXEND field.                              */
  #define UARTE_INTENCLR_DMATXEND_Max (0x1UL)        /*!< Max enumerator value of DMATXEND field.                              */
  #define UARTE_INTENCLR_DMATXEND_Clear (0x1UL)      /*!< Disable                                                              */
  #define UARTE_INTENCLR_DMATXEND_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define UARTE_INTENCLR_DMATXEND_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* DMATXREADY @Bit 27 : Write '1' to disable interrupt for event DMATXREADY */
  #define UARTE_INTENCLR_DMATXREADY_Pos (27UL)       /*!< Position of DMATXREADY field.                                        */
  #define UARTE_INTENCLR_DMATXREADY_Msk (0x1UL << UARTE_INTENCLR_DMATXREADY_Pos) /*!< Bit mask of DMATXREADY field.            */
  #define UARTE_INTENCLR_DMATXREADY_Min (0x0UL)      /*!< Min enumerator value of DMATXREADY field.                            */
  #define UARTE_INTENCLR_DMATXREADY_Max (0x1UL)      /*!< Max enumerator value of DMATXREADY field.                            */
  #define UARTE_INTENCLR_DMATXREADY_Clear (0x1UL)    /*!< Disable                                                              */
  #define UARTE_INTENCLR_DMATXREADY_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define UARTE_INTENCLR_DMATXREADY_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* DMATXBUSERROR @Bit 28 : Write '1' to disable interrupt for event DMATXBUSERROR */
  #define UARTE_INTENCLR_DMATXBUSERROR_Pos (28UL)    /*!< Position of DMATXBUSERROR field.                                     */
  #define UARTE_INTENCLR_DMATXBUSERROR_Msk (0x1UL << UARTE_INTENCLR_DMATXBUSERROR_Pos) /*!< Bit mask of DMATXBUSERROR field.   */
  #define UARTE_INTENCLR_DMATXBUSERROR_Min (0x0UL)   /*!< Min enumerator value of DMATXBUSERROR field.                         */
  #define UARTE_INTENCLR_DMATXBUSERROR_Max (0x1UL)   /*!< Max enumerator value of DMATXBUSERROR field.                         */
  #define UARTE_INTENCLR_DMATXBUSERROR_Clear (0x1UL) /*!< Disable                                                              */
  #define UARTE_INTENCLR_DMATXBUSERROR_Disabled (0x0UL) /*!< Read: Disabled                                                    */
  #define UARTE_INTENCLR_DMATXBUSERROR_Enabled (0x1UL) /*!< Read: Enabled                                                      */

