NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
  #define UICR_USER_ROT_AUTHOPKEY_MaxCount (4UL)     /*!< Size of AUTHOPKEY[4] array.                                          */
  #define UICR_USER_ROT_AUTHOPKEY_MaxIndex (3UL)     /*!< Max index of AUTHOPKEY[4] array.                                     */
  #define UICR_USER_ROT_AUTHOPKEY_MinIndex (0UL)     /*!< Min index of AUTHOPKEY[4] array.                                     */

/* UICR_USER_ROT_AUTHOPKEY_DIGEST: First 256 bits of SHA2-512 digest over RoT authenticated operation public key generation [n].
                                    */

  #define UICR_USER_ROT_AUTHOPKEY_DIGEST_MaxCount (8UL) /*!< Max size of DIGEST[8] array.                                      */
  #define UICR_USER_ROT_AUTHOPKEY_DIGEST_MaxIndex (7UL) /*!< Max index of DIGEST[8] array.                                     */
  #define UICR_USER_ROT_AUTHOPKEY_DIGEST_MinIndex (0UL) /*!< Min index of DIGEST[8] array.                                     */
  #define UICR_USER_ROT_AUTHOPKEY_DIGEST_ResetValue (0xFFFFFFFFUL) /*!< Reset value of DIGEST[8] register.                     */

/* VALUE @Bits 0..31 : Value for word [o] in the key digest [n]. */
  #define UICR_USER_ROT_AUTHOPKEY_DIGEST_VALUE_Pos (0UL) /*!< Position of VALUE field.                                         */
  #define UICR_USER_ROT_AUTHOPKEY_DIGEST_VALUE_Msk (0xFFFFFFFFUL << UICR_USER_ROT_AUTHOPKEY_DIGEST_VALUE_Pos) /*!< Bit mask of
                                                                            VALUE field.*/


/* UICR_USER_ROT_AUTHOPKEY_REVOKE: Revocation status for RoT authenticated operation public key generation [n]. */
  #define UICR_USER_ROT_AUTHOPKEY_REVOKE_MaxCount (3UL) /*!< Max size of REVOKE[3] array.                                      */
  #define UICR_USER_ROT_AUTHOPKEY_REVOKE_MaxIndex (2UL) /*!< Max index of REVOKE[3] array.                                     */
  #define UICR_USER_ROT_AUTHOPKEY_REVOKE_MinIndex (0UL) /*!< Min index of REVOKE[3] array.                                     */
  #define UICR_USER_ROT_AUTHOPKEY_REVOKE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of REVOKE[3] register.                     */

/* STATUS @Bits 0..31 : Revocation status. */
  #define UICR_USER_ROT_AUTHOPKEY_REVOKE_STATUS_Pos (0UL) /*!< Position of STATUS field.                                       */
  #define UICR_USER_ROT_AUTHOPKEY_REVOKE_STATUS_Msk (0xFFFFFFFFUL << UICR_USER_ROT_AUTHOPKEY_REVOKE_STATUS_Pos) /*!< Bit mask of
                                                                            STATUS field.*/
  #define UICR_USER_ROT_AUTHOPKEY_REVOKE_STATUS_Min (0xFFFFFFFFUL) /*!< Min enumerator value of STATUS field.                  */
  #define UICR_USER_ROT_AUTHOPKEY_REVOKE_STATUS_Max (0xFFFFFFFFUL) /*!< Max enumerator value of STATUS field.                  */
  #define UICR_USER_ROT_AUTHOPKEY_REVOKE_STATUS_NotRevoked (0xFFFFFFFFUL) /*!< Key not revoked.                                */



/* ================================================== Struct UICR_USER_ROT =================================================== */
/**
  * @brief ROT [UICR_USER_ROT] Assets installed to establish initial Root of Trust in the device.
  */
typedef struct {
  __IOM NRF_UICR_USER_ROT_PUBKEY_Type PUBKEY[4];     /*!< (@ 0x00000000) (unspecified)                                         */
  __IOM NRF_UICR_USER_ROT_AUTHOPKEY_Type AUTHOPKEY[4]; /*!< (@ 0x000000B0) (unspecified)                                       */
} NRF_UICR_USER_ROT_Type;                            /*!< Size = 352 (0x160)                                                   */


/* ==================================================== Struct UICR_USER ===================================================== */
/**
  * @brief USER [UICR_USER] (unspecified)
  */
typedef struct {
  __IOM NRF_UICR_USER_ROT_Type ROT;                  /*!< (@ 0x00000000) Assets installed to establish initial Root of Trust in
                                                                         the device.*/
} NRF_UICR_USER_Type;                                /*!< Size = 352 (0x160)                                                   */


/* =================================================== Struct UICR_SUPPLY ==================================================== */
/**
  * @brief SUPPLY [UICR_SUPPLY] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CONFIG1V8;                         /*!< (@ 0x00000000) Configuration of VDD_AO_1V8 supply                    */
} NRF_UICR_SUPPLY_Type;                              /*!< Size = 4 (0x004)                                                     */

/* UICR_SUPPLY_CONFIG1V8: Configuration of VDD_AO_1V8 supply */
  #define UICR_SUPPLY_CONFIG1V8_ResetValue (0xFFFFFFFFUL) /*!< Reset value of CONFIG1V8 register.                              */

/* CONFIG @Bits 0..1 : Configuration */
  #define UICR_SUPPLY_CONFIG1V8_CONFIG_Pos (0UL)     /*!< Position of CONFIG field.                                            */
  #define UICR_SUPPLY_CONFIG1V8_CONFIG_Msk (0x3UL << UICR_SUPPLY_CONFIG1V8_CONFIG_Pos) /*!< Bit mask of CONFIG field.          */
  #define UICR_SUPPLY_CONFIG1V8_CONFIG_Min (0x0UL)   /*!< Min enumerator value of CONFIG field.                                */
  #define UICR_SUPPLY_CONFIG1V8_CONFIG_Max (0x2UL)   /*!< Max enumerator value of CONFIG field.                                */
  #define UICR_SUPPLY_CONFIG1V8_CONFIG_NORMAL (0x0UL) /*!< Autonomous control                                                  */
  #define UICR_SUPPLY_CONFIG1V8_CONFIG_EXTERNAL (0x1UL) /*!< 1V8 is supplied externally, disable LDO_VBAT_1V8 regulator        */
  #define UICR_SUPPLY_CONFIG1V8_CONFIG_HIGHLOAD (0x2UL) /*!< High current mode for 1V8 supply to support IO ports or external
                                                             circuits. Keep LDO_VBAT_1V8 in high power mode at all times
                                                             (including sleep modes).*/



/* =================================================== Struct UICR_MACADDR =================================================== */
/**
  * @brief MACADDR [UICR_MACADDR] 48-bit MAC address n
  */
typedef struct {
  __IOM uint32_t  LOW;                               /*!< (@ 0x00000000) Lower 24 bits of MAC address n                        */
  __IOM uint32_t  HIGH;                              /*!< (@ 0x00000004) Upper 24 bits of MAC address n                        */
} NRF_UICR_MACADDR_Type;                             /*!< Size = 8 (0x008)                                                     */
  #define UICR_MACADDR_MaxCount (2UL)                /*!< Size of MACADDR[2] array.                                            */
  #define UICR_MACADDR_MaxIndex (1UL)                /*!< Max index of MACADDR[2] array.                                       */
  #define UICR_MACADDR_MinIndex (0UL)                /*!< Min index of MACADDR[2] array.                                       */

/* UICR_MACADDR_LOW: Lower 24 bits of MAC address n */
  #define UICR_MACADDR_LOW_ResetValue (0xFFFFFFFFUL) /*!< Reset value of LOW register.                                         */

/* ADDR @Bits 0..23 : MAC address bits [23:0] */
  #define UICR_MACADDR_LOW_ADDR_Pos (0UL)            /*!< Position of ADDR field.                                              */
  #define UICR_MACADDR_LOW_ADDR_Msk (0xFFFFFFUL << UICR_MACADDR_LOW_ADDR_Pos) /*!< Bit mask of ADDR field.                     */


