NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* UICR_MACADDR_HIGH: Upper 24 bits of MAC address n */
  #define UICR_MACADDR_HIGH_ResetValue (0xFFFFFFFFUL) /*!< Reset value of HIGH register.                                       */

/* ADDR @Bits 0..23 : MAC address bits [47:24] */
  #define UICR_MACADDR_HIGH_ADDR_Pos (0UL)           /*!< Position of ADDR field.                                              */
  #define UICR_MACADDR_HIGH_ADDR_Msk (0xFFFFFFUL << UICR_MACADDR_HIGH_ADDR_Pos) /*!< Bit mask of ADDR field.                   */



/* ================================================== Struct UICR_XTALCOMP =================================================== */
/**
  * @brief XTALCOMP [UICR_XTALCOMP] Crystal oscillator (XTAL) temperature compensation data
  */
typedef struct {
  __IOM uint32_t  OFFSET;                            /*!< (@ 0x00000000) Measured XTAL frequency error at room temperature     */
  __IOM uint32_t  LOWTEMPTHRESHOLD;                  /*!< (@ 0x00000004) Low temperature threshold for frequency skew
                                                                         compensation*/
  __IOM uint32_t  LOWTEMPADJUST;                     /*!< (@ 0x00000008) Frequency adjustment applied below the low temperature
                                                                         threshold*/
  __IM  uint32_t  RESERVED[5];
} NRF_UICR_XTALCOMP_Type;                            /*!< Size = 32 (0x020)                                                    */

/* UICR_XTALCOMP_OFFSET: Measured XTAL frequency error at room temperature */
  #define UICR_XTALCOMP_OFFSET_ResetValue (0xFFFFFFFFUL) /*!< Reset value of OFFSET register.                                  */

/* OFFSET @Bits 0..31 : Frequency error in ppm */
  #define UICR_XTALCOMP_OFFSET_OFFSET_Pos (0UL)      /*!< Position of OFFSET field.                                            */
  #define UICR_XTALCOMP_OFFSET_OFFSET_Msk (0xFFFFFFFFUL << UICR_XTALCOMP_OFFSET_OFFSET_Pos) /*!< Bit mask of OFFSET field.     */


/* UICR_XTALCOMP_LOWTEMPTHRESHOLD: Low temperature threshold for frequency skew compensation */
  #define UICR_XTALCOMP_LOWTEMPTHRESHOLD_ResetValue (0xFFFFFFFFUL) /*!< Reset value of LOWTEMPTHRESHOLD register.              */

/* THRESHOLD @Bits 0..31 : Low temperature threshold */
  #define UICR_XTALCOMP_LOWTEMPTHRESHOLD_THRESHOLD_Pos (0UL) /*!< Position of THRESHOLD field.                                 */
  #define UICR_XTALCOMP_LOWTEMPTHRESHOLD_THRESHOLD_Msk (0xFFFFFFFFUL << UICR_XTALCOMP_LOWTEMPTHRESHOLD_THRESHOLD_Pos) /*!< Bit
                                                                            mask of THRESHOLD field.*/


/* UICR_XTALCOMP_LOWTEMPADJUST: Frequency adjustment applied below the low temperature threshold */
  #define UICR_XTALCOMP_LOWTEMPADJUST_ResetValue (0xFFFFFFFFUL) /*!< Reset value of LOWTEMPADJUST register.                    */

/* ADJUST @Bits 0..31 : Frequency adjustment in ppm */
  #define UICR_XTALCOMP_LOWTEMPADJUST_ADJUST_Pos (0UL) /*!< Position of ADJUST field.                                          */
  #define UICR_XTALCOMP_LOWTEMPADJUST_ADJUST_Msk (0xFFFFFFFFUL << UICR_XTALCOMP_LOWTEMPADJUST_ADJUST_Pos) /*!< Bit mask of
                                                                            ADJUST field.*/


/* ======================================================= Struct UICR ======================================================= */
/**
  * @brief User Information Configuration Registers
  */
  typedef struct {                                   /*!< UICR Structure                                                       */
    __IOM NRF_UICR_APPROTECT_Type APPROTECT[1];      /*!< (@ 0x00000000) Access Port Protection Registers                      */
    __IOM NRF_UICR_SECUREAPPROTECT_Type SECUREAPPROTECT; /*!< (@ 0x00000020) Access Port Protection Registers                  */
    __IOM NRF_UICR_AUXAPPROTECT_Type AUXAPPROTECT;   /*!< (@ 0x00000040) Access Port Protection Registers                      */
    __IOM NRF_UICR_ERASEPROTECT_Type ERASEPROTECT[1]; /*!< (@ 0x00000060) Erase Protection Registers                           */
    __IOM uint32_t BOOTCONF;                         /*!< (@ 0x00000080) Immutable boot region configuration.                  */
    __IM uint32_t RESERVED[95];
    __IOM NRF_UICR_USER_Type USER;                   /*!< (@ 0x00000200) (unspecified)                                         */
    __IM uint32_t RESERVED1[40];
    __IOM NRF_UICR_SUPPLY_Type SUPPLY;               /*!< (@ 0x00000400) (unspecified)                                         */
    __IM uint32_t RESERVED2[7];
    __IOM NRF_UICR_MACADDR_Type MACADDR[2];          /*!< (@ 0x00000420) 48-bit MAC address n                                  */
    __IM uint32_t RESERVED3[4];
    __IOM NRF_UICR_XTALCOMP_Type XTALCOMP;           /*!< (@ 0x00000440) Crystal oscillator (XTAL) temperature compensation
                                                                         data*/
    __IM uint32_t RESERVED4[40];
    __IOM uint32_t OTP[320];                         /*!< (@ 0x00000500) One time programmable memory                          */
  } NRF_UICR_Type;                                   /*!< Size = 2560 (0xA00)                                                  */

/* UICR_BOOTCONF: Immutable boot region configuration. */
  #define UICR_BOOTCONF_ResetValue (0xFFFFFFFFUL)    /*!< Reset value of BOOTCONF register.                                    */

/* READ @Bit 0 : Read access. Must be enabled in order for the Arm Cortex CPU to start executing from MRAM. */
  #define UICR_BOOTCONF_READ_Pos (0UL)               /*!< Position of READ field.                                              */
  #define UICR_BOOTCONF_READ_Msk (0x1UL << UICR_BOOTCONF_READ_Pos) /*!< Bit mask of READ field.                                */
  #define UICR_BOOTCONF_READ_Min (0x0UL)             /*!< Min enumerator value of READ field.                                  */
  #define UICR_BOOTCONF_READ_Max (0x1UL)             /*!< Max enumerator value of READ field.                                  */
  #define UICR_BOOTCONF_READ_NotAllowed (0x0UL)      /*!< Reading from the region is not allowed.                              */
  #define UICR_BOOTCONF_READ_Allowed (0x1UL)         /*!< Reading from the region is allowed                                   */

