NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* WRITE @Bit 1 : Write access */
  #define UICR_BOOTCONF_WRITE_Pos (1UL)              /*!< Position of WRITE field.                                             */
  #define UICR_BOOTCONF_WRITE_Msk (0x1UL << UICR_BOOTCONF_WRITE_Pos) /*!< Bit mask of WRITE field.                             */
  #define UICR_BOOTCONF_WRITE_Min (0x0UL)            /*!< Min enumerator value of WRITE field.                                 */
  #define UICR_BOOTCONF_WRITE_Max (0x1UL)            /*!< Max enumerator value of WRITE field.                                 */
  #define UICR_BOOTCONF_WRITE_NotAllowed (0x0UL)     /*!< Writing to the region is not allowed                                 */
  #define UICR_BOOTCONF_WRITE_Allowed (0x1UL)        /*!< Writing to the region is allowed                                     */

/* EXECUTE @Bit 2 : Execute access */
  #define UICR_BOOTCONF_EXECUTE_Pos (2UL)            /*!< Position of EXECUTE field.                                           */
  #define UICR_BOOTCONF_EXECUTE_Msk (0x1UL << UICR_BOOTCONF_EXECUTE_Pos) /*!< Bit mask of EXECUTE field.                       */
  #define UICR_BOOTCONF_EXECUTE_Min (0x0UL)          /*!< Min enumerator value of EXECUTE field.                               */
  #define UICR_BOOTCONF_EXECUTE_Max (0x1UL)          /*!< Max enumerator value of EXECUTE field.                               */
  #define UICR_BOOTCONF_EXECUTE_NotAllowed (0x0UL)   /*!< Executing code from the region is not allowed                        */
  #define UICR_BOOTCONF_EXECUTE_Allowed (0x1UL)      /*!< Executing code from the region is allowed                            */

/* SECURE @Bit 3 : Secure access */
  #define UICR_BOOTCONF_SECURE_Pos (3UL)             /*!< Position of SECURE field.                                            */
  #define UICR_BOOTCONF_SECURE_Msk (0x1UL << UICR_BOOTCONF_SECURE_Pos) /*!< Bit mask of SECURE field.                          */
  #define UICR_BOOTCONF_SECURE_Min (0x0UL)           /*!< Min enumerator value of SECURE field.                                */
  #define UICR_BOOTCONF_SECURE_Max (0x1UL)           /*!< Max enumerator value of SECURE field.                                */
  #define UICR_BOOTCONF_SECURE_NonSecure (0x0UL)     /*!< Both secure and non-secure access to region is allowed               */
  #define UICR_BOOTCONF_SECURE_Secure (0x1UL)        /*!< Only secure access to region is allowed                              */

/* WRITEONCE @Bit 12 : Write-once */
  #define UICR_BOOTCONF_WRITEONCE_Pos (12UL)         /*!< Position of WRITEONCE field.                                         */
  #define UICR_BOOTCONF_WRITEONCE_Msk (0x1UL << UICR_BOOTCONF_WRITEONCE_Pos) /*!< Bit mask of WRITEONCE field.                 */
  #define UICR_BOOTCONF_WRITEONCE_Min (0x0UL)        /*!< Min enumerator value of WRITEONCE field.                             */
  #define UICR_BOOTCONF_WRITEONCE_Max (0x1UL)        /*!< Max enumerator value of WRITEONCE field.                             */
  #define UICR_BOOTCONF_WRITEONCE_Disabled (0x0UL)   /*!< Write-once disabled                                                  */
  #define UICR_BOOTCONF_WRITEONCE_Enabled (0x1UL)    /*!< Write-once enabled                                                   */

/* LOCK @Bit 13 : Enable lock of configuration register */
  #define UICR_BOOTCONF_LOCK_Pos (13UL)              /*!< Position of LOCK field.                                              */
  #define UICR_BOOTCONF_LOCK_Msk (0x1UL << UICR_BOOTCONF_LOCK_Pos) /*!< Bit mask of LOCK field.                                */
  #define UICR_BOOTCONF_LOCK_Min (0x0UL)             /*!< Min enumerator value of LOCK field.                                  */
  #define UICR_BOOTCONF_LOCK_Max (0x1UL)             /*!< Max enumerator value of LOCK field.                                  */
  #define UICR_BOOTCONF_LOCK_Disabled (0x0UL)        /*!< Lock is disabled, and the MRAMC region configuration registers for the
                                                          immutable boot region are writable.*/
  #define UICR_BOOTCONF_LOCK_Enabled (0x1UL)         /*!< Lock is enabled, and the MRAMC configuration registers for the
                                                          immutable boot region are read-only.*/

/* SIZE @Bits 16..20 : Immutable boot region size */
  #define UICR_BOOTCONF_SIZE_Pos (16UL)              /*!< Position of SIZE field.                                              */
  #define UICR_BOOTCONF_SIZE_Msk (0x1FUL << UICR_BOOTCONF_SIZE_Pos) /*!< Bit mask of SIZE field.                               */


/* UICR_OTP: One time programmable memory */
  #define UICR_OTP_MaxCount (320UL)                  /*!< Max size of OTP[320] array.                                          */
  #define UICR_OTP_MaxIndex (319UL)                  /*!< Max index of OTP[320] array.                                         */
  #define UICR_OTP_MinIndex (0UL)                    /*!< Min index of OTP[320] array.                                         */
  #define UICR_OTP_ResetValue (0xFFFFFFFFUL)         /*!< Reset value of OTP[320] register.                                    */

/* OTP @Bits 0..31 : OTP word */
  #define UICR_OTP_OTP_Pos (0UL)                     /*!< Position of OTP field.                                               */
  #define UICR_OTP_OTP_Msk (0xFFFFFFFFUL << UICR_OTP_OTP_Pos) /*!< Bit mask of OTP field.                                      */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           USBHS                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ==================================================== Struct USBHS_PHY ===================================================== */
/**
  * @brief PHY [USBHS_PHY] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CONFIG;                            /*!< (@ 0x00000000) USB PHY parameter overrides                           */
  __IOM uint32_t  CLOCK;                             /*!< (@ 0x00000004) USB PHY clock configurations                          */
  __IOM uint32_t  BATTCHRG;                          /*!< (@ 0x00000008) Battery Charging Configuration                        */
  __IM  uint32_t  BATTCHRGSTATUS;                    /*!< (@ 0x0000000C) Battery charger input signals                         */
  __IM  uint32_t  RESERVED[2];
  __IOM uint32_t  INPUTOVERRIDE;                     /*!< (@ 0x00000018) Enables overriding of individual signals to the PHY,
                                                                         the override values are set in PHY.OVERRIDEVALUES*/
  __IOM uint32_t  OVERRIDEVALUES;                    /*!< (@ 0x0000001C) Values that are used to override the input signals to
                                                                         the PHY.*/
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  RTUNE;                             /*!< (@ 0x00000024) The RTUNE mode is an alternative method for calibrating
                                                                         the DP and DM 45-Ohm source impedance.*/
} NRF_USBHS_PHY_Type;                                /*!< Size = 40 (0x028)                                                    */

/* USBHS_PHY_CONFIG: USB PHY parameter overrides */
  #define USBHS_PHY_CONFIG_ResetValue (0x5533D6F0UL) /*!< Reset value of CONFIG register.                                      */

/* PLLITUNE @Bits 0..1 : PLL Integral Path Tune */
  #define USBHS_PHY_CONFIG_PLLITUNE_Pos (0UL)        /*!< Position of PLLITUNE field.                                          */
  #define USBHS_PHY_CONFIG_PLLITUNE_Msk (0x3UL << USBHS_PHY_CONFIG_PLLITUNE_Pos) /*!< Bit mask of PLLITUNE field.              */
  #define USBHS_PHY_CONFIG_PLLITUNE_Min (0x0UL)      /*!< Min value of PLLITUNE field.                                         */
  #define USBHS_PHY_CONFIG_PLLITUNE_Max (0x3UL)      /*!< Max size of PLLITUNE field.                                          */

/* PLLPTUNE @Bits 2..5 : PLL Proportional Path Tune */
  #define USBHS_PHY_CONFIG_PLLPTUNE_Pos (2UL)        /*!< Position of PLLPTUNE field.                                          */
  #define USBHS_PHY_CONFIG_PLLPTUNE_Msk (0xFUL << USBHS_PHY_CONFIG_PLLPTUNE_Pos) /*!< Bit mask of PLLPTUNE field.              */
  #define USBHS_PHY_CONFIG_PLLPTUNE_Min (0x0UL)      /*!< Min value of PLLPTUNE field.                                         */
  #define USBHS_PHY_CONFIG_PLLPTUNE_Max (0xFUL)      /*!< Max size of PLLPTUNE field.                                          */

/* COMPDISTUNE0 @Bits 6..8 : Disconnect Threshold Adjustment */
  #define USBHS_PHY_CONFIG_COMPDISTUNE0_Pos (6UL)    /*!< Position of COMPDISTUNE0 field.                                      */
  #define USBHS_PHY_CONFIG_COMPDISTUNE0_Msk (0x7UL << USBHS_PHY_CONFIG_COMPDISTUNE0_Pos) /*!< Bit mask of COMPDISTUNE0 field.  */
  #define USBHS_PHY_CONFIG_COMPDISTUNE0_Min (0x0UL)  /*!< Min value of COMPDISTUNE0 field.                                     */
  #define USBHS_PHY_CONFIG_COMPDISTUNE0_Max (0x7UL)  /*!< Max size of COMPDISTUNE0 field.                                      */

/* SQRXTUNE0 @Bits 9..11 : Squelch Threshold Adjustment */
  #define USBHS_PHY_CONFIG_SQRXTUNE0_Pos (9UL)       /*!< Position of SQRXTUNE0 field.                                         */
  #define USBHS_PHY_CONFIG_SQRXTUNE0_Msk (0x7UL << USBHS_PHY_CONFIG_SQRXTUNE0_Pos) /*!< Bit mask of SQRXTUNE0 field.           */
  #define USBHS_PHY_CONFIG_SQRXTUNE0_Min (0x0UL)     /*!< Min value of SQRXTUNE0 field.                                        */
  #define USBHS_PHY_CONFIG_SQRXTUNE0_Max (0x3UL)     /*!< Max size of SQRXTUNE0 field.                                         */

/* VDATREFTUNE0 @Bits 12..13 : Data Detect Voltage Adjustment */
  #define USBHS_PHY_CONFIG_VDATREFTUNE0_Pos (12UL)   /*!< Position of VDATREFTUNE0 field.                                      */
  #define USBHS_PHY_CONFIG_VDATREFTUNE0_Msk (0x3UL << USBHS_PHY_CONFIG_VDATREFTUNE0_Pos) /*!< Bit mask of VDATREFTUNE0 field.  */
  #define USBHS_PHY_CONFIG_VDATREFTUNE0_Min (0x0UL)  /*!< Min value of VDATREFTUNE0 field.                                     */
  #define USBHS_PHY_CONFIG_VDATREFTUNE0_Max (0x3UL)  /*!< Max size of VDATREFTUNE0 field.                                      */

/* TXHSXVTUNE0 @Bits 14..15 : Transmitter High-Speed Crossover Adjustment */
  #define USBHS_PHY_CONFIG_TXHSXVTUNE0_Pos (14UL)    /*!< Position of TXHSXVTUNE0 field.                                       */
  #define USBHS_PHY_CONFIG_TXHSXVTUNE0_Msk (0x3UL << USBHS_PHY_CONFIG_TXHSXVTUNE0_Pos) /*!< Bit mask of TXHSXVTUNE0 field.     */
  #define USBHS_PHY_CONFIG_TXHSXVTUNE0_Min (0x0UL)   /*!< Min value of TXHSXVTUNE0 field.                                      */
  #define USBHS_PHY_CONFIG_TXHSXVTUNE0_Max (0x2UL)   /*!< Max size of TXHSXVTUNE0 field.                                       */

