NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
    __IOM uint32_t DOEPCTL3;                         /*!< (@ 0x00000B60) Device Control OUT Endpoint Control Register 3        */
    __IM uint32_t RESERVED52;
    __IOM uint32_t DOEPINT3;                         /*!< (@ 0x00000B68) Device OUT Endpoint Interrupt Register 3              */
    __IM uint32_t RESERVED53;
    __IOM uint32_t DOEPTSIZ3;                        /*!< (@ 0x00000B70) Device OUT Endpoint Transfer Size Register 3          */
    __IOM uint32_t DOEPDMA3;                         /*!< (@ 0x00000B74) Device OUT Endpoint DMA Address Register 3            */
    __IM uint32_t RESERVED54;
    __IOM uint32_t DOEPDMAB3;                        /*!< (@ 0x00000B7C) Device OUT Endpoint Buffer Address Register 3         */
    __IOM uint32_t DOEPCTL4;                         /*!< (@ 0x00000B80) Device Control OUT Endpoint Control Register 4        */
    __IM uint32_t RESERVED55;
    __IOM uint32_t DOEPINT4;                         /*!< (@ 0x00000B88) Device OUT Endpoint Interrupt Register 4              */
    __IM uint32_t RESERVED56;
    __IOM uint32_t DOEPTSIZ4;                        /*!< (@ 0x00000B90) Device OUT Endpoint Transfer Size Register 4          */
    __IOM uint32_t DOEPDMA4;                         /*!< (@ 0x00000B94) Device OUT Endpoint DMA Address Register 4            */
    __IM uint32_t RESERVED57;
    __IOM uint32_t DOEPDMAB4;                        /*!< (@ 0x00000B9C) Device OUT Endpoint Buffer Address Register 4         */
    __IOM uint32_t DOEPCTL5;                         /*!< (@ 0x00000BA0) Device Control OUT Endpoint Control Register 5        */
    __IM uint32_t RESERVED58;
    __IOM uint32_t DOEPINT5;                         /*!< (@ 0x00000BA8) Device OUT Endpoint Interrupt Register 5              */
    __IM uint32_t RESERVED59;
    __IOM uint32_t DOEPTSIZ5;                        /*!< (@ 0x00000BB0) Device OUT Endpoint Transfer Size Register 5          */
    __IOM uint32_t DOEPDMA5;                         /*!< (@ 0x00000BB4) Device OUT Endpoint DMA Address Register 5            */
    __IM uint32_t RESERVED60;
    __IOM uint32_t DOEPDMAB5;                        /*!< (@ 0x00000BBC) Device OUT Endpoint Buffer Address Register 5         */
    __IOM uint32_t DOEPCTL6;                         /*!< (@ 0x00000BC0) Device Control OUT Endpoint Control Register 6        */
    __IM uint32_t RESERVED61;
    __IOM uint32_t DOEPINT6;                         /*!< (@ 0x00000BC8) Device OUT Endpoint Interrupt Register 6              */
    __IM uint32_t RESERVED62;
    __IOM uint32_t DOEPTSIZ6;                        /*!< (@ 0x00000BD0) Device OUT Endpoint Transfer Size Register 6          */
    __IOM uint32_t DOEPDMA6;                         /*!< (@ 0x00000BD4) Device OUT Endpoint DMA Address Register 6            */
    __IM uint32_t RESERVED63;
    __IOM uint32_t DOEPDMAB6;                        /*!< (@ 0x00000BDC) Device OUT Endpoint Buffer Address Register 6         */
    __IOM uint32_t DOEPCTL7;                         /*!< (@ 0x00000BE0) Device Control OUT Endpoint Control Register 7        */
    __IM uint32_t RESERVED64;
    __IOM uint32_t DOEPINT7;                         /*!< (@ 0x00000BE8) Device OUT Endpoint Interrupt Register 7              */
    __IM uint32_t RESERVED65;
    __IOM uint32_t DOEPTSIZ7;                        /*!< (@ 0x00000BF0) Device OUT Endpoint Transfer Size Register 7          */
    __IOM uint32_t DOEPDMA7;                         /*!< (@ 0x00000BF4) Device OUT Endpoint DMA Address Register 7            */
    __IM uint32_t RESERVED66;
    __IOM uint32_t DOEPDMAB7;                        /*!< (@ 0x00000BFC) Device OUT Endpoint Buffer Address Register 7         */
    __IOM uint32_t DOEPCTL8;                         /*!< (@ 0x00000C00) Device Control OUT Endpoint Control Register 8        */
    __IM uint32_t RESERVED67;
    __IOM uint32_t DOEPINT8;                         /*!< (@ 0x00000C08) Device OUT Endpoint Interrupt Register 8              */
    __IM uint32_t RESERVED68;
    __IOM uint32_t DOEPTSIZ8;                        /*!< (@ 0x00000C10) Device OUT Endpoint Transfer Size Register 8          */
    __IOM uint32_t DOEPDMA8;                         /*!< (@ 0x00000C14) Device OUT Endpoint DMA Address Register 8            */
    __IM uint32_t RESERVED69;
    __IOM uint32_t DOEPDMAB8;                        /*!< (@ 0x00000C1C) Device OUT Endpoint Buffer Address Register 8         */
    __IOM uint32_t DOEPCTL9;                         /*!< (@ 0x00000C20) Device Control OUT Endpoint Control Register 9        */
    __IM uint32_t RESERVED70;
    __IOM uint32_t DOEPINT9;                         /*!< (@ 0x00000C28) Device OUT Endpoint Interrupt Register 9              */
    __IM uint32_t RESERVED71;
    __IOM uint32_t DOEPTSIZ9;                        /*!< (@ 0x00000C30) Device OUT Endpoint Transfer Size Register 9          */
    __IOM uint32_t DOEPDMA9;                         /*!< (@ 0x00000C34) Device OUT Endpoint DMA Address Register 9            */
    __IM uint32_t RESERVED72;
    __IOM uint32_t DOEPDMAB9;                        /*!< (@ 0x00000C3C) Device OUT Endpoint Buffer Address Register 9         */
    __IOM uint32_t DOEPCTL10;                        /*!< (@ 0x00000C40) Device Control OUT Endpoint Control Register 10       */
    __IM uint32_t RESERVED73;
    __IOM uint32_t DOEPINT10;                        /*!< (@ 0x00000C48) Device OUT Endpoint Interrupt Register 10             */
    __IM uint32_t RESERVED74;
    __IOM uint32_t DOEPTSIZ10;                       /*!< (@ 0x00000C50) Device OUT Endpoint Transfer Size Register 10         */
    __IOM uint32_t DOEPDMA10;                        /*!< (@ 0x00000C54) Device OUT Endpoint DMA Address Register 10           */
    __IM uint32_t RESERVED75;
    __IOM uint32_t DOEPDMAB10;                       /*!< (@ 0x00000C5C) Device OUT Endpoint Buffer Address Register 10        */
    __IOM uint32_t DOEPCTL11;                        /*!< (@ 0x00000C60) Device Control OUT Endpoint Control Register 11       */
    __IM uint32_t RESERVED76;
    __IOM uint32_t DOEPINT11;                        /*!< (@ 0x00000C68) Device OUT Endpoint Interrupt Register 11             */
    __IM uint32_t RESERVED77;
    __IOM uint32_t DOEPTSIZ11;                       /*!< (@ 0x00000C70) Device OUT Endpoint Transfer Size Register 11         */
    __IOM uint32_t DOEPDMA11;                        /*!< (@ 0x00000C74) Device OUT Endpoint DMA Address Register 11           */
    __IM uint32_t RESERVED78;
    __IOM uint32_t DOEPDMAB11;                       /*!< (@ 0x00000C7C) Device OUT Endpoint Buffer Address Register 11        */
    __IOM uint32_t DOEPCTL12;                        /*!< (@ 0x00000C80) Device Control OUT Endpoint Control Register 12       */
    __IM uint32_t RESERVED79;
    __IOM uint32_t DOEPINT12;                        /*!< (@ 0x00000C88) Device OUT Endpoint Interrupt Register 12             */
    __IM uint32_t RESERVED80;
    __IOM uint32_t DOEPTSIZ12;                       /*!< (@ 0x00000C90) Device OUT Endpoint Transfer Size Register 12         */
    __IOM uint32_t DOEPDMA12;                        /*!< (@ 0x00000C94) Device OUT Endpoint DMA Address Register 12           */
    __IM uint32_t RESERVED81;
    __IOM uint32_t DOEPDMAB12;                       /*!< (@ 0x00000C9C) Device OUT Endpoint Buffer Address Register 12        */
    __IOM uint32_t DOEPCTL13;                        /*!< (@ 0x00000CA0) Device Control OUT Endpoint Control Register 13       */
    __IM uint32_t RESERVED82;
    __IOM uint32_t DOEPINT13;                        /*!< (@ 0x00000CA8) Device OUT Endpoint Interrupt Register 13             */
    __IM uint32_t RESERVED83;
    __IOM uint32_t DOEPTSIZ13;                       /*!< (@ 0x00000CB0) Device OUT Endpoint Transfer Size Register 13         */
    __IOM uint32_t DOEPDMA13;                        /*!< (@ 0x00000CB4) Device OUT Endpoint DMA Address Register 13           */
    __IM uint32_t RESERVED84;
    __IOM uint32_t DOEPDMAB13;                       /*!< (@ 0x00000CBC) Device OUT Endpoint Buffer Address Register 13        */
    __IOM uint32_t DOEPCTL14;                        /*!< (@ 0x00000CC0) Device Control OUT Endpoint Control Register 14       */
    __IM uint32_t RESERVED85;
    __IOM uint32_t DOEPINT14;                        /*!< (@ 0x00000CC8) Device OUT Endpoint Interrupt Register 14             */
    __IM uint32_t RESERVED86;
    __IOM uint32_t DOEPTSIZ14;                       /*!< (@ 0x00000CD0) Device OUT Endpoint Transfer Size Register 14         */
    __IOM uint32_t DOEPDMA14;                        /*!< (@ 0x00000CD4) Device OUT Endpoint DMA Address Register 14           */
    __IM uint32_t RESERVED87;
    __IOM uint32_t DOEPDMAB14;                       /*!< (@ 0x00000CDC) Device OUT Endpoint Buffer Address Register 14        */
    __IOM uint32_t DOEPCTL15;                        /*!< (@ 0x00000CE0) Device Control OUT Endpoint Control Register 15       */
    __IM uint32_t RESERVED88;
    __IOM uint32_t DOEPINT15;                        /*!< (@ 0x00000CE8) Device OUT Endpoint Interrupt Register 15             */
    __IM uint32_t RESERVED89;
    __IOM uint32_t DOEPTSIZ15;                       /*!< (@ 0x00000CF0) Device OUT Endpoint Transfer Size Register 15         */
    __IOM uint32_t DOEPDMA15;                        /*!< (@ 0x00000CF4) Device OUT Endpoint DMA Address Register 15           */
    __IM uint32_t RESERVED90;
    __IOM uint32_t DOEPDMAB15;                       /*!< (@ 0x00000CFC) Device OUT Endpoint Buffer Address Register 15        */
    __IM uint32_t RESERVED91[64];
    __IOM uint32_t PCGCCTL;                          /*!< (@ 0x00000E00) Power and Clock Gating Control Register               */
    __IM uint32_t RESERVED92[63];
    __IOM uint32_t GSTARFXDIS;                       /*!< (@ 0x00000F00) Global STAR Fix Disable Register                      */
    __IM uint32_t RESERVED93[63];
    __IOM NRF_USBHSCORE_DWCOTGDFIFO_Type DWCOTGDFIFO[16]; /*!< (@ 0x00001000) (unspecified)                                    */
    __IOM NRF_USBHSCORE_DWCOTGDFIFODIRECTACCESS_Type DWCOTGDFIFODIRECTACCESS; /*!< (@ 0x00011000) (unspecified)                */
  } NRF_USBHSCORE_Type;                              /*!< Size = 200704 (0x31000)                                              */

