NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* CLOCKSWITCHTIMER @Bits 11..13 : This field is applicable if the controller is configured with multiple PHY interfaces. */
  #define USBHSCORE_GRSTCTL_CLOCKSWITCHTIMER_Pos (11UL) /*!< Position of CLOCKSWITCHTIMER field.                               */
  #define USBHSCORE_GRSTCTL_CLOCKSWITCHTIMER_Msk (0x7UL << USBHSCORE_GRSTCTL_CLOCKSWITCHTIMER_Pos) /*!< Bit mask of
                                                                            CLOCKSWITCHTIMER field.*/
  #define USBHSCORE_GRSTCTL_CLOCKSWITCHTIMER_Min (0x0UL) /*!< Min enumerator value of CLOCKSWITCHTIMER field.                  */
  #define USBHSCORE_GRSTCTL_CLOCKSWITCHTIMER_Max (0x7UL) /*!< Max enumerator value of CLOCKSWITCHTIMER field.                  */
  #define USBHSCORE_GRSTCTL_CLOCKSWITCHTIMER_TimerValue_19 (0x0UL) /*!< timer value set to 19                                  */
  #define USBHSCORE_GRSTCTL_CLOCKSWITCHTIMER_TimerValue_15 (0x1UL) /*!< timer value set to 15                                  */
  #define USBHSCORE_GRSTCTL_CLOCKSWITCHTIMER_TimerValue_147 (0x2UL) /*!< timer value set to 147                                */
  #define USBHSCORE_GRSTCTL_CLOCKSWITCHTIMER_TimerValue_50 (0x3UL) /*!< timer value set to 50                                  */
  #define USBHSCORE_GRSTCTL_CLOCKSWITCHTIMER_TimerValue_100 (0x4UL) /*!< timer value set to 100                                */
  #define USBHSCORE_GRSTCTL_CLOCKSWITCHTIMER_TimerValue_125 (0x5UL) /*!< timer value set to 125                                */
  #define USBHSCORE_GRSTCTL_CLOCKSWITCHTIMER_TimerValue_200 (0x6UL) /*!< timer value set to 200                                */
  #define USBHSCORE_GRSTCTL_CLOCKSWITCHTIMER_TimerDisabled (0x7UL) /*!< timer is disabled                                      */

/* CSFTRSTDONE @Bit 29 : Mode: Host and Device. Core Soft Reset Done (CSftRstDone) */
  #define USBHSCORE_GRSTCTL_CSFTRSTDONE_Pos (29UL)   /*!< Position of CSFTRSTDONE field.                                       */
  #define USBHSCORE_GRSTCTL_CSFTRSTDONE_Msk (0x1UL << USBHSCORE_GRSTCTL_CSFTRSTDONE_Pos) /*!< Bit mask of CSFTRSTDONE field.   */
  #define USBHSCORE_GRSTCTL_CSFTRSTDONE_Min (0x0UL)  /*!< Min enumerator value of CSFTRSTDONE field.                           */
  #define USBHSCORE_GRSTCTL_CSFTRSTDONE_Max (0x1UL)  /*!< Max enumerator value of CSFTRSTDONE field.                           */
  #define USBHSCORE_GRSTCTL_CSFTRSTDONE_INACTIVE (0x0UL) /*!< No reset                                                         */
  #define USBHSCORE_GRSTCTL_CSFTRSTDONE_ACTIVE (0x1UL) /*!< Core Soft Reset is done                                            */

/* DMAREQ @Bit 30 : Mode: Host and Device. DMA Request Signal (DMAReq) */
  #define USBHSCORE_GRSTCTL_DMAREQ_Pos (30UL)        /*!< Position of DMAREQ field.                                            */
  #define USBHSCORE_GRSTCTL_DMAREQ_Msk (0x1UL << USBHSCORE_GRSTCTL_DMAREQ_Pos) /*!< Bit mask of DMAREQ field.                  */
  #define USBHSCORE_GRSTCTL_DMAREQ_Min (0x0UL)       /*!< Min enumerator value of DMAREQ field.                                */
  #define USBHSCORE_GRSTCTL_DMAREQ_Max (0x1UL)       /*!< Max enumerator value of DMAREQ field.                                */
  #define USBHSCORE_GRSTCTL_DMAREQ_INACTIVE (0x0UL)  /*!< No DMA request                                                       */
  #define USBHSCORE_GRSTCTL_DMAREQ_ACTIVE (0x1UL)    /*!< DMA request is in progress                                           */

/* AHBIDLE @Bit 31 : Mode: Host and Device. AHB Requester Idle (AHBIdle) */
  #define USBHSCORE_GRSTCTL_AHBIDLE_Pos (31UL)       /*!< Position of AHBIDLE field.                                           */
  #define USBHSCORE_GRSTCTL_AHBIDLE_Msk (0x1UL << USBHSCORE_GRSTCTL_AHBIDLE_Pos) /*!< Bit mask of AHBIDLE field.               */
  #define USBHSCORE_GRSTCTL_AHBIDLE_Min (0x0UL)      /*!< Min enumerator value of AHBIDLE field.                               */
  #define USBHSCORE_GRSTCTL_AHBIDLE_Max (0x1UL)      /*!< Max enumerator value of AHBIDLE field.                               */
  #define USBHSCORE_GRSTCTL_AHBIDLE_INACTIVE (0x0UL) /*!< Not Idle                                                             */
  #define USBHSCORE_GRSTCTL_AHBIDLE_ACTIVE (0x1UL)   /*!< AHB Requester Idle                                                   */


/* USBHSCORE_GINTSTS: Interrupt STATUS Register */
  #define USBHSCORE_GINTSTS_ResetValue (0x04000020UL) /*!< Reset value of GINTSTS register.                                    */

/* CURMOD @Bit 0 : Mode: Host and Device. Current Mode of Operation (CurMod) */
  #define USBHSCORE_GINTSTS_CURMOD_Pos (0UL)         /*!< Position of CURMOD field.                                            */
  #define USBHSCORE_GINTSTS_CURMOD_Msk (0x1UL << USBHSCORE_GINTSTS_CURMOD_Pos) /*!< Bit mask of CURMOD field.                  */
  #define USBHSCORE_GINTSTS_CURMOD_Min (0x0UL)       /*!< Min enumerator value of CURMOD field.                                */
  #define USBHSCORE_GINTSTS_CURMOD_Max (0x1UL)       /*!< Max enumerator value of CURMOD field.                                */
  #define USBHSCORE_GINTSTS_CURMOD_DEVICE (0x0UL)    /*!< Device mode                                                          */
  #define USBHSCORE_GINTSTS_CURMOD_HOST (0x1UL)      /*!< Host mode                                                            */

/* MODEMIS @Bit 1 : Mode: Host and Device. Mode Mismatch Interrupt (ModeMis) */
  #define USBHSCORE_GINTSTS_MODEMIS_Pos (1UL)        /*!< Position of MODEMIS field.                                           */
  #define USBHSCORE_GINTSTS_MODEMIS_Msk (0x1UL << USBHSCORE_GINTSTS_MODEMIS_Pos) /*!< Bit mask of MODEMIS field.               */
  #define USBHSCORE_GINTSTS_MODEMIS_Min (0x0UL)      /*!< Min enumerator value of MODEMIS field.                               */
  #define USBHSCORE_GINTSTS_MODEMIS_Max (0x1UL)      /*!< Max enumerator value of MODEMIS field.                               */
  #define USBHSCORE_GINTSTS_MODEMIS_INACTIVE (0x0UL) /*!< No Mode Mismatch Interrupt                                           */
  #define USBHSCORE_GINTSTS_MODEMIS_ACTIVE (0x1UL)   /*!< Mode Mismatch Interrupt                                              */

/* OTGINT @Bit 2 : Mode: Host and Device. OTG Interrupt (OTGInt) */
  #define USBHSCORE_GINTSTS_OTGINT_Pos (2UL)         /*!< Position of OTGINT field.                                            */
  #define USBHSCORE_GINTSTS_OTGINT_Msk (0x1UL << USBHSCORE_GINTSTS_OTGINT_Pos) /*!< Bit mask of OTGINT field.                  */
  #define USBHSCORE_GINTSTS_OTGINT_Min (0x0UL)       /*!< Min enumerator value of OTGINT field.                                */
  #define USBHSCORE_GINTSTS_OTGINT_Max (0x1UL)       /*!< Max enumerator value of OTGINT field.                                */
  #define USBHSCORE_GINTSTS_OTGINT_INACTIVE (0x0UL)  /*!< No Interrupt                                                         */
  #define USBHSCORE_GINTSTS_OTGINT_ACTIVE (0x1UL)    /*!< OTG Interrupt                                                        */

