NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* USBHSCORE_GRXSTSR: Receive Status Debug Read Register */
  #define USBHSCORE_GRXSTSR_ResetValue (0x00000000UL) /*!< Reset value of GRXSTSR register.                                    */

/* CHNUM @Bits 0..3 : Channel Number (ChNum) */
  #define USBHSCORE_GRXSTSR_CHNUM_Pos (0UL)          /*!< Position of CHNUM field.                                             */
  #define USBHSCORE_GRXSTSR_CHNUM_Msk (0xFUL << USBHSCORE_GRXSTSR_CHNUM_Pos) /*!< Bit mask of CHNUM field.                     */
  #define USBHSCORE_GRXSTSR_CHNUM_Min (0x0UL)        /*!< Min enumerator value of CHNUM field.                                 */
  #define USBHSCORE_GRXSTSR_CHNUM_Max (0xFUL)        /*!< Max enumerator value of CHNUM field.                                 */
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP0 (0x0UL)      /*!< Channel or EndPoint 0                                                */
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP1 (0x1UL)      /*!< Channel or EndPoint 1                                                */
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP2 (0x2UL)      /*!< Channel or EndPoint 2                                                */
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP3 (0x3UL)      /*!< Channel or EndPoint 3                                                */
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP4 (0x4UL)      /*!< Channel or EndPoint 4                                                */
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP5 (0x5UL)      /*!< Channel or EndPoint 5                                                */
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP6 (0x6UL)      /*!< Channel or EndPoint 6                                                */
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP7 (0x7UL)      /*!< Channel or EndPoint 7                                                */
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP8 (0x8UL)      /*!< Channel or EndPoint 8                                                */
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP9 (0x9UL)      /*!< Channel or EndPoint 9                                                */
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP10 (0xAUL)     /*!< Channel or EndPoint 10                                               */
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP11 (0xBUL)     /*!< Channel or EndPoint 11                                               */
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP12 (0xCUL)     /*!< Channel or EndPoint 12                                               */
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP13 (0xDUL)     /*!< Channel or EndPoint 13                                               */
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP14 (0xEUL)     /*!< Channel or EndPoint 14                                               */
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP15 (0xFUL)     /*!< Channel or EndPoint 15                                               */

/* BCNT @Bits 4..14 : Byte Count (BCnt) */
  #define USBHSCORE_GRXSTSR_BCNT_Pos (4UL)           /*!< Position of BCNT field.                                              */
  #define USBHSCORE_GRXSTSR_BCNT_Msk (0x7FFUL << USBHSCORE_GRXSTSR_BCNT_Pos) /*!< Bit mask of BCNT field.                      */

/* DPID @Bits 15..16 : Data PID (DPID) */
  #define USBHSCORE_GRXSTSR_DPID_Pos (15UL)          /*!< Position of DPID field.                                              */
  #define USBHSCORE_GRXSTSR_DPID_Msk (0x3UL << USBHSCORE_GRXSTSR_DPID_Pos) /*!< Bit mask of DPID field.                        */
  #define USBHSCORE_GRXSTSR_DPID_Min (0x0UL)         /*!< Min enumerator value of DPID field.                                  */
  #define USBHSCORE_GRXSTSR_DPID_Max (0x3UL)         /*!< Max enumerator value of DPID field.                                  */
  #define USBHSCORE_GRXSTSR_DPID_DATA0 (0x0UL)       /*!< DATA0                                                                */
  #define USBHSCORE_GRXSTSR_DPID_DATA2 (0x1UL)       /*!< DATA2                                                                */
  #define USBHSCORE_GRXSTSR_DPID_DATA1 (0x2UL)       /*!< DATA1                                                                */
  #define USBHSCORE_GRXSTSR_DPID_MDATA (0x3UL)       /*!< MDATA                                                                */

/* PKTSTS @Bits 17..20 : Packet Status (PktSts) indicates the status of the received packet. */
  #define USBHSCORE_GRXSTSR_PKTSTS_Pos (17UL)        /*!< Position of PKTSTS field.                                            */
  #define USBHSCORE_GRXSTSR_PKTSTS_Msk (0xFUL << USBHSCORE_GRXSTSR_PKTSTS_Pos) /*!< Bit mask of PKTSTS field.                  */
  #define USBHSCORE_GRXSTSR_PKTSTS_Min (0x1UL)       /*!< Min enumerator value of PKTSTS field.                                */
  #define USBHSCORE_GRXSTSR_PKTSTS_Max (0x7UL)       /*!< Max enumerator value of PKTSTS field.                                */
  #define USBHSCORE_GRXSTSR_PKTSTS_OUTNAK (0x1UL)    /*!< Global OUT NAK in device mode (triggers an interrupt)                */
  #define USBHSCORE_GRXSTSR_PKTSTS_INOUTDPRX (0x2UL) /*!< IN data packet received in host mode and OUT data packet received in
                                                          device mode*/
  #define USBHSCORE_GRXSTSR_PKTSTS_INOUTTRCOM (0x3UL) /*!< IN or OUT transfer completed in both host and device mode (triggers
                                                           an interrupt)*/
  #define USBHSCORE_GRXSTSR_PKTSTS_DSETUPCOM (0x4UL) /*!< SETUP transaction completed in device mode (triggers an interrupt)   */
  #define USBHSCORE_GRXSTSR_PKTSTS_DTTOG (0x5UL)     /*!< Data toggle error (triggers an interrupt) in host mode               */
  #define USBHSCORE_GRXSTSR_PKTSTS_DSETUPRX (0x6UL)  /*!< SETUP data packet received in device mode                            */
  #define USBHSCORE_GRXSTSR_PKTSTS_CHHALT (0x7UL)    /*!< Channel halted in host mode (triggers an interrupt)                  */

/* FN @Bits 21..24 : Mode: Device only. Frame Number (FN) */
  #define USBHSCORE_GRXSTSR_FN_Pos (21UL)            /*!< Position of FN field.                                                */
  #define USBHSCORE_GRXSTSR_FN_Msk (0xFUL << USBHSCORE_GRXSTSR_FN_Pos) /*!< Bit mask of FN field.                              */


/* USBHSCORE_GRXSTSP: Receive Status Read/Pop Register */
  #define USBHSCORE_GRXSTSP_ResetValue (0x00000000UL) /*!< Reset value of GRXSTSP register.                                    */

/* CHNUM @Bits 0..3 : Channel Number (ChNum) */
  #define USBHSCORE_GRXSTSP_CHNUM_Pos (0UL)          /*!< Position of CHNUM field.                                             */
  #define USBHSCORE_GRXSTSP_CHNUM_Msk (0xFUL << USBHSCORE_GRXSTSP_CHNUM_Pos) /*!< Bit mask of CHNUM field.                     */
  #define USBHSCORE_GRXSTSP_CHNUM_Min (0x0UL)        /*!< Min enumerator value of CHNUM field.                                 */
  #define USBHSCORE_GRXSTSP_CHNUM_Max (0xFUL)        /*!< Max enumerator value of CHNUM field.                                 */
  #define USBHSCORE_GRXSTSP_CHNUM_CHEP0 (0x0UL)      /*!< Channel or EndPoint 0                                                */
  #define USBHSCORE_GRXSTSP_CHNUM_CHEP1 (0x1UL)      /*!< Channel or EndPoint 1                                                */
  #define USBHSCORE_GRXSTSP_CHNUM_CHEP2 (0x2UL)      /*!< Channel or EndPoint 2                                                */
  #define USBHSCORE_GRXSTSP_CHNUM_CHEP3 (0x3UL)      /*!< Channel or EndPoint 3                                                */
  #define USBHSCORE_GRXSTSP_CHNUM_CHEP4 (0x4UL)      /*!< Channel or EndPoint 4                                                */
  #define USBHSCORE_GRXSTSP_CHNUM_CHEP5 (0x5UL)      /*!< Channel or EndPoint 5                                                */
  #define USBHSCORE_GRXSTSP_CHNUM_CHEP6 (0x6UL)      /*!< Channel or EndPoint 6                                                */
  #define USBHSCORE_GRXSTSP_CHNUM_CHEP7 (0x7UL)      /*!< Channel or EndPoint 7                                                */
  #define USBHSCORE_GRXSTSP_CHNUM_CHEP8 (0x8UL)      /*!< Channel or EndPoint 8                                                */
  #define USBHSCORE_GRXSTSP_CHNUM_CHEP9 (0x9UL)      /*!< Channel or EndPoint 9                                                */
  #define USBHSCORE_GRXSTSP_CHNUM_CHEP10 (0xAUL)     /*!< Channel or EndPoint 10                                               */
  #define USBHSCORE_GRXSTSP_CHNUM_CHEP11 (0xBUL)     /*!< Channel or EndPoint 11                                               */
  #define USBHSCORE_GRXSTSP_CHNUM_CHEP12 (0xCUL)     /*!< Channel or EndPoint 12                                               */
  #define USBHSCORE_GRXSTSP_CHNUM_CHEP13 (0xDUL)     /*!< Channel or EndPoint 13                                               */
  #define USBHSCORE_GRXSTSP_CHNUM_CHEP14 (0xEUL)     /*!< Channel or EndPoint 14                                               */
  #define USBHSCORE_GRXSTSP_CHNUM_CHEP15 (0xFUL)     /*!< Channel or EndPoint 15                                               */

/* BCNT @Bits 4..14 : Byte Count (BCnt) */
  #define USBHSCORE_GRXSTSP_BCNT_Pos (4UL)           /*!< Position of BCNT field.                                              */
  #define USBHSCORE_GRXSTSP_BCNT_Msk (0x7FFUL << USBHSCORE_GRXSTSP_BCNT_Pos) /*!< Bit mask of BCNT field.                      */

/* DPID @Bits 15..16 : Data PID (DPID) */
  #define USBHSCORE_GRXSTSP_DPID_Pos (15UL)          /*!< Position of DPID field.                                              */
  #define USBHSCORE_GRXSTSP_DPID_Msk (0x3UL << USBHSCORE_GRXSTSP_DPID_Pos) /*!< Bit mask of DPID field.                        */
  #define USBHSCORE_GRXSTSP_DPID_Min (0x0UL)         /*!< Min enumerator value of DPID field.                                  */
  #define USBHSCORE_GRXSTSP_DPID_Max (0x3UL)         /*!< Max enumerator value of DPID field.                                  */
  #define USBHSCORE_GRXSTSP_DPID_DATA0 (0x0UL)       /*!< DATA0                                                                */
  #define USBHSCORE_GRXSTSP_DPID_DATA2 (0x1UL)       /*!< DATA2                                                                */
  #define USBHSCORE_GRXSTSP_DPID_DATA1 (0x2UL)       /*!< DATA1                                                                */
  #define USBHSCORE_GRXSTSP_DPID_MDATA (0x3UL)       /*!< MDATA                                                                */

