NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* DFIFODEPTH @Bits 16..31 : DFIFO Depth (DfifoDepth - EP_LOC_CNT) */
  #define USBHSCORE_GHWCFG3_DFIFODEPTH_Pos (16UL)    /*!< Position of DFIFODEPTH field.                                        */
  #define USBHSCORE_GHWCFG3_DFIFODEPTH_Msk (0xFFFFUL << USBHSCORE_GHWCFG3_DFIFODEPTH_Pos) /*!< Bit mask of DFIFODEPTH field.   */


/* USBHSCORE_GHWCFG4: User Hardware Configuration 4 Register */
  #define USBHSCORE_GHWCFG4_ResetValue (0xFE10AA60UL) /*!< Reset value of GHWCFG4 register.                                    */

/* NUMDEVPERIOEPS @Bits 0..3 : Number of Device Mode Periodic IN Endpoints (NumDevPerioEps) */
  #define USBHSCORE_GHWCFG4_NUMDEVPERIOEPS_Pos (0UL) /*!< Position of NUMDEVPERIOEPS field.                                    */
  #define USBHSCORE_GHWCFG4_NUMDEVPERIOEPS_Msk (0xFUL << USBHSCORE_GHWCFG4_NUMDEVPERIOEPS_Pos) /*!< Bit mask of NUMDEVPERIOEPS
                                                                            field.*/
  #define USBHSCORE_GHWCFG4_NUMDEVPERIOEPS_Min (0x0UL) /*!< Min enumerator value of NUMDEVPERIOEPS field.                      */
  #define USBHSCORE_GHWCFG4_NUMDEVPERIOEPS_Max (0xFUL) /*!< Max enumerator value of NUMDEVPERIOEPS field.                      */
  #define USBHSCORE_GHWCFG4_NUMDEVPERIOEPS_Value0 (0x0UL) /*!< Number of Periodic IN EPs is 0                                  */
  #define USBHSCORE_GHWCFG4_NUMDEVPERIOEPS_Value1 (0x1UL) /*!< Number of Periodic IN EPs is 1                                  */
  #define USBHSCORE_GHWCFG4_NUMDEVPERIOEPS_Value2 (0x2UL) /*!< Number of Periodic IN EPs is 2                                  */
  #define USBHSCORE_GHWCFG4_NUMDEVPERIOEPS_Value3 (0x3UL) /*!< Number of Periodic IN EPs is 3                                  */
  #define USBHSCORE_GHWCFG4_NUMDEVPERIOEPS_Value4 (0x4UL) /*!< Number of Periodic IN EPs is 4                                  */
  #define USBHSCORE_GHWCFG4_NUMDEVPERIOEPS_Value5 (0x5UL) /*!< Number of Periodic IN EPs is 5                                  */
  #define USBHSCORE_GHWCFG4_NUMDEVPERIOEPS_Value6 (0x6UL) /*!< Number of Periodic IN EPs is 6                                  */
  #define USBHSCORE_GHWCFG4_NUMDEVPERIOEPS_Value7 (0x7UL) /*!< Number of Periodic IN EPs is 7                                  */
  #define USBHSCORE_GHWCFG4_NUMDEVPERIOEPS_Value8 (0x8UL) /*!< Number of Periodic IN EPs is 8                                  */
  #define USBHSCORE_GHWCFG4_NUMDEVPERIOEPS_Value9 (0x9UL) /*!< Number of Periodic IN EPs is 9                                  */
  #define USBHSCORE_GHWCFG4_NUMDEVPERIOEPS_Value10 (0xAUL) /*!< Number of Periodic IN EPs is 10                                */
  #define USBHSCORE_GHWCFG4_NUMDEVPERIOEPS_Value11 (0xBUL) /*!< Number of Periodic IN EPs is 11                                */
  #define USBHSCORE_GHWCFG4_NUMDEVPERIOEPS_Value12 (0xCUL) /*!< Number of Periodic IN EPs is 12                                */
  #define USBHSCORE_GHWCFG4_NUMDEVPERIOEPS_Value13 (0xDUL) /*!< Number of Periodic IN EPs is 13                                */
  #define USBHSCORE_GHWCFG4_NUMDEVPERIOEPS_Value14 (0xEUL) /*!< Number of Periodic IN EPs is 14                                */
  #define USBHSCORE_GHWCFG4_NUMDEVPERIOEPS_Value15 (0xFUL) /*!< Number of Periodic IN EPs is 15                                */

/* PARTIALPWRDN @Bit 4 : Enable Partial Power Down (PartialPwrDn) */
  #define USBHSCORE_GHWCFG4_PARTIALPWRDN_Pos (4UL)   /*!< Position of PARTIALPWRDN field.                                      */
  #define USBHSCORE_GHWCFG4_PARTIALPWRDN_Msk (0x1UL << USBHSCORE_GHWCFG4_PARTIALPWRDN_Pos) /*!< Bit mask of PARTIALPWRDN field.*/
  #define USBHSCORE_GHWCFG4_PARTIALPWRDN_Min (0x0UL) /*!< Min enumerator value of PARTIALPWRDN field.                          */
  #define USBHSCORE_GHWCFG4_PARTIALPWRDN_Max (0x1UL) /*!< Max enumerator value of PARTIALPWRDN field.                          */
  #define USBHSCORE_GHWCFG4_PARTIALPWRDN_DISABLED (0x0UL) /*!< Partial Power Down disabled                                     */
  #define USBHSCORE_GHWCFG4_PARTIALPWRDN_ENABLED (0x1UL) /*!< Partial Power Down enabled                                       */

/* AHBFREQ @Bit 5 : Minimum AHB Frequency Less Than 60 MHz (AhbFreq) */
  #define USBHSCORE_GHWCFG4_AHBFREQ_Pos (5UL)        /*!< Position of AHBFREQ field.                                           */
  #define USBHSCORE_GHWCFG4_AHBFREQ_Msk (0x1UL << USBHSCORE_GHWCFG4_AHBFREQ_Pos) /*!< Bit mask of AHBFREQ field.               */
  #define USBHSCORE_GHWCFG4_AHBFREQ_Min (0x0UL)      /*!< Min enumerator value of AHBFREQ field.                               */
  #define USBHSCORE_GHWCFG4_AHBFREQ_Max (0x1UL)      /*!< Max enumerator value of AHBFREQ field.                               */
  #define USBHSCORE_GHWCFG4_AHBFREQ_DISABLED (0x0UL) /*!< Minimum AHB Frequency More Than 60 MHz                               */
  #define USBHSCORE_GHWCFG4_AHBFREQ_ENABLED (0x1UL)  /*!< Minimum AHB Frequency Less Than 60 MHz                               */

/* HIBERNATION @Bit 6 : Enable Hibernation (Hibernation) */
  #define USBHSCORE_GHWCFG4_HIBERNATION_Pos (6UL)    /*!< Position of HIBERNATION field.                                       */
  #define USBHSCORE_GHWCFG4_HIBERNATION_Msk (0x1UL << USBHSCORE_GHWCFG4_HIBERNATION_Pos) /*!< Bit mask of HIBERNATION field.   */
  #define USBHSCORE_GHWCFG4_HIBERNATION_Min (0x0UL)  /*!< Min enumerator value of HIBERNATION field.                           */
  #define USBHSCORE_GHWCFG4_HIBERNATION_Max (0x1UL)  /*!< Max enumerator value of HIBERNATION field.                           */
  #define USBHSCORE_GHWCFG4_HIBERNATION_DISABLED (0x0UL) /*!< Hibernation feature disabled                                     */
  #define USBHSCORE_GHWCFG4_HIBERNATION_ENABLED (0x1UL) /*!< Hibernation feature enabled                                       */

/* EXTENDEDHIBERNATION @Bit 7 : Enable Hibernation */
  #define USBHSCORE_GHWCFG4_EXTENDEDHIBERNATION_Pos (7UL) /*!< Position of EXTENDEDHIBERNATION field.                          */
  #define USBHSCORE_GHWCFG4_EXTENDEDHIBERNATION_Msk (0x1UL << USBHSCORE_GHWCFG4_EXTENDEDHIBERNATION_Pos) /*!< Bit mask of
                                                                            EXTENDEDHIBERNATION field.*/
  #define USBHSCORE_GHWCFG4_EXTENDEDHIBERNATION_Min (0x0UL) /*!< Min enumerator value of EXTENDEDHIBERNATION field.            */
  #define USBHSCORE_GHWCFG4_EXTENDEDHIBERNATION_Max (0x1UL) /*!< Max enumerator value of EXTENDEDHIBERNATION field.            */
  #define USBHSCORE_GHWCFG4_EXTENDEDHIBERNATION_DISABLED (0x0UL) /*!< Extended Hibernation feature not enabled                 */
  #define USBHSCORE_GHWCFG4_EXTENDEDHIBERNATION_ENABLED (0x1UL) /*!< Extended Hibernation feature enabled                      */

/* ENHANCEDLPMSUPT1 @Bit 9 : Enhanced LPM Support1 (EnhancedLPMSupt1) */
  #define USBHSCORE_GHWCFG4_ENHANCEDLPMSUPT1_Pos (9UL) /*!< Position of ENHANCEDLPMSUPT1 field.                                */
  #define USBHSCORE_GHWCFG4_ENHANCEDLPMSUPT1_Msk (0x1UL << USBHSCORE_GHWCFG4_ENHANCEDLPMSUPT1_Pos) /*!< Bit mask of
                                                                            ENHANCEDLPMSUPT1 field.*/
  #define USBHSCORE_GHWCFG4_ENHANCEDLPMSUPT1_Min (0x0UL) /*!< Min enumerator value of ENHANCEDLPMSUPT1 field.                  */
  #define USBHSCORE_GHWCFG4_ENHANCEDLPMSUPT1_Max (0x1UL) /*!< Max enumerator value of ENHANCEDLPMSUPT1 field.                  */
  #define USBHSCORE_GHWCFG4_ENHANCEDLPMSUPT1_DISABLED (0x0UL) /*!< Reject L1 Request even if Non-Periodic (Bulk/Interrupt)
                                                                   TxFIFO is not empty.*/
  #define USBHSCORE_GHWCFG4_ENHANCEDLPMSUPT1_ENABLED (0x1UL) /*!< Accept L1 Request even if Non-Periodic (Bulk/Interrupt) TxFIFO
                                                                  is not empty*/

/* SERVINTFLOW @Bit 10 : Service Interval Flow */
  #define USBHSCORE_GHWCFG4_SERVINTFLOW_Pos (10UL)   /*!< Position of SERVINTFLOW field.                                       */
  #define USBHSCORE_GHWCFG4_SERVINTFLOW_Msk (0x1UL << USBHSCORE_GHWCFG4_SERVINTFLOW_Pos) /*!< Bit mask of SERVINTFLOW field.   */
  #define USBHSCORE_GHWCFG4_SERVINTFLOW_Min (0x0UL)  /*!< Min enumerator value of SERVINTFLOW field.                           */
  #define USBHSCORE_GHWCFG4_SERVINTFLOW_Max (0x1UL)  /*!< Max enumerator value of SERVINTFLOW field.                           */
  #define USBHSCORE_GHWCFG4_SERVINTFLOW_DISABLED (0x0UL) /*!< Service Interval Flow not supported                              */
  #define USBHSCORE_GHWCFG4_SERVINTFLOW_ENABLED (0x1UL) /*!< Service Interval Flow supported                                   */

