NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* IPGISOCSUPT @Bit 11 : Interpacket Gap ISOC OUT Worst-case Support (ipgisocSupt) */
  #define USBHSCORE_GHWCFG4_IPGISOCSUPT_Pos (11UL)   /*!< Position of IPGISOCSUPT field.                                       */
  #define USBHSCORE_GHWCFG4_IPGISOCSUPT_Msk (0x1UL << USBHSCORE_GHWCFG4_IPGISOCSUPT_Pos) /*!< Bit mask of IPGISOCSUPT field.   */
  #define USBHSCORE_GHWCFG4_IPGISOCSUPT_Min (0x0UL)  /*!< Min enumerator value of IPGISOCSUPT field.                           */
  #define USBHSCORE_GHWCFG4_IPGISOCSUPT_Max (0x1UL)  /*!< Max enumerator value of IPGISOCSUPT field.                           */
  #define USBHSCORE_GHWCFG4_IPGISOCSUPT_DISABLED (0x0UL) /*!< Interpacket Gap ISOC OUT Worst-case Support is Disabled          */
  #define USBHSCORE_GHWCFG4_IPGISOCSUPT_ENABLED (0x1UL) /*!< Interpacket Gap ISOC OUT Worst-case Support is Enabled (Default)  */

/* ACGSUPT @Bit 12 : Active Clock Gating Support */
  #define USBHSCORE_GHWCFG4_ACGSUPT_Pos (12UL)       /*!< Position of ACGSUPT field.                                           */
  #define USBHSCORE_GHWCFG4_ACGSUPT_Msk (0x1UL << USBHSCORE_GHWCFG4_ACGSUPT_Pos) /*!< Bit mask of ACGSUPT field.               */
  #define USBHSCORE_GHWCFG4_ACGSUPT_Min (0x0UL)      /*!< Min enumerator value of ACGSUPT field.                               */
  #define USBHSCORE_GHWCFG4_ACGSUPT_Max (0x1UL)      /*!< Max enumerator value of ACGSUPT field.                               */
  #define USBHSCORE_GHWCFG4_ACGSUPT_DISABLED (0x0UL) /*!< (unspecified)                                                        */
  #define USBHSCORE_GHWCFG4_ACGSUPT_ENABLED (0x1UL)  /*!< Active Clock Gating Support                                          */

/* ENHANCEDLPMSUPT @Bit 13 : Enhanced LPM Support (EnhancedLPMSupt) */
  #define USBHSCORE_GHWCFG4_ENHANCEDLPMSUPT_Pos (13UL) /*!< Position of ENHANCEDLPMSUPT field.                                 */
  #define USBHSCORE_GHWCFG4_ENHANCEDLPMSUPT_Msk (0x1UL << USBHSCORE_GHWCFG4_ENHANCEDLPMSUPT_Pos) /*!< Bit mask of
                                                                            ENHANCEDLPMSUPT field.*/
  #define USBHSCORE_GHWCFG4_ENHANCEDLPMSUPT_Min (0x1UL) /*!< Min enumerator value of ENHANCEDLPMSUPT field.                    */
  #define USBHSCORE_GHWCFG4_ENHANCEDLPMSUPT_Max (0x1UL) /*!< Max enumerator value of ENHANCEDLPMSUPT field.                    */
  #define USBHSCORE_GHWCFG4_ENHANCEDLPMSUPT_ENABLED (0x1UL) /*!< Enhanced LPM Support is enabled                               */

/* PHYDATAWIDTH @Bits 14..15 : UTMI+ PHY/ULPI-to-Internal UTMI+ Wrapper Data Width */
  #define USBHSCORE_GHWCFG4_PHYDATAWIDTH_Pos (14UL)  /*!< Position of PHYDATAWIDTH field.                                      */
  #define USBHSCORE_GHWCFG4_PHYDATAWIDTH_Msk (0x3UL << USBHSCORE_GHWCFG4_PHYDATAWIDTH_Pos) /*!< Bit mask of PHYDATAWIDTH field.*/
  #define USBHSCORE_GHWCFG4_PHYDATAWIDTH_Min (0x0UL) /*!< Min enumerator value of PHYDATAWIDTH field.                          */
  #define USBHSCORE_GHWCFG4_PHYDATAWIDTH_Max (0x2UL) /*!< Max enumerator value of PHYDATAWIDTH field.                          */
  #define USBHSCORE_GHWCFG4_PHYDATAWIDTH_WIDTH1 (0x0UL) /*!< 8 bits                                                            */
  #define USBHSCORE_GHWCFG4_PHYDATAWIDTH_WIDTH2 (0x1UL) /*!< 16 bits                                                           */
  #define USBHSCORE_GHWCFG4_PHYDATAWIDTH_WIDTH3 (0x2UL) /*!< 8/16 bits, software selectable                                    */

/* NUMCTLEPS @Bits 16..19 : Number of Device Mode Control Endpoints in Addition to */
  #define USBHSCORE_GHWCFG4_NUMCTLEPS_Pos (16UL)     /*!< Position of NUMCTLEPS field.                                         */
  #define USBHSCORE_GHWCFG4_NUMCTLEPS_Msk (0xFUL << USBHSCORE_GHWCFG4_NUMCTLEPS_Pos) /*!< Bit mask of NUMCTLEPS field.         */
  #define USBHSCORE_GHWCFG4_NUMCTLEPS_Min (0x0UL)    /*!< Min enumerator value of NUMCTLEPS field.                             */
  #define USBHSCORE_GHWCFG4_NUMCTLEPS_Max (0xFUL)    /*!< Max enumerator value of NUMCTLEPS field.                             */
  #define USBHSCORE_GHWCFG4_NUMCTLEPS_ENDPT0 (0x0UL) /*!< End point 0                                                          */
  #define USBHSCORE_GHWCFG4_NUMCTLEPS_ENDPT1 (0x1UL) /*!< End point 1                                                          */
  #define USBHSCORE_GHWCFG4_NUMCTLEPS_ENDPT2 (0x2UL) /*!< End point 2                                                          */
  #define USBHSCORE_GHWCFG4_NUMCTLEPS_ENDPT3 (0x3UL) /*!< End point 3                                                          */
  #define USBHSCORE_GHWCFG4_NUMCTLEPS_ENDPT4 (0x4UL) /*!< End point 4                                                          */
  #define USBHSCORE_GHWCFG4_NUMCTLEPS_ENDPT5 (0x5UL) /*!< End point 5                                                          */
  #define USBHSCORE_GHWCFG4_NUMCTLEPS_ENDPT6 (0x6UL) /*!< End point 6                                                          */
  #define USBHSCORE_GHWCFG4_NUMCTLEPS_ENDPT7 (0x7UL) /*!< End point 7                                                          */
  #define USBHSCORE_GHWCFG4_NUMCTLEPS_ENDPT8 (0x8UL) /*!< End point 8                                                          */
  #define USBHSCORE_GHWCFG4_NUMCTLEPS_ENDPT9 (0x9UL) /*!< End point 9                                                          */
  #define USBHSCORE_GHWCFG4_NUMCTLEPS_ENDPT10 (0xAUL) /*!< End point 10                                                        */
  #define USBHSCORE_GHWCFG4_NUMCTLEPS_ENDPT11 (0xBUL) /*!< End point 11                                                        */
  #define USBHSCORE_GHWCFG4_NUMCTLEPS_ENDPT12 (0xCUL) /*!< End point 12                                                        */
  #define USBHSCORE_GHWCFG4_NUMCTLEPS_ENDPT13 (0xDUL) /*!< End point 13                                                        */
  #define USBHSCORE_GHWCFG4_NUMCTLEPS_ENDPT14 (0xEUL) /*!< End point 14                                                        */
  #define USBHSCORE_GHWCFG4_NUMCTLEPS_ENDPT15 (0xFUL) /*!< End point 15                                                        */

/* IDDGFLTR @Bit 20 : IDDIG Filter Enable (IddgFltr) */
  #define USBHSCORE_GHWCFG4_IDDGFLTR_Pos (20UL)      /*!< Position of IDDGFLTR field.                                          */
  #define USBHSCORE_GHWCFG4_IDDGFLTR_Msk (0x1UL << USBHSCORE_GHWCFG4_IDDGFLTR_Pos) /*!< Bit mask of IDDGFLTR field.            */
  #define USBHSCORE_GHWCFG4_IDDGFLTR_Min (0x0UL)     /*!< Min enumerator value of IDDGFLTR field.                              */
  #define USBHSCORE_GHWCFG4_IDDGFLTR_Max (0x1UL)     /*!< Max enumerator value of IDDGFLTR field.                              */
  #define USBHSCORE_GHWCFG4_IDDGFLTR_DISABLED (0x0UL) /*!< Iddig Filter Disabled                                               */
  #define USBHSCORE_GHWCFG4_IDDGFLTR_ENABLED (0x1UL) /*!< Iddig Filter Enabled                                                 */

/* VBUSVALIDFLTR @Bit 21 : VBUS Valid Filter Enabled (VBusValidFltr) */
  #define USBHSCORE_GHWCFG4_VBUSVALIDFLTR_Pos (21UL) /*!< Position of VBUSVALIDFLTR field.                                     */
  #define USBHSCORE_GHWCFG4_VBUSVALIDFLTR_Msk (0x1UL << USBHSCORE_GHWCFG4_VBUSVALIDFLTR_Pos) /*!< Bit mask of VBUSVALIDFLTR
                                                                            field.*/
  #define USBHSCORE_GHWCFG4_VBUSVALIDFLTR_Min (0x0UL) /*!< Min enumerator value of VBUSVALIDFLTR field.                        */
  #define USBHSCORE_GHWCFG4_VBUSVALIDFLTR_Max (0x1UL) /*!< Max enumerator value of VBUSVALIDFLTR field.                        */
  #define USBHSCORE_GHWCFG4_VBUSVALIDFLTR_DISABLED (0x0UL) /*!< Vbus Valid Filter Disabled                                     */
  #define USBHSCORE_GHWCFG4_VBUSVALIDFLTR_ENABLED (0x1UL) /*!< Vbus Valid Filter Enabled                                       */

