NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* OUTEPINT10 @Bit 26 : OUT Endpoint 10 Interrupt Bit */
  #define USBHSCORE_DAINT_OUTEPINT10_Pos (26UL)      /*!< Position of OUTEPINT10 field.                                        */
  #define USBHSCORE_DAINT_OUTEPINT10_Msk (0x1UL << USBHSCORE_DAINT_OUTEPINT10_Pos) /*!< Bit mask of OUTEPINT10 field.          */
  #define USBHSCORE_DAINT_OUTEPINT10_Min (0x0UL)     /*!< Min enumerator value of OUTEPINT10 field.                            */
  #define USBHSCORE_DAINT_OUTEPINT10_Max (0x1UL)     /*!< Max enumerator value of OUTEPINT10 field.                            */
  #define USBHSCORE_DAINT_OUTEPINT10_INACTIVE (0x0UL) /*!< No Interrupt                                                        */
  #define USBHSCORE_DAINT_OUTEPINT10_ACTIVE (0x1UL)  /*!< Interrupt is active for the OUT EP                                   */

/* OUTEPINT11 @Bit 27 : OUT Endpoint 11 Interrupt Bit */
  #define USBHSCORE_DAINT_OUTEPINT11_Pos (27UL)      /*!< Position of OUTEPINT11 field.                                        */
  #define USBHSCORE_DAINT_OUTEPINT11_Msk (0x1UL << USBHSCORE_DAINT_OUTEPINT11_Pos) /*!< Bit mask of OUTEPINT11 field.          */
  #define USBHSCORE_DAINT_OUTEPINT11_Min (0x0UL)     /*!< Min enumerator value of OUTEPINT11 field.                            */
  #define USBHSCORE_DAINT_OUTEPINT11_Max (0x1UL)     /*!< Max enumerator value of OUTEPINT11 field.                            */
  #define USBHSCORE_DAINT_OUTEPINT11_INACTIVE (0x0UL) /*!< No Interrupt                                                        */
  #define USBHSCORE_DAINT_OUTEPINT11_ACTIVE (0x1UL)  /*!< Interrupt is active for the OUT EP                                   */

/* OUTEPINT12 @Bit 28 : OUT Endpoint 12 Interrupt Bit */
  #define USBHSCORE_DAINT_OUTEPINT12_Pos (28UL)      /*!< Position of OUTEPINT12 field.                                        */
  #define USBHSCORE_DAINT_OUTEPINT12_Msk (0x1UL << USBHSCORE_DAINT_OUTEPINT12_Pos) /*!< Bit mask of OUTEPINT12 field.          */
  #define USBHSCORE_DAINT_OUTEPINT12_Min (0x0UL)     /*!< Min enumerator value of OUTEPINT12 field.                            */
  #define USBHSCORE_DAINT_OUTEPINT12_Max (0x1UL)     /*!< Max enumerator value of OUTEPINT12 field.                            */
  #define USBHSCORE_DAINT_OUTEPINT12_INACTIVE (0x0UL) /*!< No Interrupt                                                        */
  #define USBHSCORE_DAINT_OUTEPINT12_ACTIVE (0x1UL)  /*!< Interrupt is active for the OUT EP                                   */

/* OUTEPINT13 @Bit 29 : OUT Endpoint 13 Interrupt Bit */
  #define USBHSCORE_DAINT_OUTEPINT13_Pos (29UL)      /*!< Position of OUTEPINT13 field.                                        */
  #define USBHSCORE_DAINT_OUTEPINT13_Msk (0x1UL << USBHSCORE_DAINT_OUTEPINT13_Pos) /*!< Bit mask of OUTEPINT13 field.          */
  #define USBHSCORE_DAINT_OUTEPINT13_Min (0x0UL)     /*!< Min enumerator value of OUTEPINT13 field.                            */
  #define USBHSCORE_DAINT_OUTEPINT13_Max (0x1UL)     /*!< Max enumerator value of OUTEPINT13 field.                            */
  #define USBHSCORE_DAINT_OUTEPINT13_INACTIVE (0x0UL) /*!< No Interrupt                                                        */
  #define USBHSCORE_DAINT_OUTEPINT13_ACTIVE (0x1UL)  /*!< Interrupt is active for the OUT EP                                   */

/* OUTEPINT14 @Bit 30 : OUT Endpoint 14 Interrupt Bit */
  #define USBHSCORE_DAINT_OUTEPINT14_Pos (30UL)      /*!< Position of OUTEPINT14 field.                                        */
  #define USBHSCORE_DAINT_OUTEPINT14_Msk (0x1UL << USBHSCORE_DAINT_OUTEPINT14_Pos) /*!< Bit mask of OUTEPINT14 field.          */
  #define USBHSCORE_DAINT_OUTEPINT14_Min (0x0UL)     /*!< Min enumerator value of OUTEPINT14 field.                            */
  #define USBHSCORE_DAINT_OUTEPINT14_Max (0x1UL)     /*!< Max enumerator value of OUTEPINT14 field.                            */
  #define USBHSCORE_DAINT_OUTEPINT14_INACTIVE (0x0UL) /*!< No Interrupt                                                        */
  #define USBHSCORE_DAINT_OUTEPINT14_ACTIVE (0x1UL)  /*!< Interrupt is active for the OUT EP                                   */

/* OUTEPINT15 @Bit 31 : OUT Endpoint 15 Interrupt Bit */
  #define USBHSCORE_DAINT_OUTEPINT15_Pos (31UL)      /*!< Position of OUTEPINT15 field.                                        */
  #define USBHSCORE_DAINT_OUTEPINT15_Msk (0x1UL << USBHSCORE_DAINT_OUTEPINT15_Pos) /*!< Bit mask of OUTEPINT15 field.          */
  #define USBHSCORE_DAINT_OUTEPINT15_Min (0x0UL)     /*!< Min enumerator value of OUTEPINT15 field.                            */
  #define USBHSCORE_DAINT_OUTEPINT15_Max (0x1UL)     /*!< Max enumerator value of OUTEPINT15 field.                            */
  #define USBHSCORE_DAINT_OUTEPINT15_INACTIVE (0x0UL) /*!< No Interrupt                                                        */
  #define USBHSCORE_DAINT_OUTEPINT15_ACTIVE (0x1UL)  /*!< Interrupt is active for the OUT EP                                   */


/* USBHSCORE_DAINTMSK: Device All Endpoints Interrupt Mask Register */
  #define USBHSCORE_DAINTMSK_ResetValue (0x00000000UL) /*!< Reset value of DAINTMSK register.                                  */

/* INEPMSK0 @Bit 0 : IN Endpoint 0 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_INEPMSK0_Pos (0UL)      /*!< Position of INEPMSK0 field.                                          */
  #define USBHSCORE_DAINTMSK_INEPMSK0_Msk (0x1UL << USBHSCORE_DAINTMSK_INEPMSK0_Pos) /*!< Bit mask of INEPMSK0 field.          */
  #define USBHSCORE_DAINTMSK_INEPMSK0_Min (0x0UL)    /*!< Min enumerator value of INEPMSK0 field.                              */
  #define USBHSCORE_DAINTMSK_INEPMSK0_Max (0x1UL)    /*!< Max enumerator value of INEPMSK0 field.                              */
  #define USBHSCORE_DAINTMSK_INEPMSK0_MASK (0x0UL)   /*!< Mask IN Endpoint 0 Interrupt                                         */
  #define USBHSCORE_DAINTMSK_INEPMSK0_NOMASK (0x1UL) /*!< No Interrupt mask                                                    */

/* INEPMSK1 @Bit 1 : IN Endpoint 1 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_INEPMSK1_Pos (1UL)      /*!< Position of INEPMSK1 field.                                          */
  #define USBHSCORE_DAINTMSK_INEPMSK1_Msk (0x1UL << USBHSCORE_DAINTMSK_INEPMSK1_Pos) /*!< Bit mask of INEPMSK1 field.          */
  #define USBHSCORE_DAINTMSK_INEPMSK1_Min (0x0UL)    /*!< Min enumerator value of INEPMSK1 field.                              */
  #define USBHSCORE_DAINTMSK_INEPMSK1_Max (0x1UL)    /*!< Max enumerator value of INEPMSK1 field.                              */
  #define USBHSCORE_DAINTMSK_INEPMSK1_MASK (0x0UL)   /*!< Mask IN Endpoint Interrupt                                           */
  #define USBHSCORE_DAINTMSK_INEPMSK1_NOMASK (0x1UL) /*!< No Interrupt mask                                                    */

/* INEPMSK2 @Bit 2 : IN Endpoint 2 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_INEPMSK2_Pos (2UL)      /*!< Position of INEPMSK2 field.                                          */
  #define USBHSCORE_DAINTMSK_INEPMSK2_Msk (0x1UL << USBHSCORE_DAINTMSK_INEPMSK2_Pos) /*!< Bit mask of INEPMSK2 field.          */
  #define USBHSCORE_DAINTMSK_INEPMSK2_Min (0x0UL)    /*!< Min enumerator value of INEPMSK2 field.                              */
  #define USBHSCORE_DAINTMSK_INEPMSK2_Max (0x1UL)    /*!< Max enumerator value of INEPMSK2 field.                              */
  #define USBHSCORE_DAINTMSK_INEPMSK2_MASK (0x0UL)   /*!< Mask IN Endpoint Interrupt                                           */
  #define USBHSCORE_DAINTMSK_INEPMSK2_NOMASK (0x1UL) /*!< No Interrupt mask                                                    */

