NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* INEPNAKEFF @Bit 6 : IN Endpoint NAK Effective (INEPNakEff) */
  #define USBHSCORE_DIEPINT8_INEPNAKEFF_Pos (6UL)    /*!< Position of INEPNAKEFF field.                                        */
  #define USBHSCORE_DIEPINT8_INEPNAKEFF_Msk (0x1UL << USBHSCORE_DIEPINT8_INEPNAKEFF_Pos) /*!< Bit mask of INEPNAKEFF field.    */
  #define USBHSCORE_DIEPINT8_INEPNAKEFF_Min (0x0UL)  /*!< Min enumerator value of INEPNAKEFF field.                            */
  #define USBHSCORE_DIEPINT8_INEPNAKEFF_Max (0x1UL)  /*!< Max enumerator value of INEPNAKEFF field.                            */
  #define USBHSCORE_DIEPINT8_INEPNAKEFF_INACTIVE (0x0UL) /*!< No Endpoint NAK Effective interrupt                              */
  #define USBHSCORE_DIEPINT8_INEPNAKEFF_ACTIVE (0x1UL) /*!< IN Endpoint NAK Effective interrupt                                */

/* TXFEMP @Bit 7 : Transmit FIFO Empty (TxFEmp) */
  #define USBHSCORE_DIEPINT8_TXFEMP_Pos (7UL)        /*!< Position of TXFEMP field.                                            */
  #define USBHSCORE_DIEPINT8_TXFEMP_Msk (0x1UL << USBHSCORE_DIEPINT8_TXFEMP_Pos) /*!< Bit mask of TXFEMP field.                */
  #define USBHSCORE_DIEPINT8_TXFEMP_Min (0x0UL)      /*!< Min enumerator value of TXFEMP field.                                */
  #define USBHSCORE_DIEPINT8_TXFEMP_Max (0x1UL)      /*!< Max enumerator value of TXFEMP field.                                */
  #define USBHSCORE_DIEPINT8_TXFEMP_INACTIVE (0x0UL) /*!< No Transmit FIFO Empty interrupt                                     */
  #define USBHSCORE_DIEPINT8_TXFEMP_ACTIVE (0x1UL)   /*!< Transmit FIFO Empty interrupt                                        */

/* TXFIFOUNDRN @Bit 8 : Fifo Underrun (TxfifoUndrn) */
  #define USBHSCORE_DIEPINT8_TXFIFOUNDRN_Pos (8UL)   /*!< Position of TXFIFOUNDRN field.                                       */
  #define USBHSCORE_DIEPINT8_TXFIFOUNDRN_Msk (0x1UL << USBHSCORE_DIEPINT8_TXFIFOUNDRN_Pos) /*!< Bit mask of TXFIFOUNDRN field. */
  #define USBHSCORE_DIEPINT8_TXFIFOUNDRN_Min (0x0UL) /*!< Min enumerator value of TXFIFOUNDRN field.                           */
  #define USBHSCORE_DIEPINT8_TXFIFOUNDRN_Max (0x1UL) /*!< Max enumerator value of TXFIFOUNDRN field.                           */
  #define USBHSCORE_DIEPINT8_TXFIFOUNDRN_INACTIVE (0x0UL) /*!< No Tx FIFO Underrun interrupt                                   */
  #define USBHSCORE_DIEPINT8_TXFIFOUNDRN_ACTIVE (0x1UL) /*!< TxFIFO Underrun interrupt                                         */

/* BNAINTR @Bit 9 : BNA (Buffer Not Available) Interrupt (BNAIntr) */
  #define USBHSCORE_DIEPINT8_BNAINTR_Pos (9UL)       /*!< Position of BNAINTR field.                                           */
  #define USBHSCORE_DIEPINT8_BNAINTR_Msk (0x1UL << USBHSCORE_DIEPINT8_BNAINTR_Pos) /*!< Bit mask of BNAINTR field.             */
  #define USBHSCORE_DIEPINT8_BNAINTR_Min (0x0UL)     /*!< Min enumerator value of BNAINTR field.                               */
  #define USBHSCORE_DIEPINT8_BNAINTR_Max (0x1UL)     /*!< Max enumerator value of BNAINTR field.                               */
  #define USBHSCORE_DIEPINT8_BNAINTR_INACTIVE (0x0UL) /*!< No BNA interrupt                                                    */
  #define USBHSCORE_DIEPINT8_BNAINTR_ACTIVE (0x1UL)  /*!< BNA interrupt                                                        */

/* PKTDRPSTS @Bit 11 : Packet Drop Status (PktDrpSts) */
  #define USBHSCORE_DIEPINT8_PKTDRPSTS_Pos (11UL)    /*!< Position of PKTDRPSTS field.                                         */
  #define USBHSCORE_DIEPINT8_PKTDRPSTS_Msk (0x1UL << USBHSCORE_DIEPINT8_PKTDRPSTS_Pos) /*!< Bit mask of PKTDRPSTS field.       */
  #define USBHSCORE_DIEPINT8_PKTDRPSTS_Min (0x0UL)   /*!< Min enumerator value of PKTDRPSTS field.                             */
  #define USBHSCORE_DIEPINT8_PKTDRPSTS_Max (0x1UL)   /*!< Max enumerator value of PKTDRPSTS field.                             */
  #define USBHSCORE_DIEPINT8_PKTDRPSTS_INACTIVE (0x0UL) /*!< No interrupt                                                      */
  #define USBHSCORE_DIEPINT8_PKTDRPSTS_ACTIVE (0x1UL) /*!< Packet Drop Status interrupt                                        */

/* BBLEERR @Bit 12 : NAK Interrupt (BbleErr) */
  #define USBHSCORE_DIEPINT8_BBLEERR_Pos (12UL)      /*!< Position of BBLEERR field.                                           */
  #define USBHSCORE_DIEPINT8_BBLEERR_Msk (0x1UL << USBHSCORE_DIEPINT8_BBLEERR_Pos) /*!< Bit mask of BBLEERR field.             */
  #define USBHSCORE_DIEPINT8_BBLEERR_Min (0x0UL)     /*!< Min enumerator value of BBLEERR field.                               */
  #define USBHSCORE_DIEPINT8_BBLEERR_Max (0x1UL)     /*!< Max enumerator value of BBLEERR field.                               */
  #define USBHSCORE_DIEPINT8_BBLEERR_INACTIVE (0x0UL) /*!< No interrupt                                                        */
  #define USBHSCORE_DIEPINT8_BBLEERR_ACTIVE (0x1UL)  /*!< BbleErr interrupt                                                    */

/* NAKINTRPT @Bit 13 : NAK Interrupt (NAKInterrupt) */
  #define USBHSCORE_DIEPINT8_NAKINTRPT_Pos (13UL)    /*!< Position of NAKINTRPT field.                                         */
  #define USBHSCORE_DIEPINT8_NAKINTRPT_Msk (0x1UL << USBHSCORE_DIEPINT8_NAKINTRPT_Pos) /*!< Bit mask of NAKINTRPT field.       */
  #define USBHSCORE_DIEPINT8_NAKINTRPT_Min (0x0UL)   /*!< Min enumerator value of NAKINTRPT field.                             */
  #define USBHSCORE_DIEPINT8_NAKINTRPT_Max (0x1UL)   /*!< Max enumerator value of NAKINTRPT field.                             */
  #define USBHSCORE_DIEPINT8_NAKINTRPT_INACTIVE (0x0UL) /*!< No NAK interrupt                                                  */
  #define USBHSCORE_DIEPINT8_NAKINTRPT_ACTIVE (0x1UL) /*!< NAK Interrupt                                                       */

/* NYETINTRPT @Bit 14 : NYET Interrupt (NYETIntrpt) */
  #define USBHSCORE_DIEPINT8_NYETINTRPT_Pos (14UL)   /*!< Position of NYETINTRPT field.                                        */
  #define USBHSCORE_DIEPINT8_NYETINTRPT_Msk (0x1UL << USBHSCORE_DIEPINT8_NYETINTRPT_Pos) /*!< Bit mask of NYETINTRPT field.    */
  #define USBHSCORE_DIEPINT8_NYETINTRPT_Min (0x0UL)  /*!< Min enumerator value of NYETINTRPT field.                            */
  #define USBHSCORE_DIEPINT8_NYETINTRPT_Max (0x1UL)  /*!< Max enumerator value of NYETINTRPT field.                            */
  #define USBHSCORE_DIEPINT8_NYETINTRPT_INACTIVE (0x0UL) /*!< No NYET interrupt                                                */
  #define USBHSCORE_DIEPINT8_NYETINTRPT_ACTIVE (0x1UL) /*!< NYET Interrupt                                                     */


/* USBHSCORE_DIEPTSIZ8: Device IN Endpoint Transfer Size Register 8 */
  #define USBHSCORE_DIEPTSIZ8_ResetValue (0x00000000UL) /*!< Reset value of DIEPTSIZ8 register.                                */

/* XFERSIZE @Bits 0..18 : Transfer Size (XferSize) */
  #define USBHSCORE_DIEPTSIZ8_XFERSIZE_Pos (0UL)     /*!< Position of XFERSIZE field.                                          */
  #define USBHSCORE_DIEPTSIZ8_XFERSIZE_Msk (0x7FFFFUL << USBHSCORE_DIEPTSIZ8_XFERSIZE_Pos) /*!< Bit mask of XFERSIZE field.    */

/* PKTCNT @Bits 19..28 : Packet Count (PktCnt) */
  #define USBHSCORE_DIEPTSIZ8_PKTCNT_Pos (19UL)      /*!< Position of PKTCNT field.                                            */
  #define USBHSCORE_DIEPTSIZ8_PKTCNT_Msk (0x3FFUL << USBHSCORE_DIEPTSIZ8_PKTCNT_Pos) /*!< Bit mask of PKTCNT field.            */

/* MC @Bits 29..30 : MC */
  #define USBHSCORE_DIEPTSIZ8_MC_Pos (29UL)          /*!< Position of MC field.                                                */
  #define USBHSCORE_DIEPTSIZ8_MC_Msk (0x3UL << USBHSCORE_DIEPTSIZ8_MC_Pos) /*!< Bit mask of MC field.                          */
  #define USBHSCORE_DIEPTSIZ8_MC_Min (0x1UL)         /*!< Min enumerator value of MC field.                                    */
  #define USBHSCORE_DIEPTSIZ8_MC_Max (0x3UL)         /*!< Max enumerator value of MC field.                                    */
  #define USBHSCORE_DIEPTSIZ8_MC_PACKETONE (0x1UL)   /*!< 1 packet                                                             */
  #define USBHSCORE_DIEPTSIZ8_MC_PACKETTWO (0x2UL)   /*!< 2 packets                                                            */
  #define USBHSCORE_DIEPTSIZ8_MC_PACKETTHREE (0x3UL) /*!< 3 packets                                                            */


/* USBHSCORE_DIEPDMA8: Device IN Endpoint DMA Address Register 8 */
  #define USBHSCORE_DIEPDMA8_ResetValue (0x00000000UL) /*!< Reset value of DIEPDMA8 register.                                  */

/* DMAADDR @Bits 0..31 : Holds the start address of the external memory for storing or fetching endpoint */
  #define USBHSCORE_DIEPDMA8_DMAADDR_Pos (0UL)       /*!< Position of DMAADDR field.                                           */
  #define USBHSCORE_DIEPDMA8_DMAADDR_Msk (0xFFFFFFFFUL << USBHSCORE_DIEPDMA8_DMAADDR_Pos) /*!< Bit mask of DMAADDR field.      */


