NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* SETD0PID @Bit 28 : Set DATA0 PID (SetD0PID) */
  #define USBHSCORE_DIEPCTL14_SETD0PID_Pos (28UL)    /*!< Position of SETD0PID field.                                          */
  #define USBHSCORE_DIEPCTL14_SETD0PID_Msk (0x1UL << USBHSCORE_DIEPCTL14_SETD0PID_Pos) /*!< Bit mask of SETD0PID field.        */
  #define USBHSCORE_DIEPCTL14_SETD0PID_Min (0x0UL)   /*!< Min enumerator value of SETD0PID field.                              */
  #define USBHSCORE_DIEPCTL14_SETD0PID_Max (0x1UL)   /*!< Max enumerator value of SETD0PID field.                              */
  #define USBHSCORE_DIEPCTL14_SETD0PID_DISABLED (0x0UL) /*!< Disables Set DATA0 PID or Do not force Even (micro)Frame          */
  #define USBHSCORE_DIEPCTL14_SETD0PID_ENABLED (0x1UL) /*!< Set Endpoint Data PID to DATA0 or Sets EO_FrNum field to Even
                                                            (micro)Frame*/

/* SETD1PID @Bit 29 : Set DATA1 PID (SetD1PID) */
  #define USBHSCORE_DIEPCTL14_SETD1PID_Pos (29UL)    /*!< Position of SETD1PID field.                                          */
  #define USBHSCORE_DIEPCTL14_SETD1PID_Msk (0x1UL << USBHSCORE_DIEPCTL14_SETD1PID_Pos) /*!< Bit mask of SETD1PID field.        */
  #define USBHSCORE_DIEPCTL14_SETD1PID_Min (0x0UL)   /*!< Min enumerator value of SETD1PID field.                              */
  #define USBHSCORE_DIEPCTL14_SETD1PID_Max (0x1UL)   /*!< Max enumerator value of SETD1PID field.                              */
  #define USBHSCORE_DIEPCTL14_SETD1PID_DISABLED (0x0UL) /*!< Disables Set DATA1 PID or Do not force Odd (micro)Frame           */
  #define USBHSCORE_DIEPCTL14_SETD1PID_ENABLED (0x1UL) /*!< Set Endpoint Data PID to DATA1 or Sets EO_FrNum field to Odd
                                                            (micro)Frame*/

/* EPDIS @Bit 30 : Endpoint Disable (EPDis) */
  #define USBHSCORE_DIEPCTL14_EPDIS_Pos (30UL)       /*!< Position of EPDIS field.                                             */
  #define USBHSCORE_DIEPCTL14_EPDIS_Msk (0x1UL << USBHSCORE_DIEPCTL14_EPDIS_Pos) /*!< Bit mask of EPDIS field.                 */
  #define USBHSCORE_DIEPCTL14_EPDIS_Min (0x0UL)      /*!< Min enumerator value of EPDIS field.                                 */
  #define USBHSCORE_DIEPCTL14_EPDIS_Max (0x1UL)      /*!< Max enumerator value of EPDIS field.                                 */
  #define USBHSCORE_DIEPCTL14_EPDIS_INACTIVE (0x0UL) /*!< No Action                                                            */
  #define USBHSCORE_DIEPCTL14_EPDIS_ACTIVE (0x1UL)   /*!< Disable Endpoint                                                     */

/* EPENA @Bit 31 : Endpoint Enable (EPEna) */
  #define USBHSCORE_DIEPCTL14_EPENA_Pos (31UL)       /*!< Position of EPENA field.                                             */
  #define USBHSCORE_DIEPCTL14_EPENA_Msk (0x1UL << USBHSCORE_DIEPCTL14_EPENA_Pos) /*!< Bit mask of EPENA field.                 */
  #define USBHSCORE_DIEPCTL14_EPENA_Min (0x0UL)      /*!< Min enumerator value of EPENA field.                                 */
  #define USBHSCORE_DIEPCTL14_EPENA_Max (0x1UL)      /*!< Max enumerator value of EPENA field.                                 */
  #define USBHSCORE_DIEPCTL14_EPENA_INACTIVE (0x0UL) /*!< No Action                                                            */
  #define USBHSCORE_DIEPCTL14_EPENA_ACTIVE (0x1UL)   /*!< Enable Endpoint                                                      */


/* USBHSCORE_DIEPINT14: Device IN Endpoint Interrupt Register 14 */
  #define USBHSCORE_DIEPINT14_ResetValue (0x00000080UL) /*!< Reset value of DIEPINT14 register.                                */

/* XFERCOMPL @Bit 0 : Transfer Completed Interrupt (XferCompl) */
  #define USBHSCORE_DIEPINT14_XFERCOMPL_Pos (0UL)    /*!< Position of XFERCOMPL field.                                         */
  #define USBHSCORE_DIEPINT14_XFERCOMPL_Msk (0x1UL << USBHSCORE_DIEPINT14_XFERCOMPL_Pos) /*!< Bit mask of XFERCOMPL field.     */
  #define USBHSCORE_DIEPINT14_XFERCOMPL_Min (0x0UL)  /*!< Min enumerator value of XFERCOMPL field.                             */
  #define USBHSCORE_DIEPINT14_XFERCOMPL_Max (0x1UL)  /*!< Max enumerator value of XFERCOMPL field.                             */
  #define USBHSCORE_DIEPINT14_XFERCOMPL_INACTIVE (0x0UL) /*!< No Transfer Complete Interrupt                                   */
  #define USBHSCORE_DIEPINT14_XFERCOMPL_ACTIVE (0x1UL) /*!< Transfer Complete Interrupt                                        */

/* EPDISBLD @Bit 1 : Endpoint Disabled Interrupt (EPDisbld) */
  #define USBHSCORE_DIEPINT14_EPDISBLD_Pos (1UL)     /*!< Position of EPDISBLD field.                                          */
  #define USBHSCORE_DIEPINT14_EPDISBLD_Msk (0x1UL << USBHSCORE_DIEPINT14_EPDISBLD_Pos) /*!< Bit mask of EPDISBLD field.        */
  #define USBHSCORE_DIEPINT14_EPDISBLD_Min (0x0UL)   /*!< Min enumerator value of EPDISBLD field.                              */
  #define USBHSCORE_DIEPINT14_EPDISBLD_Max (0x1UL)   /*!< Max enumerator value of EPDISBLD field.                              */
  #define USBHSCORE_DIEPINT14_EPDISBLD_INACTIVE (0x0UL) /*!< No Endpoint Disabled Interrupt                                    */
  #define USBHSCORE_DIEPINT14_EPDISBLD_ACTIVE (0x1UL) /*!< Endpoint Disabled Interrupt                                         */

/* AHBERR @Bit 2 : AHB Error (AHBErr) */
  #define USBHSCORE_DIEPINT14_AHBERR_Pos (2UL)       /*!< Position of AHBERR field.                                            */
  #define USBHSCORE_DIEPINT14_AHBERR_Msk (0x1UL << USBHSCORE_DIEPINT14_AHBERR_Pos) /*!< Bit mask of AHBERR field.              */
  #define USBHSCORE_DIEPINT14_AHBERR_Min (0x0UL)     /*!< Min enumerator value of AHBERR field.                                */
  #define USBHSCORE_DIEPINT14_AHBERR_Max (0x1UL)     /*!< Max enumerator value of AHBERR field.                                */
  #define USBHSCORE_DIEPINT14_AHBERR_INACTIVE (0x0UL) /*!< No AHB Error Interrupt                                              */
  #define USBHSCORE_DIEPINT14_AHBERR_ACTIVE (0x1UL)  /*!< AHB Error interrupt                                                  */

/* TIMEOUT @Bit 3 : Timeout Condition (TimeOUT) */
  #define USBHSCORE_DIEPINT14_TIMEOUT_Pos (3UL)      /*!< Position of TIMEOUT field.                                           */
  #define USBHSCORE_DIEPINT14_TIMEOUT_Msk (0x1UL << USBHSCORE_DIEPINT14_TIMEOUT_Pos) /*!< Bit mask of TIMEOUT field.           */
  #define USBHSCORE_DIEPINT14_TIMEOUT_Min (0x0UL)    /*!< Min enumerator value of TIMEOUT field.                               */
  #define USBHSCORE_DIEPINT14_TIMEOUT_Max (0x1UL)    /*!< Max enumerator value of TIMEOUT field.                               */
  #define USBHSCORE_DIEPINT14_TIMEOUT_INACTIVE (0x0UL) /*!< No Timeout interrupt                                               */
  #define USBHSCORE_DIEPINT14_TIMEOUT_ACTIVE (0x1UL) /*!< Timeout interrupt                                                    */

/* INTKNTXFEMP @Bit 4 : IN Token Received When TxFIFO is Empty (INTknTXFEmp) */
  #define USBHSCORE_DIEPINT14_INTKNTXFEMP_Pos (4UL)  /*!< Position of INTKNTXFEMP field.                                       */
  #define USBHSCORE_DIEPINT14_INTKNTXFEMP_Msk (0x1UL << USBHSCORE_DIEPINT14_INTKNTXFEMP_Pos) /*!< Bit mask of INTKNTXFEMP
                                                                            field.*/
  #define USBHSCORE_DIEPINT14_INTKNTXFEMP_Min (0x0UL) /*!< Min enumerator value of INTKNTXFEMP field.                          */
  #define USBHSCORE_DIEPINT14_INTKNTXFEMP_Max (0x1UL) /*!< Max enumerator value of INTKNTXFEMP field.                          */
  #define USBHSCORE_DIEPINT14_INTKNTXFEMP_INACTIVE (0x0UL) /*!< No IN Token Received interrupt                                 */
  #define USBHSCORE_DIEPINT14_INTKNTXFEMP_ACTIVE (0x1UL) /*!< IN Token Received Interrupt                                      */

/* INTKNEPMIS @Bit 5 : IN Token Received with EP Mismatch (INTknEPMis) */
  #define USBHSCORE_DIEPINT14_INTKNEPMIS_Pos (5UL)   /*!< Position of INTKNEPMIS field.                                        */
  #define USBHSCORE_DIEPINT14_INTKNEPMIS_Msk (0x1UL << USBHSCORE_DIEPINT14_INTKNEPMIS_Pos) /*!< Bit mask of INTKNEPMIS field.  */
  #define USBHSCORE_DIEPINT14_INTKNEPMIS_Min (0x0UL) /*!< Min enumerator value of INTKNEPMIS field.                            */
  #define USBHSCORE_DIEPINT14_INTKNEPMIS_Max (0x1UL) /*!< Max enumerator value of INTKNEPMIS field.                            */
  #define USBHSCORE_DIEPINT14_INTKNEPMIS_INACTIVE (0x0UL) /*!< No IN Token Received with EP Mismatch interrupt                 */
  #define USBHSCORE_DIEPINT14_INTKNEPMIS_ACTIVE (0x1UL) /*!< IN Token Received with EP Mismatch interrupt                      */

