NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* BNAINTR @Bit 9 : BNA (Buffer Not Available) Interrupt (BNAIntr) */
  #define USBHSCORE_DOEPINT4_BNAINTR_Pos (9UL)       /*!< Position of BNAINTR field.                                           */
  #define USBHSCORE_DOEPINT4_BNAINTR_Msk (0x1UL << USBHSCORE_DOEPINT4_BNAINTR_Pos) /*!< Bit mask of BNAINTR field.             */
  #define USBHSCORE_DOEPINT4_BNAINTR_Min (0x0UL)     /*!< Min enumerator value of BNAINTR field.                               */
  #define USBHSCORE_DOEPINT4_BNAINTR_Max (0x1UL)     /*!< Max enumerator value of BNAINTR field.                               */
  #define USBHSCORE_DOEPINT4_BNAINTR_INACTIVE (0x0UL) /*!< No BNA interrupt                                                    */
  #define USBHSCORE_DOEPINT4_BNAINTR_ACTIVE (0x1UL)  /*!< BNA interrupt                                                        */

/* PKTDRPSTS @Bit 11 : Packet Drop Status (PktDrpSts) */
  #define USBHSCORE_DOEPINT4_PKTDRPSTS_Pos (11UL)    /*!< Position of PKTDRPSTS field.                                         */
  #define USBHSCORE_DOEPINT4_PKTDRPSTS_Msk (0x1UL << USBHSCORE_DOEPINT4_PKTDRPSTS_Pos) /*!< Bit mask of PKTDRPSTS field.       */
  #define USBHSCORE_DOEPINT4_PKTDRPSTS_Min (0x0UL)   /*!< Min enumerator value of PKTDRPSTS field.                             */
  #define USBHSCORE_DOEPINT4_PKTDRPSTS_Max (0x1UL)   /*!< Max enumerator value of PKTDRPSTS field.                             */
  #define USBHSCORE_DOEPINT4_PKTDRPSTS_INACTIVE (0x0UL) /*!< No interrupt                                                      */
  #define USBHSCORE_DOEPINT4_PKTDRPSTS_ACTIVE (0x1UL) /*!< Packet Drop Status interrupt                                        */

/* BBLEERR @Bit 12 : NAK Interrupt (BbleErr) */
  #define USBHSCORE_DOEPINT4_BBLEERR_Pos (12UL)      /*!< Position of BBLEERR field.                                           */
  #define USBHSCORE_DOEPINT4_BBLEERR_Msk (0x1UL << USBHSCORE_DOEPINT4_BBLEERR_Pos) /*!< Bit mask of BBLEERR field.             */
  #define USBHSCORE_DOEPINT4_BBLEERR_Min (0x0UL)     /*!< Min enumerator value of BBLEERR field.                               */
  #define USBHSCORE_DOEPINT4_BBLEERR_Max (0x1UL)     /*!< Max enumerator value of BBLEERR field.                               */
  #define USBHSCORE_DOEPINT4_BBLEERR_INACTIVE (0x0UL) /*!< No BbleErr interrupt                                                */
  #define USBHSCORE_DOEPINT4_BBLEERR_ACTIVE (0x1UL)  /*!< BbleErr interrupt                                                    */

/* NAKINTRPT @Bit 13 : NAK Interrupt (NAKInterrupt) */
  #define USBHSCORE_DOEPINT4_NAKINTRPT_Pos (13UL)    /*!< Position of NAKINTRPT field.                                         */
  #define USBHSCORE_DOEPINT4_NAKINTRPT_Msk (0x1UL << USBHSCORE_DOEPINT4_NAKINTRPT_Pos) /*!< Bit mask of NAKINTRPT field.       */
  #define USBHSCORE_DOEPINT4_NAKINTRPT_Min (0x0UL)   /*!< Min enumerator value of NAKINTRPT field.                             */
  #define USBHSCORE_DOEPINT4_NAKINTRPT_Max (0x1UL)   /*!< Max enumerator value of NAKINTRPT field.                             */
  #define USBHSCORE_DOEPINT4_NAKINTRPT_INACTIVE (0x0UL) /*!< No NAK interrupt                                                  */
  #define USBHSCORE_DOEPINT4_NAKINTRPT_ACTIVE (0x1UL) /*!< NAK Interrupt                                                       */

/* NYETINTRPT @Bit 14 : NYET Interrupt (NYETIntrpt) */
  #define USBHSCORE_DOEPINT4_NYETINTRPT_Pos (14UL)   /*!< Position of NYETINTRPT field.                                        */
  #define USBHSCORE_DOEPINT4_NYETINTRPT_Msk (0x1UL << USBHSCORE_DOEPINT4_NYETINTRPT_Pos) /*!< Bit mask of NYETINTRPT field.    */
  #define USBHSCORE_DOEPINT4_NYETINTRPT_Min (0x0UL)  /*!< Min enumerator value of NYETINTRPT field.                            */
  #define USBHSCORE_DOEPINT4_NYETINTRPT_Max (0x1UL)  /*!< Max enumerator value of NYETINTRPT field.                            */
  #define USBHSCORE_DOEPINT4_NYETINTRPT_INACTIVE (0x0UL) /*!< No NYET interrupt                                                */
  #define USBHSCORE_DOEPINT4_NYETINTRPT_ACTIVE (0x1UL) /*!< NYET Interrupt                                                     */

/* STUPPKTRCVD @Bit 15 : Setup Packet Received */
  #define USBHSCORE_DOEPINT4_STUPPKTRCVD_Pos (15UL)  /*!< Position of STUPPKTRCVD field.                                       */
  #define USBHSCORE_DOEPINT4_STUPPKTRCVD_Msk (0x1UL << USBHSCORE_DOEPINT4_STUPPKTRCVD_Pos) /*!< Bit mask of STUPPKTRCVD field. */
  #define USBHSCORE_DOEPINT4_STUPPKTRCVD_Min (0x0UL) /*!< Min enumerator value of STUPPKTRCVD field.                           */
  #define USBHSCORE_DOEPINT4_STUPPKTRCVD_Max (0x1UL) /*!< Max enumerator value of STUPPKTRCVD field.                           */
  #define USBHSCORE_DOEPINT4_STUPPKTRCVD_NOT_RCVD (0x0UL) /*!< No Setup packet received                                        */
  #define USBHSCORE_DOEPINT4_STUPPKTRCVD_RCVD (0x1UL) /*!< Setup packet received                                               */


/* USBHSCORE_DOEPTSIZ4: Device OUT Endpoint Transfer Size Register 4 */
  #define USBHSCORE_DOEPTSIZ4_ResetValue (0x00000000UL) /*!< Reset value of DOEPTSIZ4 register.                                */

/* XFERSIZE @Bits 0..18 : Transfer Size (XferSize) */
  #define USBHSCORE_DOEPTSIZ4_XFERSIZE_Pos (0UL)     /*!< Position of XFERSIZE field.                                          */
  #define USBHSCORE_DOEPTSIZ4_XFERSIZE_Msk (0x7FFFFUL << USBHSCORE_DOEPTSIZ4_XFERSIZE_Pos) /*!< Bit mask of XFERSIZE field.    */

/* PKTCNT @Bits 19..28 : Packet Count (PktCnt) */
  #define USBHSCORE_DOEPTSIZ4_PKTCNT_Pos (19UL)      /*!< Position of PKTCNT field.                                            */
  #define USBHSCORE_DOEPTSIZ4_PKTCNT_Msk (0x3FFUL << USBHSCORE_DOEPTSIZ4_PKTCNT_Pos) /*!< Bit mask of PKTCNT field.            */

/* RXDPID @Bits 29..30 : RxDPID */
  #define USBHSCORE_DOEPTSIZ4_RXDPID_Pos (29UL)      /*!< Position of RXDPID field.                                            */
  #define USBHSCORE_DOEPTSIZ4_RXDPID_Msk (0x3UL << USBHSCORE_DOEPTSIZ4_RXDPID_Pos) /*!< Bit mask of RXDPID field.              */
  #define USBHSCORE_DOEPTSIZ4_RXDPID_Min (0x0UL)     /*!< Min enumerator value of RXDPID field.                                */
  #define USBHSCORE_DOEPTSIZ4_RXDPID_Max (0x3UL)     /*!< Max enumerator value of RXDPID field.                                */
  #define USBHSCORE_DOEPTSIZ4_RXDPID_DATA0 (0x0UL)   /*!< DATA0                                                                */
  #define USBHSCORE_DOEPTSIZ4_RXDPID_DATA2PACKET1 (0x1UL) /*!< DATA2 or 1 packet                                               */
  #define USBHSCORE_DOEPTSIZ4_RXDPID_DATA1PACKET2 (0x2UL) /*!< DATA1 or 2 packets                                              */
  #define USBHSCORE_DOEPTSIZ4_RXDPID_MDATAPACKET3 (0x3UL) /*!< MDATA or 3 packets                                              */


/* USBHSCORE_DOEPDMA4: Device OUT Endpoint DMA Address Register 4 */
  #define USBHSCORE_DOEPDMA4_ResetValue (0x00000000UL) /*!< Reset value of DOEPDMA4 register.                                  */

/* DMAADDR @Bits 0..31 : Holds the start address of the external memory for storing or fetching endpoint */
  #define USBHSCORE_DOEPDMA4_DMAADDR_Pos (0UL)       /*!< Position of DMAADDR field.                                           */
  #define USBHSCORE_DOEPDMA4_DMAADDR_Msk (0xFFFFFFFFUL << USBHSCORE_DOEPDMA4_DMAADDR_Pos) /*!< Bit mask of DMAADDR field.      */


/* USBHSCORE_DOEPDMAB4: Device OUT Endpoint Buffer Address Register 4 */
  #define USBHSCORE_DOEPDMAB4_ResetValue (0x00000000UL) /*!< Reset value of DOEPDMAB4 register.                                */

/* DMABUFFERADDR @Bits 0..31 : Holds the current buffer address.This register is updated as and when the data */
  #define USBHSCORE_DOEPDMAB4_DMABUFFERADDR_Pos (0UL) /*!< Position of DMABUFFERADDR field.                                    */
  #define USBHSCORE_DOEPDMAB4_DMABUFFERADDR_Msk (0xFFFFFFFFUL << USBHSCORE_DOEPDMAB4_DMABUFFERADDR_Pos) /*!< Bit mask of
                                                                            DMABUFFERADDR field.*/


/* USBHSCORE_DOEPCTL5: Device Control OUT Endpoint Control Register 5 */
  #define USBHSCORE_DOEPCTL5_ResetValue (0x00000000UL) /*!< Reset value of DOEPCTL5 register.                                  */

