NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* EUSB2TERMINATERESUMEONDISCDIS @Bit 26 : Disable fix for Terminating Resume if UTMI HostDisconnect is detected. */
  #define USBHSCORE_GSTARFXDIS_EUSB2TERMINATERESUMEONDISCDIS_Pos (26UL) /*!< Position of EUSB2TERMINATERESUMEONDISCDIS field.  */
  #define USBHSCORE_GSTARFXDIS_EUSB2TERMINATERESUMEONDISCDIS_Msk (0x1UL << USBHSCORE_GSTARFXDIS_EUSB2TERMINATERESUMEONDISCDIS_Pos)
                                                                            /*!< Bit mask of EUSB2TERMINATERESUMEONDISCDIS
                                                                            field.*/
  #define USBHSCORE_GSTARFXDIS_EUSB2TERMINATERESUMEONDISCDIS_Min (0x0UL) /*!< Min enumerator value of
                                                                            EUSB2TERMINATERESUMEONDISCDIS field.*/
  #define USBHSCORE_GSTARFXDIS_EUSB2TERMINATERESUMEONDISCDIS_Max (0x1UL) /*!< Max enumerator value of
                                                                            EUSB2TERMINATERESUMEONDISCDIS field.*/
  #define USBHSCORE_GSTARFXDIS_EUSB2TERMINATERESUMEONDISCDIS_ENABLE_FIX (0x0UL) /*!< Host controller terminates Resume if
                                                                            HostDisconnect is asserted*/
  #define USBHSCORE_GSTARFXDIS_EUSB2TERMINATERESUMEONDISCDIS_DISABLE_FIX (0x1UL) /*!< Host controller does not terminate Resume
                                                                            if HostDisconnect is asserted*/

/* EUSB2FSLSDISCDETECTIONDIS @Bit 27 : Disable fix for FS/LS disconnect detection using UTMI HostDisconnect in MAC PRT. */
  #define USBHSCORE_GSTARFXDIS_EUSB2FSLSDISCDETECTIONDIS_Pos (27UL) /*!< Position of EUSB2FSLSDISCDETECTIONDIS field.          */
  #define USBHSCORE_GSTARFXDIS_EUSB2FSLSDISCDETECTIONDIS_Msk (0x1UL << USBHSCORE_GSTARFXDIS_EUSB2FSLSDISCDETECTIONDIS_Pos) /*!<
                                                                            Bit mask of EUSB2FSLSDISCDETECTIONDIS field.*/
  #define USBHSCORE_GSTARFXDIS_EUSB2FSLSDISCDETECTIONDIS_Min (0x0UL) /*!< Min enumerator value of EUSB2FSLSDISCDETECTIONDIS
                                                                          field.*/
  #define USBHSCORE_GSTARFXDIS_EUSB2FSLSDISCDETECTIONDIS_Max (0x1UL) /*!< Max enumerator value of EUSB2FSLSDISCDETECTIONDIS
                                                                          field.*/
  #define USBHSCORE_GSTARFXDIS_EUSB2FSLSDISCDETECTIONDIS_ENABLE_FIX (0x0UL) /*!< Host controller detects FS/LS disconnect using
                                                                            utmi_hostdisconnect signal*/
  #define USBHSCORE_GSTARFXDIS_EUSB2FSLSDISCDETECTIONDIS_DISABLE_FIX (0x1UL) /*!< Host controller detects disconnect by
                                                                            monitoring 2.5us of SE0 on DP/DM*/

/* HOSTFLUSHEXCESSTKNFIXDIS @Bit 29 : Disable fix for recovering the Host controller when sufficient time is not available in
                                      the current uF for an overscheduled ISOC OUT or INTR IN transfer. */

  #define USBHSCORE_GSTARFXDIS_HOSTFLUSHEXCESSTKNFIXDIS_Pos (29UL) /*!< Position of HOSTFLUSHEXCESSTKNFIXDIS field.            */
  #define USBHSCORE_GSTARFXDIS_HOSTFLUSHEXCESSTKNFIXDIS_Msk (0x1UL << USBHSCORE_GSTARFXDIS_HOSTFLUSHEXCESSTKNFIXDIS_Pos) /*!<
                                                                            Bit mask of HOSTFLUSHEXCESSTKNFIXDIS field.*/
  #define USBHSCORE_GSTARFXDIS_HOSTFLUSHEXCESSTKNFIXDIS_Min (0x0UL) /*!< Min enumerator value of HOSTFLUSHEXCESSTKNFIXDIS
                                                                         field.*/
  #define USBHSCORE_GSTARFXDIS_HOSTFLUSHEXCESSTKNFIXDIS_Max (0x1UL) /*!< Max enumerator value of HOSTFLUSHEXCESSTKNFIXDIS
                                                                         field.*/
  #define USBHSCORE_GSTARFXDIS_HOSTFLUSHEXCESSTKNFIXDIS_ENABLE_FIX (0x0UL) /*!< Host controller functionality is as expected if
                                                                            there is an overscheduled ISOC OUT or INTR IN
                                                                            transfer*/
  #define USBHSCORE_GSTARFXDIS_HOSTFLUSHEXCESSTKNFIXDIS_DISABLE_FIX (0x1UL) /*!< Host controller functionality cannot be
                                                                            determined if there is an overscheduled ISOC OUT or
                                                                            INTR IN transfer*/

/* TITRANSDONETGLDURINGISOCEOPFDISABLE @Bit 30 : Disable the fix added to not toggle ti_trans_done in SEND_EOP state when the
                                                 ISOC in tokens responds with zero length packets after end of periodic frame
                                                 till next start of frame. The fix is added when operating in descriptor dma
                                                 device mode. */

  #define USBHSCORE_GSTARFXDIS_TITRANSDONETGLDURINGISOCEOPFDISABLE_Pos (30UL) /*!< Position of
                                                                            TITRANSDONETGLDURINGISOCEOPFDISABLE field.*/
  #define USBHSCORE_GSTARFXDIS_TITRANSDONETGLDURINGISOCEOPFDISABLE_Msk (0x1UL << USBHSCORE_GSTARFXDIS_TITRANSDONETGLDURINGISOCEOPFDISABLE_Pos)
                                                                            /*!< Bit mask of TITRANSDONETGLDURINGISOCEOPFDISABLE
                                                                            field.*/
  #define USBHSCORE_GSTARFXDIS_TITRANSDONETGLDURINGISOCEOPFDISABLE_Min (0x0UL) /*!< Min enumerator value of
                                                                            TITRANSDONETGLDURINGISOCEOPFDISABLE field.*/
  #define USBHSCORE_GSTARFXDIS_TITRANSDONETGLDURINGISOCEOPFDISABLE_Max (0x1UL) /*!< Max enumerator value of
                                                                            TITRANSDONETGLDURINGISOCEOPFDISABLE field.*/
  #define USBHSCORE_GSTARFXDIS_TITRANSDONETGLDURINGISOCEOPFDISABLE_ENABLE_FIX (0x0UL) /*!< ti_transdone is not toggled after
                                                                            eopf during ISOC IN transfer till next SOF*/
  #define USBHSCORE_GSTARFXDIS_TITRANSDONETGLDURINGISOCEOPFDISABLE_DISABLE_FIX (0x1UL) /*!< ti_transdone is toggled after eopf
                                                                            during ISOC IN transfer till next SOF*/

/* CLEARSOFREFCLKTIMERDURINGDISC @Bit 31 : Disable the STAR fix added to clear the SOF refclk timer during disconnect detection.
                                           The STAR fix is added when using both UTMI and eUSB2 PHY. */

  #define USBHSCORE_GSTARFXDIS_CLEARSOFREFCLKTIMERDURINGDISC_Pos (31UL) /*!< Position of CLEARSOFREFCLKTIMERDURINGDISC field.  */
  #define USBHSCORE_GSTARFXDIS_CLEARSOFREFCLKTIMERDURINGDISC_Msk (0x1UL << USBHSCORE_GSTARFXDIS_CLEARSOFREFCLKTIMERDURINGDISC_Pos)
                                                                            /*!< Bit mask of CLEARSOFREFCLKTIMERDURINGDISC
                                                                            field.*/
  #define USBHSCORE_GSTARFXDIS_CLEARSOFREFCLKTIMERDURINGDISC_Min (0x0UL) /*!< Min enumerator value of
                                                                            CLEARSOFREFCLKTIMERDURINGDISC field.*/
  #define USBHSCORE_GSTARFXDIS_CLEARSOFREFCLKTIMERDURINGDISC_Max (0x1UL) /*!< Max enumerator value of
                                                                            CLEARSOFREFCLKTIMERDURINGDISC field.*/
  #define USBHSCORE_GSTARFXDIS_CLEARSOFREFCLKTIMERDURINGDISC_ENABLE_FIX (0x0UL) /*!< SOF refclk timer is cleared immediately
                                                                            after device disconnect is detected.*/
  #define USBHSCORE_GSTARFXDIS_CLEARSOFREFCLKTIMERDURINGDISC_DISABLE_FIX (0x1UL) /*!< SOF refclk timer is not cleared
                                                                            immediately after device disconnect is detected.*/


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                      VDMADESCRIPTOR                                      ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ================================================== Struct VDMADESCRIPTOR ================================================== */
/**
  * @brief Job descriptor for vector-based DMA.
  */
  typedef struct {                                   /*!< VDMADESCRIPTOR Structure                                             */
    __IOM uint32_t PTR;                              /*!< (@ 0x00000000) Pointer to data buffer.                               */
    __IOM uint32_t CONFIG;                           /*!< (@ 0x00000004) Job configuration. Configuration of attributes and
                                                                         buffer length.*/
  } NRF_VDMADESCRIPTOR_Type;                         /*!< Size = 8 (0x008)                                                     */

/* VDMADESCRIPTOR_PTR: Pointer to data buffer. */
  #define VDMADESCRIPTOR_PTR_ResetValue (0x00000000UL) /*!< Reset value of PTR register.                                       */

/* PTR @Bits 0..31 : Pointer to data buffer. */
  #define VDMADESCRIPTOR_PTR_PTR_Pos (0UL)           /*!< Position of PTR field.                                               */
  #define VDMADESCRIPTOR_PTR_PTR_Msk (0xFFFFFFFFUL << VDMADESCRIPTOR_PTR_PTR_Pos) /*!< Bit mask of PTR field.                  */


/* VDMADESCRIPTOR_CONFIG: Job configuration. Configuration of attributes and buffer length. */
  #define VDMADESCRIPTOR_CONFIG_ResetValue (0x00000000UL) /*!< Reset value of CONFIG register.                                 */

/* CNT @Bits 0..23 : Maximum number of bytes in data buffer. */
  #define VDMADESCRIPTOR_CONFIG_CNT_Pos (0UL)        /*!< Position of CNT field.                                               */
  #define VDMADESCRIPTOR_CONFIG_CNT_Msk (0xFFFFFFUL << VDMADESCRIPTOR_CONFIG_CNT_Pos) /*!< Bit mask of CNT field.              */

/* ATTRIBUTE @Bits 24..29 : Job attribute. */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_Pos (24UL) /*!< Position of ATTRIBUTE field.                                         */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_Msk (0x3FUL << VDMADESCRIPTOR_CONFIG_ATTRIBUTE_Pos) /*!< Bit mask of ATTRIBUTE field.*/
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_Min (0x00UL) /*!< Min enumerator value of ATTRIBUTE field.                           */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_Max (0x0EUL) /*!< Max enumerator value of ATTRIBUTE field.                           */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_ByteSwap (0x00UL) /*!< Byte swap attribute.                                          */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_JobList (0x01UL) /*!< Job list attribute.                                            */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_BufferFill (0x02UL) /*!< Buffer fill attribute.                                      */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_FixedSize (0x03UL) /*!< Fixed size attribute.                                        */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_StaticAddress (0x04UL) /*!< Static address attribute.                                */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_PlainDataBufferWrite (0x05UL) /*!< Plain data buffer write attribute.                */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_Crc (0x06UL) /*!< CRC attribute.                                                     */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_AarHash (0x0BUL) /*!< Hash attribute                                                 */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_AarPrand (0x0CUL) /*!< Prand attribute                                               */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_AarIrk (0x0DUL) /*!< Irk attribute                                                   */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_CcmAlen (0x0BUL) /*!< Alen attribute                                                 */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_CcmMlen (0x0CUL) /*!< Mlen attribute                                                 */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_CcmAdata (0x0DUL) /*!< Adata attribute                                               */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_CcmMdata (0x0EUL) /*!< Mdata attribute                                               */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_EcbData (0x0BUL) /*!< EcbData attribute                                              */

