NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* X @Bit 23 : Non-standard extensions present */
  #define VPRCSR_MISA_X_Pos (23UL)                   /*!< Position of X field.                                                 */
  #define VPRCSR_MISA_X_Msk (0x1UL << VPRCSR_MISA_X_Pos) /*!< Bit mask of X field.                                             */
  #define VPRCSR_MISA_X_Min (0x0UL)                  /*!< Min enumerator value of X field.                                     */
  #define VPRCSR_MISA_X_Max (0x1UL)                  /*!< Max enumerator value of X field.                                     */
  #define VPRCSR_MISA_X_NotPresent (0x0UL)           /*!< (unspecified)                                                        */
  #define VPRCSR_MISA_X_Present (0x1UL)              /*!< (unspecified)                                                        */

/* MXL @Bits 30..31 : Machine XLEN */
  #define VPRCSR_MISA_MXL_Pos (30UL)                 /*!< Position of MXL field.                                               */
  #define VPRCSR_MISA_MXL_Msk (0x3UL << VPRCSR_MISA_MXL_Pos) /*!< Bit mask of MXL field.                                       */
  #define VPRCSR_MISA_MXL_Min (0x1UL)                /*!< Min enumerator value of MXL field.                                   */
  #define VPRCSR_MISA_MXL_Max (0x3UL)                /*!< Max enumerator value of MXL field.                                   */
  #define VPRCSR_MISA_MXL_XLEN32 (0x1UL)             /*!< XLEN is 32 bits                                                      */
  #define VPRCSR_MISA_MXL_XLEN64 (0x2UL)             /*!< XLEN is 64 bits                                                      */
  #define VPRCSR_MISA_MXL_XLEN128 (0x3UL)            /*!< XLEN is 128 bits                                                     */


/**
  * @brief MTVEC [VPRCSR_MTVEC] Machine Trap-Vector
  */
  #define VPRCSR_MTVEC (0x00000305ul)
  #define VPRCSR_MTVEC_ResetValue (0x00000003UL)     /*!< Reset value of MTVEC register.                                       */

/* MODE @Bits 0..1 : Mode */
  #define VPRCSR_MTVEC_MODE_Pos (0UL)                /*!< Position of MODE field.                                              */
  #define VPRCSR_MTVEC_MODE_Msk (0x3UL << VPRCSR_MTVEC_MODE_Pos) /*!< Bit mask of MODE field.                                  */
  #define VPRCSR_MTVEC_MODE_Min (0x3UL)              /*!< Min enumerator value of MODE field.                                  */
  #define VPRCSR_MTVEC_MODE_Max (0x3UL)              /*!< Max enumerator value of MODE field.                                  */
  #define VPRCSR_MTVEC_MODE_CLIC (0x3UL)             /*!< Core Local Interrupt Controller (CLIC) interrupt handling mode       */

/* BASE @Bits 2..31 : Vector base address */
  #define VPRCSR_MTVEC_BASE_Pos (2UL)                /*!< Position of BASE field.                                              */
  #define VPRCSR_MTVEC_BASE_Msk (0x3FFFFFFFUL << VPRCSR_MTVEC_BASE_Pos) /*!< Bit mask of BASE field.                           */


/**
  * @brief MTVT [VPRCSR_MTVT] Machine Trap Vector Table
  */
  #define VPRCSR_MTVT (0x00000307ul)
  #define VPRCSR_MTVT_ResetValue (0x00000000UL)      /*!< Reset value of MTVT register.                                        */

/* VAL @Bits 6..31 : Machine Trap Vector Table base address value for CLIC vectored interrupts */
  #define VPRCSR_MTVT_VAL_Pos (6UL)                  /*!< Position of VAL field.                                               */
  #define VPRCSR_MTVT_VAL_Msk (0x3FFFFFFUL << VPRCSR_MTVT_VAL_Pos) /*!< Bit mask of VAL field.                                 */


/**
  * @brief MCOUNTINHIBIT [VPRCSR_MCOUNTINHIBIT] Machine Counter-Inhibit
  */
  #define VPRCSR_MCOUNTINHIBIT (0x00000320ul)
  #define VPRCSR_MCOUNTINHIBIT_ResetValue (0x00000005UL) /*!< Reset value of MCOUNTINHIBIT register.                           */

/* CY @Bit 0 : (unspecified) */
  #define VPRCSR_MCOUNTINHIBIT_CY_Pos (0UL)          /*!< Position of CY field.                                                */
  #define VPRCSR_MCOUNTINHIBIT_CY_Msk (0x1UL << VPRCSR_MCOUNTINHIBIT_CY_Pos) /*!< Bit mask of CY field.                        */
  #define VPRCSR_MCOUNTINHIBIT_CY_Min (0x0UL)        /*!< Min enumerator value of CY field.                                    */
  #define VPRCSR_MCOUNTINHIBIT_CY_Max (0x1UL)        /*!< Max enumerator value of CY field.                                    */
  #define VPRCSR_MCOUNTINHIBIT_CY_INCREMENT (0x0UL)  /*!< MCYCLE increments as usual                                           */
  #define VPRCSR_MCOUNTINHIBIT_CY_INHIBIT (0x1UL)    /*!< MCYCLE doesn't increment                                             */

/* IR @Bit 2 : (unspecified) */
  #define VPRCSR_MCOUNTINHIBIT_IR_Pos (2UL)          /*!< Position of IR field.                                                */
  #define VPRCSR_MCOUNTINHIBIT_IR_Msk (0x1UL << VPRCSR_MCOUNTINHIBIT_IR_Pos) /*!< Bit mask of IR field.                        */
  #define VPRCSR_MCOUNTINHIBIT_IR_Min (0x0UL)        /*!< Min enumerator value of IR field.                                    */
  #define VPRCSR_MCOUNTINHIBIT_IR_Max (0x1UL)        /*!< Max enumerator value of IR field.                                    */
  #define VPRCSR_MCOUNTINHIBIT_IR_INCREMENT (0x0UL)  /*!< MINSTRET increments as usual                                         */
  #define VPRCSR_MCOUNTINHIBIT_IR_INHIBIT (0x1UL)    /*!< MINSTRET doesn't increment                                           */


/**
  * @brief MSCRATCH [VPRCSR_MSCRATCH] Machine Scratch
  */
  #define VPRCSR_MSCRATCH (0x00000340ul)
  #define VPRCSR_MSCRATCH_ResetValue (0x00000000UL)  /*!< Reset value of MSCRATCH register.                                    */

/* VAL @Bits 0..31 : Machine Scratch value */
  #define VPRCSR_MSCRATCH_VAL_Pos (0UL)              /*!< Position of VAL field.                                               */
  #define VPRCSR_MSCRATCH_VAL_Msk (0xFFFFFFFFUL << VPRCSR_MSCRATCH_VAL_Pos) /*!< Bit mask of VAL field.                        */


/**
  * @brief MEPC [VPRCSR_MEPC] Machine Exception Program Counter
  */
  #define VPRCSR_MEPC (0x00000341ul)
  #define VPRCSR_MEPC_ResetValue (0x00000000UL)      /*!< Reset value of MEPC register.                                        */

