NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* SUBSCRIBE3 @Bit 3 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE3_Pos (3UL) /*!< Position of SUBSCRIBE3 field.                                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE3_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE3_Pos) /*!< Bit mask of SUBSCRIBE3
                                                                            field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE3_Min (0x0UL) /*!< Min enumerator value of SUBSCRIBE3 field.                        */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE3_Max (0x1UL) /*!< Max enumerator value of SUBSCRIBE3 field.                        */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE3_Disabled (0x0UL) /*!< Subscribe disabled for TASK[3]                              */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE3_Enabled (0x1UL) /*!< Subscribe enabled for TASK[3]                                */

/* SUBSCRIBE4 @Bit 4 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE4_Pos (4UL) /*!< Position of SUBSCRIBE4 field.                                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE4_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE4_Pos) /*!< Bit mask of SUBSCRIBE4
                                                                            field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE4_Min (0x0UL) /*!< Min enumerator value of SUBSCRIBE4 field.                        */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE4_Max (0x1UL) /*!< Max enumerator value of SUBSCRIBE4 field.                        */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE4_Disabled (0x0UL) /*!< Subscribe disabled for TASK[4]                              */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE4_Enabled (0x1UL) /*!< Subscribe enabled for TASK[4]                                */

/* SUBSCRIBE5 @Bit 5 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE5_Pos (5UL) /*!< Position of SUBSCRIBE5 field.                                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE5_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE5_Pos) /*!< Bit mask of SUBSCRIBE5
                                                                            field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE5_Min (0x0UL) /*!< Min enumerator value of SUBSCRIBE5 field.                        */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE5_Max (0x1UL) /*!< Max enumerator value of SUBSCRIBE5 field.                        */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE5_Disabled (0x0UL) /*!< Subscribe disabled for TASK[5]                              */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE5_Enabled (0x1UL) /*!< Subscribe enabled for TASK[5]                                */

/* SUBSCRIBE6 @Bit 6 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE6_Pos (6UL) /*!< Position of SUBSCRIBE6 field.                                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE6_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE6_Pos) /*!< Bit mask of SUBSCRIBE6
                                                                            field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE6_Min (0x0UL) /*!< Min enumerator value of SUBSCRIBE6 field.                        */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE6_Max (0x1UL) /*!< Max enumerator value of SUBSCRIBE6 field.                        */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE6_Disabled (0x0UL) /*!< Subscribe disabled for TASK[6]                              */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE6_Enabled (0x1UL) /*!< Subscribe enabled for TASK[6]                                */

/* SUBSCRIBE7 @Bit 7 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE7_Pos (7UL) /*!< Position of SUBSCRIBE7 field.                                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE7_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE7_Pos) /*!< Bit mask of SUBSCRIBE7
                                                                            field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE7_Min (0x0UL) /*!< Min enumerator value of SUBSCRIBE7 field.                        */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE7_Max (0x1UL) /*!< Max enumerator value of SUBSCRIBE7 field.                        */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE7_Disabled (0x0UL) /*!< Subscribe disabled for TASK[7]                              */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE7_Enabled (0x1UL) /*!< Subscribe enabled for TASK[7]                                */

/* SUBSCRIBE8 @Bit 8 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE8_Pos (8UL) /*!< Position of SUBSCRIBE8 field.                                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE8_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE8_Pos) /*!< Bit mask of SUBSCRIBE8
                                                                            field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE8_Min (0x0UL) /*!< Min enumerator value of SUBSCRIBE8 field.                        */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE8_Max (0x1UL) /*!< Max enumerator value of SUBSCRIBE8 field.                        */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE8_Disabled (0x0UL) /*!< Subscribe disabled for TASK[8]                              */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE8_Enabled (0x1UL) /*!< Subscribe enabled for TASK[8]                                */

/* SUBSCRIBE9 @Bit 9 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE9_Pos (9UL) /*!< Position of SUBSCRIBE9 field.                                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE9_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE9_Pos) /*!< Bit mask of SUBSCRIBE9
                                                                            field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE9_Min (0x0UL) /*!< Min enumerator value of SUBSCRIBE9 field.                        */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE9_Max (0x1UL) /*!< Max enumerator value of SUBSCRIBE9 field.                        */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE9_Disabled (0x0UL) /*!< Subscribe disabled for TASK[9]                              */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE9_Enabled (0x1UL) /*!< Subscribe enabled for TASK[9]                                */

