NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* PIN17 @Bit 17 : (unspecified) */
  #define VPRCSR_NORDIC_OUTBTGL_PIN17_Pos (17UL)     /*!< Position of PIN17 field.                                             */
  #define VPRCSR_NORDIC_OUTBTGL_PIN17_Msk (0x1UL << VPRCSR_NORDIC_OUTBTGL_PIN17_Pos) /*!< Bit mask of PIN17 field.             */
  #define VPRCSR_NORDIC_OUTBTGL_PIN17_Min (0x0UL)    /*!< Min enumerator value of PIN17 field.                                 */
  #define VPRCSR_NORDIC_OUTBTGL_PIN17_Max (0x1UL)    /*!< Max enumerator value of PIN17 field.                                 */
  #define VPRCSR_NORDIC_OUTBTGL_PIN17_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                             */
  #define VPRCSR_NORDIC_OUTBTGL_PIN17_TOGGLE (0x1UL) /*!< Pin is toggled                                                       */

/* PIN18 @Bit 18 : (unspecified) */
  #define VPRCSR_NORDIC_OUTBTGL_PIN18_Pos (18UL)     /*!< Position of PIN18 field.                                             */
  #define VPRCSR_NORDIC_OUTBTGL_PIN18_Msk (0x1UL << VPRCSR_NORDIC_OUTBTGL_PIN18_Pos) /*!< Bit mask of PIN18 field.             */
  #define VPRCSR_NORDIC_OUTBTGL_PIN18_Min (0x0UL)    /*!< Min enumerator value of PIN18 field.                                 */
  #define VPRCSR_NORDIC_OUTBTGL_PIN18_Max (0x1UL)    /*!< Max enumerator value of PIN18 field.                                 */
  #define VPRCSR_NORDIC_OUTBTGL_PIN18_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                             */
  #define VPRCSR_NORDIC_OUTBTGL_PIN18_TOGGLE (0x1UL) /*!< Pin is toggled                                                       */

/* PIN19 @Bit 19 : (unspecified) */
  #define VPRCSR_NORDIC_OUTBTGL_PIN19_Pos (19UL)     /*!< Position of PIN19 field.                                             */
  #define VPRCSR_NORDIC_OUTBTGL_PIN19_Msk (0x1UL << VPRCSR_NORDIC_OUTBTGL_PIN19_Pos) /*!< Bit mask of PIN19 field.             */
  #define VPRCSR_NORDIC_OUTBTGL_PIN19_Min (0x0UL)    /*!< Min enumerator value of PIN19 field.                                 */
  #define VPRCSR_NORDIC_OUTBTGL_PIN19_Max (0x1UL)    /*!< Max enumerator value of PIN19 field.                                 */
  #define VPRCSR_NORDIC_OUTBTGL_PIN19_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                             */
  #define VPRCSR_NORDIC_OUTBTGL_PIN19_TOGGLE (0x1UL) /*!< Pin is toggled                                                       */

/* PIN20 @Bit 20 : (unspecified) */
  #define VPRCSR_NORDIC_OUTBTGL_PIN20_Pos (20UL)     /*!< Position of PIN20 field.                                             */
  #define VPRCSR_NORDIC_OUTBTGL_PIN20_Msk (0x1UL << VPRCSR_NORDIC_OUTBTGL_PIN20_Pos) /*!< Bit mask of PIN20 field.             */
  #define VPRCSR_NORDIC_OUTBTGL_PIN20_Min (0x0UL)    /*!< Min enumerator value of PIN20 field.                                 */
  #define VPRCSR_NORDIC_OUTBTGL_PIN20_Max (0x1UL)    /*!< Max enumerator value of PIN20 field.                                 */
  #define VPRCSR_NORDIC_OUTBTGL_PIN20_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                             */
  #define VPRCSR_NORDIC_OUTBTGL_PIN20_TOGGLE (0x1UL) /*!< Pin is toggled                                                       */

/* PIN21 @Bit 21 : (unspecified) */
  #define VPRCSR_NORDIC_OUTBTGL_PIN21_Pos (21UL)     /*!< Position of PIN21 field.                                             */
  #define VPRCSR_NORDIC_OUTBTGL_PIN21_Msk (0x1UL << VPRCSR_NORDIC_OUTBTGL_PIN21_Pos) /*!< Bit mask of PIN21 field.             */
  #define VPRCSR_NORDIC_OUTBTGL_PIN21_Min (0x0UL)    /*!< Min enumerator value of PIN21 field.                                 */
  #define VPRCSR_NORDIC_OUTBTGL_PIN21_Max (0x1UL)    /*!< Max enumerator value of PIN21 field.                                 */
  #define VPRCSR_NORDIC_OUTBTGL_PIN21_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                             */
  #define VPRCSR_NORDIC_OUTBTGL_PIN21_TOGGLE (0x1UL) /*!< Pin is toggled                                                       */

/* PIN22 @Bit 22 : (unspecified) */
  #define VPRCSR_NORDIC_OUTBTGL_PIN22_Pos (22UL)     /*!< Position of PIN22 field.                                             */
  #define VPRCSR_NORDIC_OUTBTGL_PIN22_Msk (0x1UL << VPRCSR_NORDIC_OUTBTGL_PIN22_Pos) /*!< Bit mask of PIN22 field.             */
  #define VPRCSR_NORDIC_OUTBTGL_PIN22_Min (0x0UL)    /*!< Min enumerator value of PIN22 field.                                 */
  #define VPRCSR_NORDIC_OUTBTGL_PIN22_Max (0x1UL)    /*!< Max enumerator value of PIN22 field.                                 */
  #define VPRCSR_NORDIC_OUTBTGL_PIN22_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                             */
  #define VPRCSR_NORDIC_OUTBTGL_PIN22_TOGGLE (0x1UL) /*!< Pin is toggled                                                       */

/* PIN23 @Bit 23 : (unspecified) */
  #define VPRCSR_NORDIC_OUTBTGL_PIN23_Pos (23UL)     /*!< Position of PIN23 field.                                             */
  #define VPRCSR_NORDIC_OUTBTGL_PIN23_Msk (0x1UL << VPRCSR_NORDIC_OUTBTGL_PIN23_Pos) /*!< Bit mask of PIN23 field.             */
  #define VPRCSR_NORDIC_OUTBTGL_PIN23_Min (0x0UL)    /*!< Min enumerator value of PIN23 field.                                 */
  #define VPRCSR_NORDIC_OUTBTGL_PIN23_Max (0x1UL)    /*!< Max enumerator value of PIN23 field.                                 */
  #define VPRCSR_NORDIC_OUTBTGL_PIN23_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                             */
  #define VPRCSR_NORDIC_OUTBTGL_PIN23_TOGGLE (0x1UL) /*!< Pin is toggled                                                       */

/* PIN24 @Bit 24 : (unspecified) */
  #define VPRCSR_NORDIC_OUTBTGL_PIN24_Pos (24UL)     /*!< Position of PIN24 field.                                             */
  #define VPRCSR_NORDIC_OUTBTGL_PIN24_Msk (0x1UL << VPRCSR_NORDIC_OUTBTGL_PIN24_Pos) /*!< Bit mask of PIN24 field.             */
  #define VPRCSR_NORDIC_OUTBTGL_PIN24_Min (0x0UL)    /*!< Min enumerator value of PIN24 field.                                 */
  #define VPRCSR_NORDIC_OUTBTGL_PIN24_Max (0x1UL)    /*!< Max enumerator value of PIN24 field.                                 */
  #define VPRCSR_NORDIC_OUTBTGL_PIN24_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                             */
  #define VPRCSR_NORDIC_OUTBTGL_PIN24_TOGGLE (0x1UL) /*!< Pin is toggled                                                       */

/* PIN25 @Bit 25 : (unspecified) */
  #define VPRCSR_NORDIC_OUTBTGL_PIN25_Pos (25UL)     /*!< Position of PIN25 field.                                             */
  #define VPRCSR_NORDIC_OUTBTGL_PIN25_Msk (0x1UL << VPRCSR_NORDIC_OUTBTGL_PIN25_Pos) /*!< Bit mask of PIN25 field.             */
  #define VPRCSR_NORDIC_OUTBTGL_PIN25_Min (0x0UL)    /*!< Min enumerator value of PIN25 field.                                 */
  #define VPRCSR_NORDIC_OUTBTGL_PIN25_Max (0x1UL)    /*!< Max enumerator value of PIN25 field.                                 */
  #define VPRCSR_NORDIC_OUTBTGL_PIN25_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                             */
  #define VPRCSR_NORDIC_OUTBTGL_PIN25_TOGGLE (0x1UL) /*!< Pin is toggled                                                       */

