NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* PIN4 @Bit 4 : (unspecified) */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN4_Pos (4UL)      /*!< Position of PIN4 field.                                              */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN4_Msk (0x1UL << VPRCSR_NORDIC_OUTUBTGL_PIN4_Pos) /*!< Bit mask of PIN4 field.              */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN4_Min (0x0UL)    /*!< Min enumerator value of PIN4 field.                                  */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN4_Max (0x1UL)    /*!< Max enumerator value of PIN4 field.                                  */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN4_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                             */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN4_TOGGLE (0x1UL) /*!< Pin is toggled                                                       */

/* PIN5 @Bit 5 : (unspecified) */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN5_Pos (5UL)      /*!< Position of PIN5 field.                                              */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN5_Msk (0x1UL << VPRCSR_NORDIC_OUTUBTGL_PIN5_Pos) /*!< Bit mask of PIN5 field.              */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN5_Min (0x0UL)    /*!< Min enumerator value of PIN5 field.                                  */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN5_Max (0x1UL)    /*!< Max enumerator value of PIN5 field.                                  */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN5_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                             */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN5_TOGGLE (0x1UL) /*!< Pin is toggled                                                       */

/* PIN6 @Bit 6 : (unspecified) */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN6_Pos (6UL)      /*!< Position of PIN6 field.                                              */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN6_Msk (0x1UL << VPRCSR_NORDIC_OUTUBTGL_PIN6_Pos) /*!< Bit mask of PIN6 field.              */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN6_Min (0x0UL)    /*!< Min enumerator value of PIN6 field.                                  */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN6_Max (0x1UL)    /*!< Max enumerator value of PIN6 field.                                  */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN6_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                             */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN6_TOGGLE (0x1UL) /*!< Pin is toggled                                                       */

/* PIN7 @Bit 7 : (unspecified) */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN7_Pos (7UL)      /*!< Position of PIN7 field.                                              */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN7_Msk (0x1UL << VPRCSR_NORDIC_OUTUBTGL_PIN7_Pos) /*!< Bit mask of PIN7 field.              */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN7_Min (0x0UL)    /*!< Min enumerator value of PIN7 field.                                  */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN7_Max (0x1UL)    /*!< Max enumerator value of PIN7 field.                                  */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN7_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                             */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN7_TOGGLE (0x1UL) /*!< Pin is toggled                                                       */

/* PIN8 @Bit 8 : (unspecified) */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN8_Pos (8UL)      /*!< Position of PIN8 field.                                              */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN8_Msk (0x1UL << VPRCSR_NORDIC_OUTUBTGL_PIN8_Pos) /*!< Bit mask of PIN8 field.              */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN8_Min (0x0UL)    /*!< Min enumerator value of PIN8 field.                                  */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN8_Max (0x1UL)    /*!< Max enumerator value of PIN8 field.                                  */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN8_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                             */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN8_TOGGLE (0x1UL) /*!< Pin is toggled                                                       */

/* PIN9 @Bit 9 : (unspecified) */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN9_Pos (9UL)      /*!< Position of PIN9 field.                                              */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN9_Msk (0x1UL << VPRCSR_NORDIC_OUTUBTGL_PIN9_Pos) /*!< Bit mask of PIN9 field.              */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN9_Min (0x0UL)    /*!< Min enumerator value of PIN9 field.                                  */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN9_Max (0x1UL)    /*!< Max enumerator value of PIN9 field.                                  */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN9_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                             */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN9_TOGGLE (0x1UL) /*!< Pin is toggled                                                       */

/* PIN10 @Bit 10 : (unspecified) */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN10_Pos (10UL)    /*!< Position of PIN10 field.                                             */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN10_Msk (0x1UL << VPRCSR_NORDIC_OUTUBTGL_PIN10_Pos) /*!< Bit mask of PIN10 field.           */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN10_Min (0x0UL)   /*!< Min enumerator value of PIN10 field.                                 */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN10_Max (0x1UL)   /*!< Max enumerator value of PIN10 field.                                 */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN10_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                            */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN10_TOGGLE (0x1UL) /*!< Pin is toggled                                                      */

/* PIN11 @Bit 11 : (unspecified) */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN11_Pos (11UL)    /*!< Position of PIN11 field.                                             */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN11_Msk (0x1UL << VPRCSR_NORDIC_OUTUBTGL_PIN11_Pos) /*!< Bit mask of PIN11 field.           */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN11_Min (0x0UL)   /*!< Min enumerator value of PIN11 field.                                 */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN11_Max (0x1UL)   /*!< Max enumerator value of PIN11 field.                                 */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN11_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                            */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN11_TOGGLE (0x1UL) /*!< Pin is toggled                                                      */

/* PIN12 @Bit 12 : (unspecified) */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN12_Pos (12UL)    /*!< Position of PIN12 field.                                             */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN12_Msk (0x1UL << VPRCSR_NORDIC_OUTUBTGL_PIN12_Pos) /*!< Bit mask of PIN12 field.           */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN12_Min (0x0UL)   /*!< Min enumerator value of PIN12 field.                                 */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN12_Max (0x1UL)   /*!< Max enumerator value of PIN12 field.                                 */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN12_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                            */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN12_TOGGLE (0x1UL) /*!< Pin is toggled                                                      */

/* PIN13 @Bit 13 : (unspecified) */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN13_Pos (13UL)    /*!< Position of PIN13 field.                                             */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN13_Msk (0x1UL << VPRCSR_NORDIC_OUTUBTGL_PIN13_Pos) /*!< Bit mask of PIN13 field.           */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN13_Min (0x0UL)   /*!< Min enumerator value of PIN13 field.                                 */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN13_Max (0x1UL)   /*!< Max enumerator value of PIN13 field.                                 */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN13_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                            */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN13_TOGGLE (0x1UL) /*!< Pin is toggled                                                      */

/* PIN14 @Bit 14 : (unspecified) */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN14_Pos (14UL)    /*!< Position of PIN14 field.                                             */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN14_Msk (0x1UL << VPRCSR_NORDIC_OUTUBTGL_PIN14_Pos) /*!< Bit mask of PIN14 field.           */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN14_Min (0x0UL)   /*!< Min enumerator value of PIN14 field.                                 */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN14_Max (0x1UL)   /*!< Max enumerator value of PIN14 field.                                 */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN14_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                            */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN14_TOGGLE (0x1UL) /*!< Pin is toggled                                                      */

/* PIN15 @Bit 15 : (unspecified) */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN15_Pos (15UL)    /*!< Position of PIN15 field.                                             */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN15_Msk (0x1UL << VPRCSR_NORDIC_OUTUBTGL_PIN15_Pos) /*!< Bit mask of PIN15 field.           */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN15_Min (0x0UL)   /*!< Min enumerator value of PIN15 field.                                 */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN15_Max (0x1UL)   /*!< Max enumerator value of PIN15 field.                                 */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN15_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                            */
  #define VPRCSR_NORDIC_OUTUBTGL_PIN15_TOGGLE (0x1UL) /*!< Pin is toggled                                                      */


/**
  * @brief OUTBS [VPRCSR_NORDIC_OUTBS] Buffered GPIO Output Dirty Status
  */
  #define VPRCSR_NORDIC_OUTBS (0x00000BD8ul)
  #define VPRCSR_NORDIC_OUTBS_ResetValue (0x00000000UL) /*!< Reset value of OUTBS register.                                    */

/* OUTB @Bits 0..31 : Write to OUTB (if not dirty) */
  #define VPRCSR_NORDIC_OUTBS_OUTB_Pos (0UL)         /*!< Position of OUTB field.                                              */
  #define VPRCSR_NORDIC_OUTBS_OUTB_Msk (0xFFFFFFFFUL << VPRCSR_NORDIC_OUTBS_OUTB_Pos) /*!< Bit mask of OUTB field.             */

/* DIRTYBIT @Bit 0 : Read Buffer Dirty status */
  #define VPRCSR_NORDIC_OUTBS_DIRTYBIT_Pos (0UL)     /*!< Position of DIRTYBIT field.                                          */
  #define VPRCSR_NORDIC_OUTBS_DIRTYBIT_Msk (0x1UL << VPRCSR_NORDIC_OUTBS_DIRTYBIT_Pos) /*!< Bit mask of DIRTYBIT field.        */
  #define VPRCSR_NORDIC_OUTBS_DIRTYBIT_Min (0x0UL)   /*!< Min enumerator value of DIRTYBIT field.                              */
  #define VPRCSR_NORDIC_OUTBS_DIRTYBIT_Max (0x1UL)   /*!< Max enumerator value of DIRTYBIT field.                              */
  #define VPRCSR_NORDIC_OUTBS_DIRTYBIT_CLEAN (0x0UL) /*!< Buffer is clean                                                      */
  #define VPRCSR_NORDIC_OUTBS_DIRTYBIT_DIRTY (0x1UL) /*!< Buffer is dirty                                                      */


/**
  * @brief DIRBS [VPRCSR_NORDIC_DIRBS] Buffered GPIO pin Direction Dirty Status
  */
  #define VPRCSR_NORDIC_DIRBS (0x00000BD9ul)
  #define VPRCSR_NORDIC_DIRBS_ResetValue (0x00000000UL) /*!< Reset value of DIRBS register.                                    */

/* DIRB @Bits 0..31 : Write to DIRB (if not dirty) */
  #define VPRCSR_NORDIC_DIRBS_DIRB_Pos (0UL)         /*!< Position of DIRB field.                                              */
  #define VPRCSR_NORDIC_DIRBS_DIRB_Msk (0xFFFFFFFFUL << VPRCSR_NORDIC_DIRBS_DIRB_Pos) /*!< Bit mask of DIRB field.             */

/* DIRTYBIT @Bit 0 : Read Buffer Dirty status */
  #define VPRCSR_NORDIC_DIRBS_DIRTYBIT_Pos (0UL)     /*!< Position of DIRTYBIT field.                                          */
  #define VPRCSR_NORDIC_DIRBS_DIRTYBIT_Msk (0x1UL << VPRCSR_NORDIC_DIRBS_DIRTYBIT_Pos) /*!< Bit mask of DIRTYBIT field.        */
  #define VPRCSR_NORDIC_DIRBS_DIRTYBIT_Min (0x0UL)   /*!< Min enumerator value of DIRTYBIT field.                              */
  #define VPRCSR_NORDIC_DIRBS_DIRTYBIT_Max (0x1UL)   /*!< Max enumerator value of DIRTYBIT field.                              */
  #define VPRCSR_NORDIC_DIRBS_DIRTYBIT_CLEAN (0x0UL) /*!< Buffer is clean                                                      */
  #define VPRCSR_NORDIC_DIRBS_DIRTYBIT_DIRTY (0x1UL) /*!< Buffer is dirty                                                      */


/**
  * @brief DIROUTBS [VPRCSR_NORDIC_DIROUTBS] Combination of DIRB and OUTB Dirty Status
  */
  #define VPRCSR_NORDIC_DIROUTBS (0x00000BDAul)
  #define VPRCSR_NORDIC_DIROUTBS_ResetValue (0x00000000UL) /*!< Reset value of DIROUTBS register.                              */

