NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* PIN26 @Bit 26 : (unspecified) */
  #define VPRCSR_NORDIC_INB_PIN26_Pos (26UL)         /*!< Position of PIN26 field.                                             */
  #define VPRCSR_NORDIC_INB_PIN26_Msk (0x1UL << VPRCSR_NORDIC_INB_PIN26_Pos) /*!< Bit mask of PIN26 field.                     */
  #define VPRCSR_NORDIC_INB_PIN26_Min (0x0UL)        /*!< Min enumerator value of PIN26 field.                                 */
  #define VPRCSR_NORDIC_INB_PIN26_Max (0x1UL)        /*!< Max enumerator value of PIN26 field.                                 */
  #define VPRCSR_NORDIC_INB_PIN26_LOW (0x0UL)        /*!< Pin is Low                                                           */
  #define VPRCSR_NORDIC_INB_PIN26_HIGH (0x1UL)       /*!< Pin is High                                                          */

/* PIN27 @Bit 27 : (unspecified) */
  #define VPRCSR_NORDIC_INB_PIN27_Pos (27UL)         /*!< Position of PIN27 field.                                             */
  #define VPRCSR_NORDIC_INB_PIN27_Msk (0x1UL << VPRCSR_NORDIC_INB_PIN27_Pos) /*!< Bit mask of PIN27 field.                     */
  #define VPRCSR_NORDIC_INB_PIN27_Min (0x0UL)        /*!< Min enumerator value of PIN27 field.                                 */
  #define VPRCSR_NORDIC_INB_PIN27_Max (0x1UL)        /*!< Max enumerator value of PIN27 field.                                 */
  #define VPRCSR_NORDIC_INB_PIN27_LOW (0x0UL)        /*!< Pin is Low                                                           */
  #define VPRCSR_NORDIC_INB_PIN27_HIGH (0x1UL)       /*!< Pin is High                                                          */

/* PIN28 @Bit 28 : (unspecified) */
  #define VPRCSR_NORDIC_INB_PIN28_Pos (28UL)         /*!< Position of PIN28 field.                                             */
  #define VPRCSR_NORDIC_INB_PIN28_Msk (0x1UL << VPRCSR_NORDIC_INB_PIN28_Pos) /*!< Bit mask of PIN28 field.                     */
  #define VPRCSR_NORDIC_INB_PIN28_Min (0x0UL)        /*!< Min enumerator value of PIN28 field.                                 */
  #define VPRCSR_NORDIC_INB_PIN28_Max (0x1UL)        /*!< Max enumerator value of PIN28 field.                                 */
  #define VPRCSR_NORDIC_INB_PIN28_LOW (0x0UL)        /*!< Pin is Low                                                           */
  #define VPRCSR_NORDIC_INB_PIN28_HIGH (0x1UL)       /*!< Pin is High                                                          */

/* PIN29 @Bit 29 : (unspecified) */
  #define VPRCSR_NORDIC_INB_PIN29_Pos (29UL)         /*!< Position of PIN29 field.                                             */
  #define VPRCSR_NORDIC_INB_PIN29_Msk (0x1UL << VPRCSR_NORDIC_INB_PIN29_Pos) /*!< Bit mask of PIN29 field.                     */
  #define VPRCSR_NORDIC_INB_PIN29_Min (0x0UL)        /*!< Min enumerator value of PIN29 field.                                 */
  #define VPRCSR_NORDIC_INB_PIN29_Max (0x1UL)        /*!< Max enumerator value of PIN29 field.                                 */
  #define VPRCSR_NORDIC_INB_PIN29_LOW (0x0UL)        /*!< Pin is Low                                                           */
  #define VPRCSR_NORDIC_INB_PIN29_HIGH (0x1UL)       /*!< Pin is High                                                          */

/* PIN30 @Bit 30 : (unspecified) */
  #define VPRCSR_NORDIC_INB_PIN30_Pos (30UL)         /*!< Position of PIN30 field.                                             */
  #define VPRCSR_NORDIC_INB_PIN30_Msk (0x1UL << VPRCSR_NORDIC_INB_PIN30_Pos) /*!< Bit mask of PIN30 field.                     */
  #define VPRCSR_NORDIC_INB_PIN30_Min (0x0UL)        /*!< Min enumerator value of PIN30 field.                                 */
  #define VPRCSR_NORDIC_INB_PIN30_Max (0x1UL)        /*!< Max enumerator value of PIN30 field.                                 */
  #define VPRCSR_NORDIC_INB_PIN30_LOW (0x0UL)        /*!< Pin is Low                                                           */
  #define VPRCSR_NORDIC_INB_PIN30_HIGH (0x1UL)       /*!< Pin is High                                                          */

/* PIN31 @Bit 31 : (unspecified) */
  #define VPRCSR_NORDIC_INB_PIN31_Pos (31UL)         /*!< Position of PIN31 field.                                             */
  #define VPRCSR_NORDIC_INB_PIN31_Msk (0x1UL << VPRCSR_NORDIC_INB_PIN31_Pos) /*!< Bit mask of PIN31 field.                     */
  #define VPRCSR_NORDIC_INB_PIN31_Min (0x0UL)        /*!< Min enumerator value of PIN31 field.                                 */
  #define VPRCSR_NORDIC_INB_PIN31_Max (0x1UL)        /*!< Max enumerator value of PIN31 field.                                 */
  #define VPRCSR_NORDIC_INB_PIN31_LOW (0x0UL)        /*!< Pin is Low                                                           */
  #define VPRCSR_NORDIC_INB_PIN31_HIGH (0x1UL)       /*!< Pin is High                                                          */


/**
  * @brief OUTUB [VPRCSR_NORDIC_OUTUB] Buffered write to Unshifted parts of OUT
  */
  #define VPRCSR_NORDIC_OUTUB (0x00000BE7ul)
  #define VPRCSR_NORDIC_OUTUB_ResetValue (0x00000000UL) /*!< Reset value of OUTUB register.                                    */

/* OUT @Bits 0..15 : Written to OUT MSBs that are not driven by OUTB shifting. */
  #define VPRCSR_NORDIC_OUTUB_OUT_Pos (0UL)          /*!< Position of OUT field.                                               */
  #define VPRCSR_NORDIC_OUTUB_OUT_Msk (0xFFFFUL << VPRCSR_NORDIC_OUTUB_OUT_Pos) /*!< Bit mask of OUT field.                    */


/**
  * @brief SHIFTCNTCOMP [VPRCSR_NORDIC_SHIFTCNTCOMP] SHIFTCNTIN/OUT compare values
  */
  #define VPRCSR_NORDIC_SHIFTCNTCOMP (0x00000BE8ul)
  #define VPRCSR_NORDIC_SHIFTCNTCOMP_ResetValue (0x00000000UL) /*!< Reset value of SHIFTCNTCOMP register.                      */

/* OUTCOMPVAL @Bits 0..5 : Compare value for SHIFTCNTOUT */
  #define VPRCSR_NORDIC_SHIFTCNTCOMP_OUTCOMPVAL_Pos (0UL) /*!< Position of OUTCOMPVAL field.                                   */
  #define VPRCSR_NORDIC_SHIFTCNTCOMP_OUTCOMPVAL_Msk (0x3FUL << VPRCSR_NORDIC_SHIFTCNTCOMP_OUTCOMPVAL_Pos) /*!< Bit mask of
                                                                            OUTCOMPVAL field.*/

/* INCOMPVAL @Bits 8..13 : Compare value for SHIFTCNTIN */
  #define VPRCSR_NORDIC_SHIFTCNTCOMP_INCOMPVAL_Pos (8UL) /*!< Position of INCOMPVAL field.                                     */
  #define VPRCSR_NORDIC_SHIFTCNTCOMP_INCOMPVAL_Msk (0x3FUL << VPRCSR_NORDIC_SHIFTCNTCOMP_INCOMPVAL_Pos) /*!< Bit mask of
                                                                            INCOMPVAL field.*/


/**
  * @brief WAITEVENT [VPRCSR_NORDIC_WAITEVENT] Wait for internal event
  */
  #define VPRCSR_NORDIC_WAITEVENT (0x00000BE9ul)
  #define VPRCSR_NORDIC_WAITEVENT_ResetValue (0x00000000UL) /*!< Reset value of WAITEVENT register.                            */

/* IEVENTCNT0 @Bit 0 : CNT0's event */
  #define VPRCSR_NORDIC_WAITEVENT_IEVENTCNT0_Pos (0UL) /*!< Position of IEVENTCNT0 field.                                      */
  #define VPRCSR_NORDIC_WAITEVENT_IEVENTCNT0_Msk (0x1UL << VPRCSR_NORDIC_WAITEVENT_IEVENTCNT0_Pos) /*!< Bit mask of IEVENTCNT0
                                                                            field.*/

/* IEVENTCNT1 @Bit 1 : CNT1's event */
  #define VPRCSR_NORDIC_WAITEVENT_IEVENTCNT1_Pos (1UL) /*!< Position of IEVENTCNT1 field.                                      */
  #define VPRCSR_NORDIC_WAITEVENT_IEVENTCNT1_Msk (0x1UL << VPRCSR_NORDIC_WAITEVENT_IEVENTCNT1_Pos) /*!< Bit mask of IEVENTCNT1
                                                                            field.*/

/* IEVENTVIO @Bit 2 : Event generated by a specific VIO pin */
  #define VPRCSR_NORDIC_WAITEVENT_IEVENTVIO_Pos (2UL) /*!< Position of IEVENTVIO field.                                        */
  #define VPRCSR_NORDIC_WAITEVENT_IEVENTVIO_Msk (0x1UL << VPRCSR_NORDIC_WAITEVENT_IEVENTVIO_Pos) /*!< Bit mask of IEVENTVIO
                                                                            field.*/

/* IEVENTVIOANY @Bit 3 : Event generated by a change in any VIO pin */
  #define VPRCSR_NORDIC_WAITEVENT_IEVENTVIOANY_Pos (3UL) /*!< Position of IEVENTVIOANY field.                                  */
  #define VPRCSR_NORDIC_WAITEVENT_IEVENTVIOANY_Msk (0x1UL << VPRCSR_NORDIC_WAITEVENT_IEVENTVIOANY_Pos) /*!< Bit mask of
                                                                            IEVENTVIOANY field.*/

/* IEVENTVTASKSANY @Bit 4 : Event when any TASK is triggered */
  #define VPRCSR_NORDIC_WAITEVENT_IEVENTVTASKSANY_Pos (4UL) /*!< Position of IEVENTVTASKSANY field.                            */
  #define VPRCSR_NORDIC_WAITEVENT_IEVENTVTASKSANY_Msk (0x1UL << VPRCSR_NORDIC_WAITEVENT_IEVENTVTASKSANY_Pos) /*!< Bit mask of
                                                                            IEVENTVTASKSANY field.*/

/* IEVENTSHIFTCNTOUT @Bit 5 : Event for SHIFTCNTOUT when reaching a compare value defined in SHIFTCNTCOMP */
  #define VPRCSR_NORDIC_WAITEVENT_IEVENTSHIFTCNTOUT_Pos (5UL) /*!< Position of IEVENTSHIFTCNTOUT field.                        */
  #define VPRCSR_NORDIC_WAITEVENT_IEVENTSHIFTCNTOUT_Msk (0x1UL << VPRCSR_NORDIC_WAITEVENT_IEVENTSHIFTCNTOUT_Pos) /*!< Bit mask
                                                                            of IEVENTSHIFTCNTOUT field.*/

/* IEVENTSHIFTCNTIN @Bit 6 : Event for SHIFTCNTIN when reaching a compare value defined in SHIFTCNTCOMP */
  #define VPRCSR_NORDIC_WAITEVENT_IEVENTSHIFTCNTIN_Pos (6UL) /*!< Position of IEVENTSHIFTCNTIN field.                          */
  #define VPRCSR_NORDIC_WAITEVENT_IEVENTSHIFTCNTIN_Msk (0x1UL << VPRCSR_NORDIC_WAITEVENT_IEVENTSHIFTCNTIN_Pos) /*!< Bit mask of
                                                                            IEVENTSHIFTCNTIN field.*/


/**
  * @brief WAITINPUT [VPRCSR_NORDIC_WAITINPUT] Wait input
  */
  #define VPRCSR_NORDIC_WAITINPUT (0x00000BEAul)
  #define VPRCSR_NORDIC_WAITINPUT_ResetValue (0x00000000UL) /*!< Reset value of WAITINPUT register.                            */

