NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_types.h
/* VTASKSVIO @Bits 0..31 : VTASKS or VIO pins */
  #define VPRCSR_NORDIC_WAITINPUT_VTASKSVIO_Pos (0UL) /*!< Position of VTASKSVIO field.                                        */
  #define VPRCSR_NORDIC_WAITINPUT_VTASKSVIO_Msk (0xFFFFFFFFUL << VPRCSR_NORDIC_WAITINPUT_VTASKSVIO_Pos) /*!< Bit mask of
                                                                            VTASKSVIO field.*/


/**
  * @brief RTPINTEN [VPRCSR_NORDIC_RTPINTEN] Interrupt enable
  */
  #define VPRCSR_NORDIC_RTPINTEN (0x00000BEBul)
  #define VPRCSR_NORDIC_RTPINTEN_ResetValue (0x00000000UL) /*!< Reset value of RTPINTEN register.                              */

/* CNT0 @Bit 0 : Interrupt enable for IEVENTCNT0, alias of VPRNORDICCTRL.CNTIRQENABLE */
  #define VPRCSR_NORDIC_RTPINTEN_CNT0_Pos (0UL)      /*!< Position of CNT0 field.                                              */
  #define VPRCSR_NORDIC_RTPINTEN_CNT0_Msk (0x1UL << VPRCSR_NORDIC_RTPINTEN_CNT0_Pos) /*!< Bit mask of CNT0 field.              */

/* CNT1 @Bit 1 : Interrupt enable for IEVENTCNT1 */
  #define VPRCSR_NORDIC_RTPINTEN_CNT1_Pos (1UL)      /*!< Position of CNT1 field.                                              */
  #define VPRCSR_NORDIC_RTPINTEN_CNT1_Msk (0x1UL << VPRCSR_NORDIC_RTPINTEN_CNT1_Pos) /*!< Bit mask of CNT1 field.              */

/* VIO @Bit 2 : Interrupt enable for IEVENTVIO */
  #define VPRCSR_NORDIC_RTPINTEN_VIO_Pos (2UL)       /*!< Position of VIO field.                                               */
  #define VPRCSR_NORDIC_RTPINTEN_VIO_Msk (0x1UL << VPRCSR_NORDIC_RTPINTEN_VIO_Pos) /*!< Bit mask of VIO field.                 */

/* VIOANY @Bit 3 : Interrupt enable for IEVENTVIOANY */
  #define VPRCSR_NORDIC_RTPINTEN_VIOANY_Pos (3UL)    /*!< Position of VIOANY field.                                            */
  #define VPRCSR_NORDIC_RTPINTEN_VIOANY_Msk (0x1UL << VPRCSR_NORDIC_RTPINTEN_VIOANY_Pos) /*!< Bit mask of VIOANY field.        */

/* VTASKSANY @Bit 4 : Interrupt enable for IEVENTVTASKSANY */
  #define VPRCSR_NORDIC_RTPINTEN_VTASKSANY_Pos (4UL) /*!< Position of VTASKSANY field.                                         */
  #define VPRCSR_NORDIC_RTPINTEN_VTASKSANY_Msk (0x1UL << VPRCSR_NORDIC_RTPINTEN_VTASKSANY_Pos) /*!< Bit mask of VTASKSANY
                                                                            field.*/

/* SHIFTCNTOUT @Bit 5 : Interrupt enable for IEVENTSHIFTCNTOUT */
  #define VPRCSR_NORDIC_RTPINTEN_SHIFTCNTOUT_Pos (5UL) /*!< Position of SHIFTCNTOUT field.                                     */
  #define VPRCSR_NORDIC_RTPINTEN_SHIFTCNTOUT_Msk (0x1UL << VPRCSR_NORDIC_RTPINTEN_SHIFTCNTOUT_Pos) /*!< Bit mask of SHIFTCNTOUT
                                                                            field.*/

/* SHIFTCNTIN @Bit 6 : Interrupt enable for IEVENTSHIFTCNTIN */
  #define VPRCSR_NORDIC_RTPINTEN_SHIFTCNTIN_Pos (6UL) /*!< Position of SHIFTCNTIN field.                                       */
  #define VPRCSR_NORDIC_RTPINTEN_SHIFTCNTIN_Msk (0x1UL << VPRCSR_NORDIC_RTPINTEN_SHIFTCNTIN_Pos) /*!< Bit mask of SHIFTCNTIN
                                                                            field.*/


/**
  * @brief OUTUBTRIG [VPRCSR_NORDIC_OUTUBTRIG] OUTUB trigger select
  */
  #define VPRCSR_NORDIC_OUTUBTRIG (0x00000BECul)
  #define VPRCSR_NORDIC_OUTUBTRIG_ResetValue (0x00000000UL) /*!< Reset value of OUTUBTRIG register.                            */

/* SEL @Bits 0..2 : OUTUBTRIG select */
  #define VPRCSR_NORDIC_OUTUBTRIG_SEL_Pos (0UL)      /*!< Position of SEL field.                                               */
  #define VPRCSR_NORDIC_OUTUBTRIG_SEL_Msk (0x7UL << VPRCSR_NORDIC_OUTUBTRIG_SEL_Pos) /*!< Bit mask of SEL field.               */
  #define VPRCSR_NORDIC_OUTUBTRIG_SEL_Min (0x0UL)    /*!< Min enumerator value of SEL field.                                   */
  #define VPRCSR_NORDIC_OUTUBTRIG_SEL_Max (0x6UL)    /*!< Max enumerator value of SEL field.                                   */
  #define VPRCSR_NORDIC_OUTUBTRIG_SEL_IEVENTSHIFTCNTIN (0x6UL) /*!< (unspecified)                                              */
  #define VPRCSR_NORDIC_OUTUBTRIG_SEL_IEVENTSHIFTCNTOUT (0x5UL) /*!< (unspecified)                                             */
  #define VPRCSR_NORDIC_OUTUBTRIG_SEL_IEVENTVTASKSANY (0x4UL) /*!< (unspecified)                                               */
  #define VPRCSR_NORDIC_OUTUBTRIG_SEL_IEVENTVIOANY (0x3UL) /*!< (unspecified)                                                  */
  #define VPRCSR_NORDIC_OUTUBTRIG_SEL_IEVENTVIO (0x2UL) /*!< (unspecified)                                                     */
  #define VPRCSR_NORDIC_OUTUBTRIG_SEL_IEVENTCNT1 (0x1UL) /*!< (unspecified)                                                    */
  #define VPRCSR_NORDIC_OUTUBTRIG_SEL_IEVENTCNT0 (0x0UL) /*!< (unspecified)                                                    */




/* =========================================================================================================================== */
/* ================                                          VREGUSB                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ===================================================== Struct VREGUSB ====================================================== */
/**
  * @brief VREGUSB peripheral
  */
  typedef struct {                                   /*!< VREGUSB Structure                                                    */
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000000) Enable and start VREGUSB so that it can detect VBUS   */
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x00000004) Stop and disable VREGUSB                              */
    __IM uint32_t RESERVED[63];
    __IOM uint32_t EVENTS_VBUSDETECTED;              /*!< (@ 0x00000104) VBUS detected                                         */
    __IM uint32_t RESERVED1;
    __IOM uint32_t EVENTS_SETTLED3V3;                /*!< (@ 0x0000010C) 3V3 settled                                           */
    __IOM uint32_t EVENTS_VBUSREMOVED;               /*!< (@ 0x00000110) VBUS removed                                          */
    __IM uint32_t RESERVED2[123];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
  } NRF_VREGUSB_Type;                                /*!< Size = 784 (0x310)                                                   */

/* VREGUSB_TASKS_START: Enable and start VREGUSB so that it can detect VBUS */
  #define VREGUSB_TASKS_START_ResetValue (0x00000000UL) /*!< Reset value of TASKS_START register.                              */

/* TASKS_START @Bit 0 : Enable and start VREGUSB so that it can detect VBUS */
  #define VREGUSB_TASKS_START_TASKS_START_Pos (0UL)  /*!< Position of TASKS_START field.                                       */
  #define VREGUSB_TASKS_START_TASKS_START_Msk (0x1UL << VREGUSB_TASKS_START_TASKS_START_Pos) /*!< Bit mask of TASKS_START
                                                                            field.*/
  #define VREGUSB_TASKS_START_TASKS_START_Min (0x1UL) /*!< Min enumerator value of TASKS_START field.                          */
  #define VREGUSB_TASKS_START_TASKS_START_Max (0x1UL) /*!< Max enumerator value of TASKS_START field.                          */
  #define VREGUSB_TASKS_START_TASKS_START_Trigger (0x1UL) /*!< Trigger task                                                    */


/* VREGUSB_TASKS_STOP: Stop and disable VREGUSB */
  #define VREGUSB_TASKS_STOP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_STOP register.                                */

/* TASKS_STOP @Bit 0 : Stop and disable VREGUSB */
  #define VREGUSB_TASKS_STOP_TASKS_STOP_Pos (0UL)    /*!< Position of TASKS_STOP field.                                        */
  #define VREGUSB_TASKS_STOP_TASKS_STOP_Msk (0x1UL << VREGUSB_TASKS_STOP_TASKS_STOP_Pos) /*!< Bit mask of TASKS_STOP field.    */
  #define VREGUSB_TASKS_STOP_TASKS_STOP_Min (0x1UL)  /*!< Min enumerator value of TASKS_STOP field.                            */
  #define VREGUSB_TASKS_STOP_TASKS_STOP_Max (0x1UL)  /*!< Max enumerator value of TASKS_STOP field.                            */
  #define VREGUSB_TASKS_STOP_TASKS_STOP_Trigger (0x1UL) /*!< Trigger task                                                      */


/* VREGUSB_EVENTS_VBUSDETECTED: VBUS detected */
  #define VREGUSB_EVENTS_VBUSDETECTED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_VBUSDETECTED register.              */

